[Survived] StringLiteral
src/cache-key.ts:25:20
 import { canonicalJsonStringify, type JsonValue } from './canonical-json.js';
 
 /** Domain-separation tag mixed into every key so this scheme can't collide with others. */
-const KEY_DOMAIN = 'tryit/cache/v1';
+const KEY_DOMAIN = "";
 
 /** The content from which a cache key is derived. */

[Killed] BlockStatement
src/cache-key.ts:46:59
  * Output: 64-char lowercase hex string suitable for {@link CacheKeyParts.personImageHash}.
  * This makes the cache content-addressed: identical image bytes hash identically.
  */
-export function hashImageBytes(bytes: Uint8Array): string {
-  return createHash('sha256').update(bytes).digest('hex');
-}
+export function hashImageBytes(bytes: Uint8Array): string {}
 
 /**
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received undefined

[Killed] BlockStatement
src/cache-key.ts:59:62
  * Failure modes: throws if params contain unserializable values (delegated to
  * {@link canonicalJsonStringify}, fail-closed).
  */
-export function deriveCacheKey(parts: CacheKeyParts): string {
-  const canonicalParams = canonicalJsonStringify(parts.params);
-
-  const hash = createHash('sha256');
-  // Domain separation: distinguishes this scheme from any other SHA-256 use.
-  hashField(hash, KEY_DOMAIN);
-  // tenant isolation (T1): tenantId is part of the hashed material...
-  hashField(hash, parts.tenantId);
-  hashField(hash, parts.personImageHash);
-  hashField(hash, parts.productId);
-  hashField(hash, canonicalParams);
-  const digest = hash.digest('hex');
-
-  // ...AND a literal prefix, so keys from different tenants live in disjoint
-  // namespaces even before the digest is considered.
-  return `${prefixSafe(parts.tenantId)}:${digest}`;
-}
+export function deriveCacheKey(parts: CacheKeyParts): string {}
 
 /**
killedBy: ResultCache.getOrCompute — distinct keys are independent different requests each miss once and never share results
statusReason: expected { value: 'A', cached: true } to deeply equal { value: 'B', cached: false }

[Killed] StringLiteral
src/cache-key.ts:70:30
   hashField(hash, parts.personImageHash);
   hashField(hash, parts.productId);
   hashField(hash, canonicalParams);
-  const digest = hash.digest('hex');
+  const digest = hash.digest("");
 
   // ...AND a literal prefix, so keys from different tenants live in disjoint
killedBy: deriveCacheKey — shape produces <tenantId>:<sha256hex>
statusReason: expected 't-1:\u0004\u007f\ufffdm)K.\ufffdfJ]\u…' to match /^t-1:[0-9a-f]{64}$/

[Killed] BlockStatement
src/cache-key.ts:85:78
  * each UTF-8 field before the field makes the encoding injective, so distinct
  * tuples of fields can never produce the same hash input.
  */
-function hashField(hash: ReturnType<typeof createHash>, field: string): void {
-  const bytes = Buffer.from(field, 'utf8');
-  hash.update(`${bytes.length}:`);
-  hash.update(bytes);
-}
+function hashField(hash: ReturnType<typeof createHash>, field: string): void {}
 
 /**
killedBy: deriveCacheKey — tenant isolation (threat T1) the digest itself (not just the prefix) differs by tenant
statusReason: expected 'e3b0c44298fc1c149afbf4c8996fb92427ae4…' not to be 'e3b0c44298fc1c149afbf4c8996fb92427ae4…' // Object.is equality

[Killed] BlockStatement
src/cache-key.ts:99:47
  * ':' and '%' the tenantId might contain, preserving the disjoint-namespace
  * guarantee even for adversarial tenant identifiers.
  */
-function prefixSafe(tenantId: string): string {
-  return tenantId.replace(/%/g, '%25').replace(/:/g, '%3A');
-}
+function prefixSafe(tenantId: string): string {}
 
killedBy: deriveCacheKey — shape produces <tenantId>:<sha256hex>
statusReason: expected 'undefined:047fab6d294b2eaf664a5d1b3a7…' to match /^t-1:[0-9a-f]{64}$/
