[Survived] StringLiteral
src/audit.ts:15:52
 import { ProviderIdSchema } from './providers.js';
 
 /** The outcome of an audited action: it was permitted, refused, or errored. */
-export const AuditOutcomeSchema = z.enum(['allow', 'deny', 'error']);
+export const AuditOutcomeSchema = z.enum(['allow', "", 'error']);
 
 /** An audited action outcome. */

[Killed] MethodExpression
src/audit.ts:28:12
  * because not every audited action touches a provider or incurs cost. `ts` is an ISO-8601 datetime.
  */
 export const AuditEventSchema = z.object({
-  eventId: z.string().min(1),
+  eventId: z.string().max(1),
   ts: z.string().datetime(),
   tenantId: z.string().min(1),
killedBy: parseAuditEvent parses a valid allow event
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/audit.ts:30:13
 export const AuditEventSchema = z.object({
   eventId: z.string().min(1),
   ts: z.string().datetime(),
-  tenantId: z.string().min(1),
+  tenantId: z.string().max(1),
   actor: z.string().min(1),
   action: z.string().min(1),
killedBy: parseAuditEvent parses a valid allow event
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/audit.ts:31:10
   eventId: z.string().min(1),
   ts: z.string().datetime(),
   tenantId: z.string().min(1),
-  actor: z.string().min(1),
+  actor: z.string().max(1),
   action: z.string().min(1),
   requestId: z.string().min(1),
killedBy: parseAuditEvent parses a valid allow event
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/audit.ts:32:11
   ts: z.string().datetime(),
   tenantId: z.string().min(1),
   actor: z.string().min(1),
-  action: z.string().min(1),
+  action: z.string().max(1),
   requestId: z.string().min(1),
   provider: ProviderIdSchema.optional(),
killedBy: parseAuditEvent parses a valid allow event
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/audit.ts:33:14
   tenantId: z.string().min(1),
   actor: z.string().min(1),
   action: z.string().min(1),
-  requestId: z.string().min(1),
+  requestId: z.string().max(1),
   provider: ProviderIdSchema.optional(),
   costUsd: z.number().nonnegative().optional(),
killedBy: parseAuditEvent parses a valid allow event
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] BlockStatement
src/audit.ts:47:61
  *
  * @throws {z.ZodError} if the input does not satisfy {@link AuditEventSchema}.
  */
-export function parseAuditEvent(input: unknown): AuditEvent {
-  // fail-closed: a malformed audit record is rejected so the trail cannot be corrupted.
-  return AuditEventSchema.parse(input);
-}
+export function parseAuditEvent(input: unknown): AuditEvent {}
 
 /** Non-throwing variant of {@link parseAuditEvent}. */
killedBy: parseAuditEvent parses a valid allow event
statusReason: expected undefined to deeply equal { eventId: 'evt-1', …(6) }

[Killed] BlockStatement
src/audit.ts:53:97
 }
 
 /** Non-throwing variant of {@link parseAuditEvent}. */
-export function safeParseAuditEvent(input: unknown): z.SafeParseReturnType<unknown, AuditEvent> {
-  return AuditEventSchema.safeParse(input);
-}
+export function safeParseAuditEvent(input: unknown): z.SafeParseReturnType<unknown, AuditEvent> {}
 
killedBy: parseAuditEvent accepts every outcome value
statusReason: Cannot read properties of undefined (reading 'success')
