[Killed] BlockStatement
src/cache-store.ts:61:51
   readonly #maxEntries: number;
   readonly #clock: Clock;
 
-  constructor(options: InMemoryCacheStoreOptions) {
-    if (!Number.isInteger(options.maxEntries) || options.maxEntries < 1) {
-      // fail-closed: a non-positive capacity is a programming error, not a no-op.
-      throw new RangeError(`InMemoryCacheStore: maxEntries must be an integer >= 1, got ${options.maxEntries}`);
-    }
-    this.#maxEntries = options.maxEntries;
-    this.#clock = options.clock ?? Date.now;
-  }
+  constructor(options: InMemoryCacheStoreOptions) {}
 
   get(key: string): V | undefined {
killedBy: InMemoryCacheStore — construction rejects non-positive or non-integer maxEntries (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/cache-store.ts:62:50
   readonly #clock: Clock;
 
   constructor(options: InMemoryCacheStoreOptions) {
-    if (!Number.isInteger(options.maxEntries) || options.maxEntries < 1) {
+    if (!Number.isInteger(options.maxEntries) || false) {
       // fail-closed: a non-positive capacity is a programming error, not a no-op.
       throw new RangeError(`InMemoryCacheStore: maxEntries must be an integer >= 1, got ${options.maxEntries}`);
killedBy: InMemoryCacheStore — construction rejects non-positive or non-integer maxEntries (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/cache-store.ts:62:9
   readonly #clock: Clock;
 
   constructor(options: InMemoryCacheStoreOptions) {
-    if (!Number.isInteger(options.maxEntries) || options.maxEntries < 1) {
+    if (false) {
       // fail-closed: a non-positive capacity is a programming error, not a no-op.
       throw new RangeError(`InMemoryCacheStore: maxEntries must be an integer >= 1, got ${options.maxEntries}`);
killedBy: InMemoryCacheStore — construction rejects non-positive or non-integer maxEntries (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] LogicalOperator
src/cache-store.ts:67:19
       throw new RangeError(`InMemoryCacheStore: maxEntries must be an integer >= 1, got ${options.maxEntries}`);
     }
     this.#maxEntries = options.maxEntries;
-    this.#clock = options.clock ?? Date.now;
+    this.#clock = options.clock && Date.now;
   }
 
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:70:35
     this.#clock = options.clock ?? Date.now;
   }
 
-  get(key: string): V | undefined {
-    const entry = this.#entries.get(key);
-    if (entry === undefined) {
-      return undefined;
-    }
-    if (this.#isExpired(entry)) {
-      this.#entries.delete(key);
-      return undefined;
-    }
-    // Mark most-recently-used: delete + re-insert moves it to the tail.
-    this.#entries.delete(key);
-    this.#entries.set(key, entry);
-    return entry.value;
-  }
+  get(key: string): V | undefined {}
 
   put(key: string, value: V, ttlMs?: number): void {
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/cache-store.ts:72:9
 
   get(key: string): V | undefined {
     const entry = this.#entries.get(key);
-    if (entry === undefined) {
+    if (entry !== undefined) {
       return undefined;
     }
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:72:9
 
   get(key: string): V | undefined {
     const entry = this.#entries.get(key);
-    if (entry === undefined) {
+    if (false) {
       return undefined;
     }
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: Cannot read properties of undefined (reading 'expiresAt')

[Killed] BlockStatement
src/cache-store.ts:75:33
     if (entry === undefined) {
       return undefined;
     }
-    if (this.#isExpired(entry)) {
-      this.#entries.delete(key);
-      return undefined;
-    }
+    if (this.#isExpired(entry)) {}
     // Mark most-recently-used: delete + re-insert moves it to the tail.
     this.#entries.delete(key);
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary ttlMs of 0 means live only at the instant of insertion
statusReason: expected 7 to be undefined

[Killed] ConditionalExpression
src/cache-store.ts:75:9
     if (entry === undefined) {
       return undefined;
     }
-    if (this.#isExpired(entry)) {
+    if (true) {
       this.#entries.delete(key);
       return undefined;
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:85:52
     return entry.value;
   }
 
-  put(key: string, value: V, ttlMs?: number): void {
-    const expiresAt = this.#computeExpiry(ttlMs);
-    // Re-inserting overwrites and refreshes recency in one step.
-    this.#entries.delete(key);
-    this.#entries.set(key, { value, expiresAt });
-    this.#evictIfNeeded();
-  }
+  put(key: string, value: V, ttlMs?: number): void {}
 
   has(key: string): boolean {
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:93:29
     this.#evictIfNeeded();
   }
 
-  has(key: string): boolean {
-    const entry = this.#entries.get(key);
-    if (entry === undefined) {
-      return false;
-    }
-    if (this.#isExpired(entry)) {
-      this.#entries.delete(key);
-      return false;
-    }
-    return true;
-  }
+  has(key: string): boolean {}
 
   delete(key: string): boolean {
killedBy: InMemoryCacheStore — basic semantics get/has/delete on an absent key
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:95:30
 
   has(key: string): boolean {
     const entry = this.#entries.get(key);
-    if (entry === undefined) {
-      return false;
-    }
+    if (entry === undefined) {}
     if (this.#isExpired(entry)) {
       this.#entries.delete(key);
killedBy: InMemoryCacheStore — basic semantics get/has/delete on an absent key
statusReason: Cannot read properties of undefined (reading 'expiresAt')

[Killed] ConditionalExpression
src/cache-store.ts:95:9
 
   has(key: string): boolean {
     const entry = this.#entries.get(key);
-    if (entry === undefined) {
+    if (true) {
       return false;
     }
killedBy: InMemoryCacheStore — basic semantics stores and retrieves; delete returns true for a live entry then false
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:98:9
     if (entry === undefined) {
       return false;
     }
-    if (this.#isExpired(entry)) {
+    if (false) {
       this.#entries.delete(key);
       return false;
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:98:33
     if (entry === undefined) {
       return false;
     }
-    if (this.#isExpired(entry)) {
-      this.#entries.delete(key);
-      return false;
-    }
+    if (this.#isExpired(entry)) {}
     return true;
   }
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/cache-store.ts:100:14
     }
     if (this.#isExpired(entry)) {
       this.#entries.delete(key);
-      return false;
+      return true;
     }
     return true;
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:105:32
     return true;
   }
 
-  delete(key: string): boolean {
-    const entry = this.#entries.get(key);
-    if (entry === undefined) {
-      return false;
-    }
-    // An expired-but-present entry is already logically gone — report false.
-    const live = !this.#isExpired(entry);
-    this.#entries.delete(key);
-    return live;
-  }
+  delete(key: string): boolean {}
 
   #computeExpiry(ttlMs?: number): number | null {
killedBy: InMemoryCacheStore — basic semantics get/has/delete on an absent key
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/cache-store.ts:111:18
       return false;
     }
     // An expired-but-present entry is already logically gone — report false.
-    const live = !this.#isExpired(entry);
+    const live = this.#isExpired(entry);
     this.#entries.delete(key);
     return live;
killedBy: InMemoryCacheStore — basic semantics stores and retrieves; delete returns true for a live entry then false
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:116:49
     return live;
   }
 
-  #computeExpiry(ttlMs?: number): number | null {
-    if (ttlMs === undefined) {
-      return null;
-    }
-    if (!Number.isFinite(ttlMs) || ttlMs < 0) {
-      // fail-closed: a negative/NaN TTL is a programming error.
-      throw new RangeError(`InMemoryCacheStore: ttlMs must be a finite number >= 0, got ${ttlMs}`);
-    }
-    return this.#clock() + ttlMs;
-  }
+  #computeExpiry(ttlMs?: number): number | null {}
 
   #isExpired(entry: Entry<V>): boolean {
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary rejects negative or NaN ttlMs (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/cache-store.ts:117:9
   }
 
   #computeExpiry(ttlMs?: number): number | null {
-    if (ttlMs === undefined) {
+    if (true) {
       return null;
     }
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary rejects negative or NaN ttlMs (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/cache-store.ts:117:9
   }
 
   #computeExpiry(ttlMs?: number): number | null {
-    if (ttlMs === undefined) {
+    if (false) {
       return null;
     }
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: InMemoryCacheStore: ttlMs must be a finite number >= 0, got undefined

[Killed] LogicalOperator
src/cache-store.ts:120:9
     if (ttlMs === undefined) {
       return null;
     }
-    if (!Number.isFinite(ttlMs) || ttlMs < 0) {
+    if (!Number.isFinite(ttlMs) && ttlMs < 0) {
       // fail-closed: a negative/NaN TTL is a programming error.
       throw new RangeError(`InMemoryCacheStore: ttlMs must be a finite number >= 0, got ${ttlMs}`);
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary rejects negative or NaN ttlMs (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/cache-store.ts:120:9
     if (ttlMs === undefined) {
       return null;
     }
-    if (!Number.isFinite(ttlMs) || ttlMs < 0) {
+    if (false) {
       // fail-closed: a negative/NaN TTL is a programming error.
       throw new RangeError(`InMemoryCacheStore: ttlMs must be a finite number >= 0, got ${ttlMs}`);
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary rejects negative or NaN ttlMs (fail-closed)
statusReason: expected function to throw an error, but it didn't

[Killed] ArithmeticOperator
src/cache-store.ts:124:12
       // fail-closed: a negative/NaN TTL is a programming error.
       throw new RangeError(`InMemoryCacheStore: ttlMs must be a finite number >= 0, got ${ttlMs}`);
     }
-    return this.#clock() + ttlMs;
+    return this.#clock() - ttlMs;
   }
 
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:127:40
     return this.#clock() + ttlMs;
   }
 
-  #isExpired(entry: Entry<V>): boolean {
-    if (entry.expiresAt === null) {
-      return false;
-    }
-    // Boundary: the entry is live up to and including expiresAt, dead strictly after.
-    return this.#clock() > entry.expiresAt;
-  }
+  #isExpired(entry: Entry<V>): boolean {}
 
   #evictIfNeeded(): void {
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:128:9
   }
 
   #isExpired(entry: Entry<V>): boolean {
-    if (entry.expiresAt === null) {
+    if (false) {
       return false;
     }
killedBy: ResultCache.getOrCompute — error and TTL behaviour with no default TTL, entries persist indefinitely
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:128:9
   }
 
   #isExpired(entry: Entry<V>): boolean {
-    if (entry.expiresAt === null) {
+    if (true) {
       return false;
     }
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/cache-store.ts:129:14
 
   #isExpired(entry: Entry<V>): boolean {
     if (entry.expiresAt === null) {
-      return false;
+      return true;
     }
     // Boundary: the entry is live up to and including expiresAt, dead strictly after.
killedBy: InMemoryCacheStore — construction defaults the clock to Date.now when none is injected
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
src/cache-store.ts:132:12
       return false;
     }
     // Boundary: the entry is live up to and including expiresAt, dead strictly after.
-    return this.#clock() > entry.expiresAt;
+    return this.#clock() >= entry.expiresAt;
   }
 
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:132:12
       return false;
     }
     // Boundary: the entry is live up to and including expiresAt, dead strictly after.
-    return this.#clock() > entry.expiresAt;
+    return false;
   }
 
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary is live at exactly expiresAt and dead one tick after
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/cache-store.ts:135:26
     return this.#clock() > entry.expiresAt;
   }
 
-  #evictIfNeeded(): void {
-    // size > maxEntries (>= 1) guarantees at least one entry, so the iterator
-    // always yields a key here — no done-guard needed.
-    while (this.#entries.size > this.#maxEntries) {
-      // First key in iteration order is the least-recently-used.
-      const oldest = this.#entries.keys().next().value as string;
-      this.#entries.delete(oldest);
-    }
-  }
+  #evictIfNeeded(): void {}
 }
 
killedBy: InMemoryCacheStore — LRU eviction at capacity evicts the least-recently-used entry when capacity is exceeded
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/cache-store.ts:138:12
   #evictIfNeeded(): void {
     // size > maxEntries (>= 1) guarantees at least one entry, so the iterator
     // always yields a key here — no done-guard needed.
-    while (this.#entries.size > this.#maxEntries) {
+    while (false) {
       // First key in iteration order is the least-recently-used.
       const oldest = this.#entries.keys().next().value as string;
killedBy: InMemoryCacheStore — LRU eviction at capacity evicts the least-recently-used entry when capacity is exceeded
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/cache-store.ts:138:12
   #evictIfNeeded(): void {
     // size > maxEntries (>= 1) guarantees at least one entry, so the iterator
     // always yields a key here — no done-guard needed.
-    while (this.#entries.size > this.#maxEntries) {
+    while (this.#entries.size >= this.#maxEntries) {
       // First key in iteration order is the least-recently-used.
       const oldest = this.#entries.keys().next().value as string;
killedBy: InMemoryCacheStore — TTL expiry at the exact boundary expired entries free capacity (lazy purge on access)
statusReason: expected undefined to be 2 // Object.is equality
