[Survived] ArithmeticOperator
src/images.ts:28:41
  * photo yet bounds memory use. The base64 *string* is ~4/3 of the decoded size; we validate
  * against the decoded length to keep the limit meaningful regardless of padding.
  */
-export const MAX_BASE64_DECODED_BYTES = 8 * 1024 * 1024;
+export const MAX_BASE64_DECODED_BYTES = 8 * 1024 / 1024;
 
 /** Strict-ish base64 alphabet check (with optional `=` padding). Guards against junk input. */

[Survived] ArithmeticOperator
src/images.ts:28:41
  * photo yet bounds memory use. The base64 *string* is ~4/3 of the decoded size; we validate
  * against the decoded length to keep the limit meaningful regardless of padding.
  */
-export const MAX_BASE64_DECODED_BYTES = 8 * 1024 * 1024;
+export const MAX_BASE64_DECODED_BYTES = 8 / 1024 * 1024;
 
 /** Strict-ish base64 alphabet check (with optional `=` padding). Guards against junk input. */

[Killed] Regex
src/images.ts:31:24
 export const MAX_BASE64_DECODED_BYTES = 8 * 1024 * 1024;
 
 /** Strict-ish base64 alphabet check (with optional `=` padding). Guards against junk input. */
-const BASE64_PATTERN = /^[A-Za-z0-9+/]+={0,2}$/;
+const BASE64_PATTERN = /^[A-Za-z0-9+/]+={0,2}/;
 
 /** Estimate the decoded byte length of a base64 string without allocating the buffer. */
killedBy: parseImageRef — base64 variant rejects non-base64 characters
statusReason: expected function to throw an error, but it didn't

[Killed] Regex
src/images.ts:31:24
 export const MAX_BASE64_DECODED_BYTES = 8 * 1024 * 1024;
 
 /** Strict-ish base64 alphabet check (with optional `=` padding). Guards against junk input. */
-const BASE64_PATTERN = /^[A-Za-z0-9+/]+={0,2}$/;
+const BASE64_PATTERN = /^[A-Za-z0-9+/]+=$/;
 
 /** Estimate the decoded byte length of a base64 string without allocating the buffer. */
killedBy: parseImageRef — base64 variant accepts a payload one byte under the max decoded size (boundary: just-under)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/images.ts:34:52
 const BASE64_PATTERN = /^[A-Za-z0-9+/]+={0,2}$/;
 
 /** Estimate the decoded byte length of a base64 string without allocating the buffer. */
-function decodedByteLength(base64: string): number {
-  // Each 4 base64 chars encode 3 bytes; trailing '=' padding reduces the final group.
-  const padding = base64.endsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
-  return Math.floor((base64.length * 3) / 4) - padding;
-}
+function decodedByteLength(base64: string): number {}
 
 /** A remotely-hosted image referenced by an HTTPS URL. */
killedBy: parseTryOnRequest accepts a base64 person image
statusReason: [
  {
    "code": "custom",
    "message": "image exceeds maximum allowed size",
    "path": [
      "personImage",
      "data"
    ]

[Killed] MethodExpression
src/images.ts:36:47
 /** Estimate the decoded byte length of a base64 string without allocating the buffer. */
 function decodedByteLength(base64: string): number {
   // Each 4 base64 chars encode 3 bytes; trailing '=' padding reduces the final group.
-  const padding = base64.endsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
+  const padding = base64.endsWith('==') ? 2 : base64.startsWith('=') ? 1 : 0;
   return Math.floor((base64.length * 3) / 4) - padding;
 }
killedBy: parseImageRef — base64 variant accepts a payload exactly at the max decoded size (boundary: at limit)
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/images.ts:36:19
 /** Estimate the decoded byte length of a base64 string without allocating the buffer. */
 function decodedByteLength(base64: string): number {
   // Each 4 base64 chars encode 3 bytes; trailing '=' padding reduces the final group.
-  const padding = base64.endsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
+  const padding = base64.startsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
   return Math.floor((base64.length * 3) / 4) - padding;
 }

[Killed] ArithmeticOperator
src/images.ts:37:21
 function decodedByteLength(base64: string): number {
   // Each 4 base64 chars encode 3 bytes; trailing '=' padding reduces the final group.
   const padding = base64.endsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
-  return Math.floor((base64.length * 3) / 4) - padding;
+  return Math.floor(base64.length * 3 * 4) - padding;
 }
 
killedBy: parseImageRef — base64 variant accepts a payload exactly at the max decoded size (boundary: at limit)
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/images.ts:37:10
 function decodedByteLength(base64: string): number {
   // Each 4 base64 chars encode 3 bytes; trailing '=' padding reduces the final group.
   const padding = base64.endsWith('==') ? 2 : base64.endsWith('=') ? 1 : 0;
-  return Math.floor((base64.length * 3) / 4) - padding;
+  return Math.floor(base64.length * 3 / 4) + padding;
 }
 
killedBy: parseImageRef — base64 variant accepts a payload exactly at the max decoded size (boundary: at limit)
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/images.ts:41:43
 }
 
 /** A remotely-hosted image referenced by an HTTPS URL. */
-export const UrlImageRefSchema = z.object({
-  kind: z.literal('url'),
-  // fail-closed: only HTTPS is accepted; http/data/file URLs are rejected to block SSRF
-  // and plaintext fetches. `z.string().url()` first guarantees a well-formed URL.
-  url: z
-    .string()
-    .url()
-    .refine((value) => value.startsWith('https://'), {
-      message: 'image url must use https',
-    }),
-});
+export const UrlImageRefSchema = z.object({});
 
 /** An inline image carried as base64-encoded bytes plus its declared MIME type. */

[Killed] StringLiteral
src/images.ts:42:19
 
 /** A remotely-hosted image referenced by an HTTPS URL. */
 export const UrlImageRefSchema = z.object({
-  kind: z.literal('url'),
+  kind: z.literal(""),
   // fail-closed: only HTTPS is accepted; http/data/file URLs are rejected to block SSRF
   // and plaintext fetches. `z.string().url()` first guarantees a well-formed URL.
killedBy: parseImageRef — url variant accepts a well-formed https url
statusReason: [
  {
    "code": "invalid_union_discriminator",
    "options": [
      "",
      "base64"
    ],
    "path": [

[Killed] ArrowFunction
src/images.ts:48:13
   url: z
     .string()
     .url()
-    .refine((value) => value.startsWith('https://'), {
+    .refine(() => undefined, {
       message: 'image url must use https',
     }),
killedBy: parseImageRef — url variant accepts a well-formed https url
statusReason: [
  {
    "code": "custom",
    "message": "image url must use https",
    "path": [
      "url"
    ]
  }

[Killed] MethodExpression
src/images.ts:48:24
   url: z
     .string()
     .url()
-    .refine((value) => value.startsWith('https://'), {
+    .refine((value) => value.endsWith('https://'), {
       message: 'image url must use https',
     }),
killedBy: parseImageRef — url variant accepts a well-formed https url
statusReason: [
  {
    "code": "custom",
    "message": "image url must use https",
    "path": [
      "url"
    ]
  }

[Survived] ObjectLiteral
src/images.ts:54:46
 });
 
 /** An inline image carried as base64-encoded bytes plus its declared MIME type. */
-export const Base64ImageRefSchema = z.object({
-  kind: z.literal('base64'),
-  // Only an allow-listed image MIME type may be declared; everything else is refused.
-  mimeType: z.enum(ALLOWED_IMAGE_MIME_TYPES),
-  data: z
-    .string()
-    .min(1)
-    .regex(BASE64_PATTERN, { message: 'data must be valid base64' })
-    .refine((value) => decodedByteLength(value) <= MAX_BASE64_DECODED_BYTES, {
-      message: 'image exceeds maximum allowed size',
-    }),
-});
+export const Base64ImageRefSchema = z.object({});
 
 /**

[Killed] StringLiteral
src/images.ts:55:19
 
 /** An inline image carried as base64-encoded bytes plus its declared MIME type. */
 export const Base64ImageRefSchema = z.object({
-  kind: z.literal('base64'),
+  kind: z.literal(""),
   // Only an allow-listed image MIME type may be declared; everything else is refused.
   mimeType: z.enum(ALLOWED_IMAGE_MIME_TYPES),
killedBy: images base64 guard — start anchor (mutation-hardening) still accepts a clean base64 payload (no false positive from the anchor)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/images.ts:58:9
   kind: z.literal('base64'),
   // Only an allow-listed image MIME type may be declared; everything else is refused.
   mimeType: z.enum(ALLOWED_IMAGE_MIME_TYPES),
-  data: z
-    .string()
-    .min(1)
+  data: z.string().max(1)
     .regex(BASE64_PATTERN, { message: 'data must be valid base64' })
     .refine((value) => decodedByteLength(value) <= MAX_BASE64_DECODED_BYTES, {
killedBy: images base64 guard — start anchor (mutation-hardening) still accepts a clean base64 payload (no false positive from the anchor)
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/images.ts:61:39
   data: z
     .string()
     .min(1)
-    .regex(BASE64_PATTERN, { message: 'data must be valid base64' })
+    .regex(BASE64_PATTERN, { message: "" })
     .refine((value) => decodedByteLength(value) <= MAX_BASE64_DECODED_BYTES, {
       message: 'image exceeds maximum allowed size',

[Killed] ConditionalExpression
src/images.ts:62:24
     .string()
     .min(1)
     .regex(BASE64_PATTERN, { message: 'data must be valid base64' })
-    .refine((value) => decodedByteLength(value) <= MAX_BASE64_DECODED_BYTES, {
+    .refine((value) => true, {
       message: 'image exceeds maximum allowed size',
     }),
killedBy: parseImageRef — base64 variant rejects a payload one byte over the max decoded size (boundary: just-over)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/images.ts:62:24
     .string()
     .min(1)
     .regex(BASE64_PATTERN, { message: 'data must be valid base64' })
-    .refine((value) => decodedByteLength(value) <= MAX_BASE64_DECODED_BYTES, {
+    .refine((value) => decodedByteLength(value) > MAX_BASE64_DECODED_BYTES, {
       message: 'image exceeds maximum allowed size',
     }),
killedBy: parseImageRef — base64 variant accepts a small base64 png
statusReason: [
  {
    "code": "custom",
    "message": "image exceeds maximum allowed size",
    "path": [
      "data"
    ]
  }

[Survived] StringLiteral
src/images.ts:71:52
  * A reference to an image supplied by a caller: either an HTTPS URL or inline base64 bytes.
  * Discriminated on `kind` so invalid combinations (e.g. a URL with base64 fields) are caught.
  */
-export const ImageRefSchema = z.discriminatedUnion('kind', [
+export const ImageRefSchema = z.discriminatedUnion("", [
   UrlImageRefSchema,
   Base64ImageRefSchema,

[Killed] BlockStatement
src/images.ts:84:57
  *
  * @throws {z.ZodError} if the input is not a valid image reference.
  */
-export function parseImageRef(input: unknown): ImageRef {
-  // fail-closed: invalid image references throw rather than flowing downstream.
-  return ImageRefSchema.parse(input);
-}
+export function parseImageRef(input: unknown): ImageRef {}
 
 /** Non-throwing variant of {@link parseImageRef}; returns a Zod result discriminated union. */
killedBy: parseImageRef — url variant accepts a well-formed https url
statusReason: expected undefined to deeply equal { kind: 'url', …(1) }

[Killed] BlockStatement
src/images.ts:90:93
 }
 
 /** Non-throwing variant of {@link parseImageRef}; returns a Zod result discriminated union. */
-export function safeParseImageRef(input: unknown): z.SafeParseReturnType<unknown, ImageRef> {
-  return ImageRefSchema.safeParse(input);
-}
+export function safeParseImageRef(input: unknown): z.SafeParseReturnType<unknown, ImageRef> {}
 
killedBy: parseImageRef — url variant rejects a url variant that carries base64 fields (discriminated union strictness)
statusReason: Cannot read properties of undefined (reading 'success')
