[Killed] BlockStatement
src/canonical-json.ts:37:66
  * non-finite numbers (NaN, ±Infinity) — these have no faithful JSON form, and
  * silently dropping/coercing them would let distinct inputs produce the same key.
  */
-export function canonicalJsonStringify(value: JsonValue): string {
-  return encode(value);
-}
+export function canonicalJsonStringify(value: JsonValue): string {}
 
 function encode(value: JsonValue): string {
killedBy: deriveCacheKey — hashField length-prefix (mutation-hardening) boundary-shifted adjacent fields produce DIFFERENT digests, not just different prefixes
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received undefined

[Killed] BlockStatement
src/canonical-json.ts:42:23
 }
 
 function encode(value: JsonValue): string {
-  if (value === null) {
-    return 'null';
-  }
+  if (value === null) {}
 
   const t = typeof value;
killedBy: canonicalJsonStringify — primitives serializes primitives exactly like JSON for finite scalars
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/canonical-json.ts:42:7
 }
 
 function encode(value: JsonValue): string {
-  if (value === null) {
+  if (true) {
     return 'null';
   }
killedBy: deriveCacheKey — param normalization distinguishes different params, image hashes, and products
statusReason: expected 't-1:66df5c2c108a2487e420cd9661acd42d2…' not to be 't-1:66df5c2c108a2487e420cd9661acd42d2…' // Object.is equality

[Killed] ConditionalExpression
src/canonical-json.ts:48:7
 
   const t = typeof value;
 
-  if (t === 'string') {
+  if (true) {
     return JSON.stringify(value);
   }
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: expected '{"b":1,"a":2,"c":{"z":1,"y":2}}' to be '{"c":{"y":2,"z":1},"a":2,"b":1}' // Object.is equality

[Killed] EqualityOperator
src/canonical-json.ts:48:7
 
   const t = typeof value;
 
-  if (t === 'string') {
+  if (t !== 'string') {
     return JSON.stringify(value);
   }
killedBy: deriveCacheKey — param normalization is invariant to param key ordering
statusReason: expected 't-1:c8cc257fb4434a60fd16425e62bc7c56a…' to be 't-1:b332ee336a59ec5c299dd8ac0d4ea9389…' // Object.is equality

[Killed] BlockStatement
src/canonical-json.ts:52:23
     return JSON.stringify(value);
   }
 
-  if (t === 'number') {
-    // fail-closed: non-finite numbers have no JSON representation; reject rather
-    // than letting JSON.stringify coerce them to `null` and cause collisions.
-    if (!Number.isFinite(value)) {
-      throw new TypeError(`canonicalJsonStringify: non-finite number ${String(value)}`);
-    }
-    return JSON.stringify(value);
-  }
+  if (t === 'number') {}
 
   if (t === 'boolean') {
killedBy: deriveCacheKey — param normalization is invariant to param key ordering
statusReason: canonicalJsonStringify: unsupported value of type number

[Killed] ConditionalExpression
src/canonical-json.ts:52:7
     return JSON.stringify(value);
   }
 
-  if (t === 'number') {
+  if (true) {
     // fail-closed: non-finite numbers have no JSON representation; reject rather
     // than letting JSON.stringify coerce them to `null` and cause collisions.
killedBy: deriveCacheKey — shape produces <tenantId>:<sha256hex>
statusReason: canonicalJsonStringify: non-finite number [object Object]

[Killed] ConditionalExpression
src/canonical-json.ts:55:9
   if (t === 'number') {
     // fail-closed: non-finite numbers have no JSON representation; reject rather
     // than letting JSON.stringify coerce them to `null` and cause collisions.
-    if (!Number.isFinite(value)) {
+    if (true) {
       throw new TypeError(`canonicalJsonStringify: non-finite number ${String(value)}`);
     }
killedBy: deriveCacheKey — param normalization is invariant to param key ordering
statusReason: canonicalJsonStringify: non-finite number 1

[Killed] ConditionalExpression
src/canonical-json.ts:55:9
   if (t === 'number') {
     // fail-closed: non-finite numbers have no JSON representation; reject rather
     // than letting JSON.stringify coerce them to `null` and cause collisions.
-    if (!Number.isFinite(value)) {
+    if (false) {
       throw new TypeError(`canonicalJsonStringify: non-finite number ${String(value)}`);
     }
killedBy: deriveCacheKey — param normalization propagates fail-closed errors from canonical serialization
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/canonical-json.ts:61:24
     return JSON.stringify(value);
   }
 
-  if (t === 'boolean') {
-    return value ? 'true' : 'false';
-  }
+  if (t === 'boolean') {}
 
   if (Array.isArray(value)) {
killedBy: canonicalJsonStringify — primitives serializes primitives exactly like JSON for finite scalars
statusReason: canonicalJsonStringify: unsupported value of type boolean

[Killed] EqualityOperator
src/canonical-json.ts:61:7
     return JSON.stringify(value);
   }
 
-  if (t === 'boolean') {
+  if (t !== 'boolean') {
     return value ? 'true' : 'false';
   }
killedBy: deriveCacheKey — param normalization distinguishes different params, image hashes, and products
statusReason: expected 't-1:3dbd3ceef78e5fee34ae2c2cbbc72496f…' not to be 't-1:3dbd3ceef78e5fee34ae2c2cbbc72496f…' // Object.is equality

[Killed] StringLiteral
src/canonical-json.ts:62:29
   }
 
   if (t === 'boolean') {
-    return value ? 'true' : 'false';
+    return value ? 'true' : "";
   }
 
killedBy: canonicalJsonStringify — primitives serializes primitives exactly like JSON for finite scalars
statusReason: expected '' to be 'false' // Object.is equality

[Killed] StringLiteral
src/canonical-json.ts:62:20
   }
 
   if (t === 'boolean') {
-    return value ? 'true' : 'false';
+    return value ? "" : 'false';
   }
 
killedBy: canonicalJsonStringify — primitives serializes primitives exactly like JSON for finite scalars
statusReason: expected '' to be 'true' // Object.is equality

[Killed] BlockStatement
src/canonical-json.ts:65:29
     return value ? 'true' : 'false';
   }
 
-  if (Array.isArray(value)) {
-    return `[${value.map(encode).join(',')}]`;
-  }
+  if (Array.isArray(value)) {}
 
   if (t === 'object') {
killedBy: canonicalJsonStringify — key ordering invariance preserves array order (arrays are sequence-semantic, not sorted)
statusReason: expected '{"0":3,"1":1,"2":2}' to be '[3,1,2]' // Object.is equality

[Killed] StringLiteral
src/canonical-json.ts:66:12
   }
 
   if (Array.isArray(value)) {
-    return `[${value.map(encode).join(',')}]`;
+    return ``;
   }
 
killedBy: canonicalJsonStringify — key ordering invariance preserves array order (arrays are sequence-semantic, not sorted)
statusReason: expected '' to be '[3,1,2]' // Object.is equality

[Killed] ConditionalExpression
src/canonical-json.ts:69:7
     return `[${value.map(encode).join(',')}]`;
   }
 
-  if (t === 'object') {
+  if (true) {
     const obj = value as { [key: string]: JsonValue };
     const keys = Object.keys(obj).sort();
killedBy: canonicalJsonStringify — fail-closed on unrepresentable values throws on top-level unsupported types
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/canonical-json.ts:69:23
     return `[${value.map(encode).join(',')}]`;
   }
 
-  if (t === 'object') {
-    const obj = value as { [key: string]: JsonValue };
-    const keys = Object.keys(obj).sort();
-    const members = keys.map((key) => {
-      const v = obj[key];
-      // fail-closed: `undefined` members are dropped by JSON.stringify, which
-      // would make {a:1,b:undefined} and {a:1} collide. Reject instead.
-      if (v === undefined) {
-        throw new TypeError(`canonicalJsonStringify: undefined value at key ${JSON.stringify(key)}`);
-      }
-      return `${JSON.stringify(key)}:${encode(v)}`;
-    });
-    return `{${members.join(',')}}`;
-  }
+  if (t === 'object') {}
 
   // fail-closed: undefined, function, symbol, bigint — unrepresentable.
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: canonicalJsonStringify: unsupported value of type object

[Killed] MethodExpression
src/canonical-json.ts:71:18
 
   if (t === 'object') {
     const obj = value as { [key: string]: JsonValue };
-    const keys = Object.keys(obj).sort();
+    const keys = Object.keys(obj);
     const members = keys.map((key) => {
       const v = obj[key];
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: expected '{"b":1,"a":2,"c":{"z":1,"y":2}}' to be '{"c":{"y":2,"z":1},"a":2,"b":1}' // Object.is equality

[Killed] BlockStatement
src/canonical-json.ts:72:39
   if (t === 'object') {
     const obj = value as { [key: string]: JsonValue };
     const keys = Object.keys(obj).sort();
-    const members = keys.map((key) => {
-      const v = obj[key];
-      // fail-closed: `undefined` members are dropped by JSON.stringify, which
-      // would make {a:1,b:undefined} and {a:1} collide. Reject instead.
-      if (v === undefined) {
-        throw new TypeError(`canonicalJsonStringify: undefined value at key ${JSON.stringify(key)}`);
-      }
-      return `${JSON.stringify(key)}:${encode(v)}`;
-    });
+    const members = keys.map((key) => {});
     return `{${members.join(',')}}`;
   }
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: expected '{,,}' to be '{"a":2,"b":1,"c":{"y":2,"z":1}}' // Object.is equality

[Killed] ConditionalExpression
src/canonical-json.ts:76:11
       const v = obj[key];
       // fail-closed: `undefined` members are dropped by JSON.stringify, which
       // would make {a:1,b:undefined} and {a:1} collide. Reject instead.
-      if (v === undefined) {
+      if (true) {
         throw new TypeError(`canonicalJsonStringify: undefined value at key ${JSON.stringify(key)}`);
       }
killedBy: deriveCacheKey — shape produces <tenantId>:<sha256hex>
statusReason: canonicalJsonStringify: undefined value at key "category"

[Killed] EqualityOperator
src/canonical-json.ts:76:11
       const v = obj[key];
       // fail-closed: `undefined` members are dropped by JSON.stringify, which
       // would make {a:1,b:undefined} and {a:1} collide. Reject instead.
-      if (v === undefined) {
+      if (v !== undefined) {
         throw new TypeError(`canonicalJsonStringify: undefined value at key ${JSON.stringify(key)}`);
       }
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: canonicalJsonStringify: undefined value at key "a"

[Killed] StringLiteral
src/canonical-json.ts:79:14
       if (v === undefined) {
         throw new TypeError(`canonicalJsonStringify: undefined value at key ${JSON.stringify(key)}`);
       }
-      return `${JSON.stringify(key)}:${encode(v)}`;
+      return ``;
     });
     return `{${members.join(',')}}`;
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: expected '{,,}' to be '{"a":2,"b":1,"c":{"y":2,"z":1}}' // Object.is equality

[Killed] StringLiteral
src/canonical-json.ts:81:29
       }
       return `${JSON.stringify(key)}:${encode(v)}`;
     });
-    return `{${members.join(',')}}`;
+    return `{${members.join("")}}`;
   }
 
killedBy: canonicalJsonStringify — key ordering invariance produces identical output regardless of object key insertion order
statusReason: expected '{"a":2"b":1"c":{"y":2"z":1}}' to be '{"a":2,"b":1,"c":{"y":2,"z":1}}' // Object.is equality
