[Killed] ObjectLiteral
src/tenant.ts:18:41
  * Rate limits applied to a tenant. Both are positive integers — a non-positive limit would
  * either block all traffic or (if misread) disable the limiter, so the floor is 1 request.
  */
-export const RateLimitSchema = z.object({
-  perShopperPerMinute: z.number().int().min(1),
-  perTenantPerMinute: z.number().int().min(1),
-});
+export const RateLimitSchema = z.object({});
 
 /** Validated per-tenant rate limits. */
killedBy: parseTenantConfig rejects perShopperPerMinute = 0 (boundary: just-under min 1)
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
src/tenant.ts:19:24
  * either block all traffic or (if misread) disable the limiter, so the floor is 1 request.
  */
 export const RateLimitSchema = z.object({
-  perShopperPerMinute: z.number().int().min(1),
+  perShopperPerMinute: z.number().int().max(1),
   perTenantPerMinute: z.number().int().min(1),
 });
killedBy: parseTenantConfig parses a valid config and defaults killSwitch to false
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] MethodExpression
src/tenant.ts:20:23
  */
 export const RateLimitSchema = z.object({
   perShopperPerMinute: z.number().int().min(1),
-  perTenantPerMinute: z.number().int().min(1),
+  perTenantPerMinute: z.number().int().max(1),
 });
 
killedBy: parseTenantConfig parses a valid config and defaults killSwitch to false
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] MethodExpression
src/tenant.ts:34:13
  * `killSwitch` defaults to `false`; when `true` all of the tenant's external calls are halted.
  */
 export const TenantConfigSchema = z.object({
-  tenantId: z.string().min(1),
+  tenantId: z.string().max(1),
   // Allow-list of providers this tenant may route to; deny-by-default if empty.
   allowedProviders: z.array(ProviderIdSchema),
killedBy: parseTenantConfig parses a valid config and defaults killSwitch to false
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] BooleanLiteral
src/tenant.ts:41:35
   monthlyBudgetUsd: z.number().nonnegative(),
   retentionSeconds: z.number().int().nonnegative(),
   // fail-closed control: when true, the tenant's external calls are halted entirely.
-  killSwitch: z.boolean().default(false),
+  killSwitch: z.boolean().default(true),
 });
 
killedBy: parseTenantConfig parses a valid config and defaults killSwitch to false
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/tenant.ts:53:65
  * @returns The parsed config with `killSwitch` defaulted to `false` when omitted.
  * @throws {z.ZodError} if the input does not satisfy {@link TenantConfigSchema}.
  */
-export function parseTenantConfig(input: unknown): TenantConfig {
-  // fail-closed: a malformed tenant policy is rejected rather than partially applied.
-  return TenantConfigSchema.parse(input);
-}
+export function parseTenantConfig(input: unknown): TenantConfig {}
 
 /** Non-throwing variant of {@link parseTenantConfig}. */
killedBy: parseTenantConfig parses a valid config and defaults killSwitch to false
statusReason: Cannot read properties of undefined (reading 'killSwitch')

[Killed] BlockStatement
src/tenant.ts:61:49
 /** Non-throwing variant of {@link parseTenantConfig}. */
 export function safeParseTenantConfig(
   input: unknown,
-): z.SafeParseReturnType<unknown, TenantConfig> {
-  return TenantConfigSchema.safeParse(input);
-}
+): z.SafeParseReturnType<unknown, TenantConfig> {}
 
killedBy: parseTenantConfig safeParse fails for a missing rateLimit
statusReason: Cannot read properties of undefined (reading 'success')
