[Killed] BlockStatement
src/result-cache.ts:45:71
   readonly #store: CacheStore<V>;
   readonly #defaultTtlMs: number | undefined;
 
-  constructor(store: CacheStore<V>, options: ResultCacheOptions = {}) {
-    this.#store = store;
-    this.#defaultTtlMs = options.defaultTtlMs;
-  }
+  constructor(store: CacheStore<V>, options: ResultCacheOptions = {}) {}
 
   /**
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/result-cache.ts:60:106
    * Failure modes: a throwing `computeFn` propagates and stores nothing (so a
    * failed computation is never cached); key-derivation failures propagate too.
    */
-  async getOrCompute(keyParts: CacheKeyParts, computeFn: () => V | Promise<V>): Promise<CacheOutcome<V>> {
-    const key = deriveCacheKey(keyParts);
-
-    const hit = this.#store.get(key);
-    if (hit !== undefined) {
-      return { value: hit, cached: true };
-    }
-
-    // Miss: compute exactly once. If computeFn throws, nothing is stored.
-    const value = await computeFn();
-    this.#store.put(key, value, this.#defaultTtlMs);
-    return { value, cached: false };
-  }
+  async getOrCompute(keyParts: CacheKeyParts, computeFn: () => V | Promise<V>): Promise<CacheOutcome<V>> {}
 }
 
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: expected undefined to deeply equal { value: 'result-A', cached: false }

[Killed] ConditionalExpression
src/result-cache.ts:64:9
     const key = deriveCacheKey(keyParts);
 
     const hit = this.#store.get(key);
-    if (hit !== undefined) {
+    if (true) {
       return { value: hit, cached: true };
     }
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: expected { value: undefined, cached: true } to deeply equal { value: 'result-A', cached: false }

[Killed] EqualityOperator
src/result-cache.ts:64:9
     const key = deriveCacheKey(keyParts);
 
     const hit = this.#store.get(key);
-    if (hit !== undefined) {
+    if (hit === undefined) {
       return { value: hit, cached: true };
     }
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: expected { value: undefined, cached: true } to deeply equal { value: 'result-A', cached: false }

[Killed] BooleanLiteral
src/result-cache.ts:65:36
 
     const hit = this.#store.get(key);
     if (hit !== undefined) {
-      return { value: hit, cached: true };
+      return { value: hit, cached: false };
     }
 
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: expected { value: 'result-A', cached: false } to deeply equal { value: 'result-A', cached: true }

[Killed] BooleanLiteral
src/result-cache.ts:71:29
     // Miss: compute exactly once. If computeFn throws, nothing is stored.
     const value = await computeFn();
     this.#store.put(key, value, this.#defaultTtlMs);
-    return { value, cached: false };
+    return { value, cached: true };
   }
 }
killedBy: ResultCache.getOrCompute — miss then hit computes on miss (cached:false) and serves from cache on hit (cached:true)
statusReason: expected { value: 'result-A', cached: true } to deeply equal { value: 'result-A', cached: false }
