[Killed] ObjectLiteral
src/tryon.ts:23:43
  * Optional provider-tuning parameters for a try-on request. Every field is optional so the
  * caller can supply none; `numSamples` is bounded so a caller cannot request unbounded work.
  */
-export const TryOnParamsSchema = z.object({
-  // Deterministic seed for reproducible generations; any finite integer is acceptable.
-  seed: z.number().int().optional(),
-  // An explicit garment image; if omitted the engine resolves the garment from `productId`.
-  garmentImage: ImageRefSchema.optional(),
-  // Bound the fan-out: 1..4 samples per request. Prevents a caller exhausting provider quota.
-  numSamples: z.number().int().min(1).max(4).optional(),
-});
+export const TryOnParamsSchema = z.object({});
 
 /** Validated try-on tuning parameters. */
killedBy: parseTryOnRequest accepts params with seed, garmentImage and numSamples
statusReason: expected {} to deeply equal { seed: 7, …(2) }

[Killed] MethodExpression
src/tryon.ts:29:15
   // An explicit garment image; if omitted the engine resolves the garment from `productId`.
   garmentImage: ImageRefSchema.optional(),
   // Bound the fan-out: 1..4 samples per request. Prevents a caller exhausting provider quota.
-  numSamples: z.number().int().min(1).max(4).optional(),
+  numSamples: z.number().int().max(1).max(4).optional(),
 });
 
killedBy: parseTryOnRequest accepts params with seed, garmentImage and numSamples
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] MethodExpression
src/tryon.ts:29:15
   // An explicit garment image; if omitted the engine resolves the garment from `productId`.
   garmentImage: ImageRefSchema.optional(),
   // Bound the fan-out: 1..4 samples per request. Prevents a caller exhausting provider quota.
-  numSamples: z.number().int().min(1).max(4).optional(),
+  numSamples: z.number().int().min(1).min(4).optional(),
 });
 
killedBy: parseTryOnRequest accepts params with seed, garmentImage and numSamples
statusReason: [
  {
    "code": "too_small",
    "minimum": 4,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be greater than or equal to 4",

[Killed] MethodExpression
src/tryon.ts:42:13
  * `category` defaults to `apparel`. `params` is optional and bounded by {@link TryOnParamsSchema}.
  */
 export const TryOnRequestSchema = z.object({
-  tenantId: z.string().min(1),
+  tenantId: z.string().max(1),
   shopperId: z.string().min(1),
   personImage: ImageRefSchema,
killedBy: parseTryOnRequest parses a valid url-based request and applies the default category
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/tryon.ts:43:14
  */
 export const TryOnRequestSchema = z.object({
   tenantId: z.string().min(1),
-  shopperId: z.string().min(1),
+  shopperId: z.string().max(1),
   personImage: ImageRefSchema,
   productId: z.string().min(1),
killedBy: parseTryOnRequest parses a valid url-based request and applies the default category
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/tryon.ts:45:14
   tenantId: z.string().min(1),
   shopperId: z.string().min(1),
   personImage: ImageRefSchema,
-  productId: z.string().min(1),
+  productId: z.string().max(1),
   category: TryOnCategorySchema.default('apparel'),
   params: TryOnParamsSchema.optional(),
killedBy: parseTryOnJob parses a valid queued job (request defaults applied)
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] ArithmeticOperator
src/tryon.ts:57:49
  * Maximum length (chars) of an inline `data:` result image URL. Bounds memory/transfer so a
  * hostile or buggy provider cannot surface an unbounded inline blob. ~2 MiB of URL text.
  */
-export const MAX_RESULT_IMAGE_DATA_URL_LENGTH = 2 * 1024 * 1024;
+export const MAX_RESULT_IMAGE_DATA_URL_LENGTH = 2 * 1024 / 1024;
 
 /**
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] ArithmeticOperator
src/tryon.ts:57:49
  * Maximum length (chars) of an inline `data:` result image URL. Bounds memory/transfer so a
  * hostile or buggy provider cannot surface an unbounded inline blob. ~2 MiB of URL text.
  */
-export const MAX_RESULT_IMAGE_DATA_URL_LENGTH = 2 * 1024 * 1024;
+export const MAX_RESULT_IMAGE_DATA_URL_LENGTH = 2 / 1024 * 1024;
 
 /**
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] Regex
src/tryon.ts:66:3
  * match. The base64 group requires at least one character, so an empty payload is rejected.
  */
 const RESULT_IMAGE_DATA_URL_PATTERN =
-  /^data:image\/(?:svg\+xml|png|jpeg|webp);base64,[A-Za-z0-9+/]+={0,2}$/;
+  /^data:image\/(?:svg\+xml|png|jpeg|webp);base64,[^A-Za-z0-9+/]+={0,2}$/;
 
 /**
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] Regex
src/tryon.ts:66:3
  * match. The base64 group requires at least one character, so an empty payload is rejected.
  */
 const RESULT_IMAGE_DATA_URL_PATTERN =
-  /^data:image\/(?:svg\+xml|png|jpeg|webp);base64,[A-Za-z0-9+/]+={0,2}$/;
+  /^data:image\/(?:svg\+xml|png|jpeg|webp);base64,[A-Za-z0-9+/]={0,2}$/;
 
 /**
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] BlockStatement
src/tryon.ts:74:68
  * `data:` URL from the allow-list above (so an offline/fallback result is actually renderable in a
  * browser). Fail-closed: every other shape is rejected.
  */
-export function isAcceptableResultImageUrl(value: string): boolean {
-  if (value.startsWith('https://')) {
-    try {
-      // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
-      return new URL(value).protocol === 'https:';
-    } catch {
-      return false; // fail-closed: not a well-formed absolute URL.
-    }
-  }
-  // fail-closed: bound the length BEFORE the regex, then require the exact safe data-URL shape.
-  return (
-    value.length <= MAX_RESULT_IMAGE_DATA_URL_LENGTH && RESULT_IMAGE_DATA_URL_PATTERN.test(value)
-  );
-}
+export function isAcceptableResultImageUrl(value: string): boolean {}
 
 /**
killedBy: parseTryOnJob accepts a succeeded job carrying a result
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "result",
      "resultImageUrl"
    ]

[Killed] MethodExpression
src/tryon.ts:75:7
  * browser). Fail-closed: every other shape is rejected.
  */
 export function isAcceptableResultImageUrl(value: string): boolean {
-  if (value.startsWith('https://')) {
+  if (value.endsWith('https://')) {
     try {
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
killedBy: parseTryOnJob accepts a succeeded job carrying a result
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "result",
      "resultImageUrl"
    ]

[Killed] ConditionalExpression
src/tryon.ts:75:7
  * browser). Fail-closed: every other shape is rejected.
  */
 export function isAcceptableResultImageUrl(value: string): boolean {
-  if (value.startsWith('https://')) {
+  if (true) {
     try {
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] BlockStatement
src/tryon.ts:76:9
  */
 export function isAcceptableResultImageUrl(value: string): boolean {
   if (value.startsWith('https://')) {
-    try {
-      // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
-      return new URL(value).protocol === 'https:';
-    } catch {
+    try {} catch {
       return false; // fail-closed: not a well-formed absolute URL.
     }
killedBy: parseTryOnJob accepts a succeeded job carrying a result
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "result",
      "resultImageUrl"
    ]

[Killed] ConditionalExpression
src/tryon.ts:78:14
   if (value.startsWith('https://')) {
     try {
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
-      return new URL(value).protocol === 'https:';
+      return true;
     } catch {
       return false; // fail-closed: not a well-formed absolute URL.
killedBy: parseTryOnResult rejects a bare "https://" with no host (boundary: malformed https url)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/tryon.ts:78:14
   if (value.startsWith('https://')) {
     try {
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
-      return new URL(value).protocol === 'https:';
+      return false;
     } catch {
       return false; // fail-closed: not a well-formed absolute URL.
killedBy: parseTryOnResult parses a valid result
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Survived] BlockStatement
src/tryon.ts:79:13
     try {
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
       return new URL(value).protocol === 'https:';
-    } catch {
-      return false; // fail-closed: not a well-formed absolute URL.
-    }
+    } catch {}
   }
   // fail-closed: bound the length BEFORE the regex, then require the exact safe data-URL shape.

[Killed] BooleanLiteral
src/tryon.ts:80:14
       // Guard against a bare scheme ("https://") or otherwise malformed URL slipping through.
       return new URL(value).protocol === 'https:';
     } catch {
-      return false; // fail-closed: not a well-formed absolute URL.
+      return true; // fail-closed: not a well-formed absolute URL.
     }
   }
killedBy: parseTryOnResult rejects a bare "https://" with no host (boundary: malformed https url)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/tryon.ts:85:5
   }
   // fail-closed: bound the length BEFORE the regex, then require the exact safe data-URL shape.
   return (
-    value.length <= MAX_RESULT_IMAGE_DATA_URL_LENGTH && RESULT_IMAGE_DATA_URL_PATTERN.test(value)
+    false
   );
 }
killedBy: parseTryOnResult accepts an inline data:image/svg+xml base64 url (renderable offline result)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] EqualityOperator
src/tryon.ts:85:5
   }
   // fail-closed: bound the length BEFORE the regex, then require the exact safe data-URL shape.
   return (
-    value.length <= MAX_RESULT_IMAGE_DATA_URL_LENGTH && RESULT_IMAGE_DATA_URL_PATTERN.test(value)
+    value.length < MAX_RESULT_IMAGE_DATA_URL_LENGTH && RESULT_IMAGE_DATA_URL_PATTERN.test(value)
   );
 }
killedBy: parseTryOnResult accepts a data url exactly at the size cap and rejects one just over it (boundary)
statusReason: [
  {
    "code": "custom",
    "message": "result url must be https or a safe inline image data-url",
    "path": [
      "resultImageUrl"
    ]
  }

[Killed] ObjectLiteral
src/tryon.ts:95:43
  * `latencyMs` and `costUsd` are non-negative; `cached` flags a result served from cache
  * (which typically carries zero marginal cost). `provider` records which backend produced it.
  */
-export const TryOnResultSchema = z.object({
-  // fail-closed: only an https URL or a bounded, safe inline image data-URL is surfaced.
-  resultImageUrl: z.string().refine(isAcceptableResultImageUrl, {
-    message: 'result url must be https or a safe inline image data-url',
-  }),
-  provider: z.string().min(1),
-  latencyMs: z.number().nonnegative(),
-  cached: z.boolean(),
-  costUsd: z.number().nonnegative(),
-});
+export const TryOnResultSchema = z.object({});
 
 /** A validated try-on result. */
killedBy: parseTryOnResult parses a valid result
statusReason: expected {} to deeply equal { …(5) }

[Survived] ObjectLiteral
src/tryon.ts:97:65
  */
 export const TryOnResultSchema = z.object({
   // fail-closed: only an https URL or a bounded, safe inline image data-URL is surfaced.
-  resultImageUrl: z.string().refine(isAcceptableResultImageUrl, {
-    message: 'result url must be https or a safe inline image data-url',
-  }),
+  resultImageUrl: z.string().refine(isAcceptableResultImageUrl, {}),
   provider: z.string().min(1),
   latencyMs: z.number().nonnegative(),

[Killed] MethodExpression
src/tryon.ts:100:13
   resultImageUrl: z.string().refine(isAcceptableResultImageUrl, {
     message: 'result url must be https or a safe inline image data-url',
   }),
-  provider: z.string().min(1),
+  provider: z.string().max(1),
   latencyMs: z.number().nonnegative(),
   cached: z.boolean(),
killedBy: parseTryOnResult parses a valid result
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] BlockStatement
src/tryon.ts:115:65
  * @returns The parsed request with defaults applied (e.g. `category`).
  * @throws {z.ZodError} if the input does not satisfy {@link TryOnRequestSchema}.
  */
-export function parseTryOnRequest(input: unknown): TryOnRequest {
-  // fail-closed: invalid input throws rather than flowing downstream as a partial object.
-  return TryOnRequestSchema.parse(input);
-}
+export function parseTryOnRequest(input: unknown): TryOnRequest {}
 
 /** Non-throwing variant of {@link parseTryOnRequest}. */
killedBy: parseTryOnRequest parses a valid url-based request and applies the default category
statusReason: expected undefined to deeply equal { tenantId: 'tenant-1', …(4) }

[Killed] BlockStatement
src/tryon.ts:123:49
 /** Non-throwing variant of {@link parseTryOnRequest}. */
 export function safeParseTryOnRequest(
   input: unknown,
-): z.SafeParseReturnType<unknown, TryOnRequest> {
-  return TryOnRequestSchema.safeParse(input);
-}
+): z.SafeParseReturnType<unknown, TryOnRequest> {}
 
 /**
killedBy: parseTryOnRequest safeParse reports the failing path for a missing tenantId
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
src/tryon.ts:132:63
  *
  * @throws {z.ZodError} if the input does not satisfy {@link TryOnResultSchema}.
  */
-export function parseTryOnResult(input: unknown): TryOnResult {
-  return TryOnResultSchema.parse(input);
-}
+export function parseTryOnResult(input: unknown): TryOnResult {}
 
 /** Non-throwing variant of {@link parseTryOnResult}. */
killedBy: parseTryOnResult parses a valid result
statusReason: expected undefined to deeply equal { …(5) }

[Killed] BlockStatement
src/tryon.ts:137:99
 }
 
 /** Non-throwing variant of {@link parseTryOnResult}. */
-export function safeParseTryOnResult(input: unknown): z.SafeParseReturnType<unknown, TryOnResult> {
-  return TryOnResultSchema.safeParse(input);
-}
+export function safeParseTryOnResult(input: unknown): z.SafeParseReturnType<unknown, TryOnResult> {}
 
killedBy: parseTryOnResult safeParse fails for a missing cached flag
statusReason: Cannot read properties of undefined (reading 'success')
