[Killed] ArrayDeclaration
src/errors.ts:18:39
  * at a trust or policy boundary (bad input, rate/budget limits, provider failure, the global
  * kill switch, auth failure, and oversized payloads).
  */
-export const ErrorCodeSchema = z.enum([
-  'INVALID_INPUT',
-  'RATE_LIMITED',
-  'BUDGET_EXCEEDED',
-  'PROVIDER_ERROR',
-  'KILL_SWITCH_ENGAGED',
-  'UNAUTHORIZED',
-  'PAYLOAD_TOO_LARGE',
-]);
+export const ErrorCodeSchema = z.enum([]);
 
 /** A machine-readable API error code. */
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal []

[Killed] StringLiteral
src/errors.ts:20:3
  */
 export const ErrorCodeSchema = z.enum([
   'INVALID_INPUT',
-  'RATE_LIMITED',
+  "",
   'BUDGET_EXCEEDED',
   'PROVIDER_ERROR',
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal [ '', 'BUDGET_EXCEEDED', …(5) ]

[Killed] StringLiteral
src/errors.ts:21:3
 export const ErrorCodeSchema = z.enum([
   'INVALID_INPUT',
   'RATE_LIMITED',
-  'BUDGET_EXCEEDED',
+  "",
   'PROVIDER_ERROR',
   'KILL_SWITCH_ENGAGED',
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal [ '', 'INVALID_INPUT', …(5) ]

[Killed] StringLiteral
src/errors.ts:22:3
   'INVALID_INPUT',
   'RATE_LIMITED',
   'BUDGET_EXCEEDED',
-  'PROVIDER_ERROR',
+  "",
   'KILL_SWITCH_ENGAGED',
   'UNAUTHORIZED',
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal [ '', 'BUDGET_EXCEEDED', …(5) ]

[Killed] StringLiteral
src/errors.ts:23:3
   'RATE_LIMITED',
   'BUDGET_EXCEEDED',
   'PROVIDER_ERROR',
-  'KILL_SWITCH_ENGAGED',
+  "",
   'UNAUTHORIZED',
   'PAYLOAD_TOO_LARGE',
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal [ '', 'BUDGET_EXCEEDED', …(5) ]

[Killed] StringLiteral
src/errors.ts:24:3
   'BUDGET_EXCEEDED',
   'PROVIDER_ERROR',
   'KILL_SWITCH_ENGAGED',
-  'UNAUTHORIZED',
+  "",
   'PAYLOAD_TOO_LARGE',
 ]);
killedBy: httpStatusForErrorCode the static mapping has exactly one entry per enum option
statusReason: expected [ 'BUDGET_EXCEEDED', …(6) ] to deeply equal [ '', 'BUDGET_EXCEEDED', …(5) ]

[Killed] BlockStatement
src/errors.ts:55:65
  * @returns The mapped 4xx/5xx status, or {@link FAIL_CLOSED_HTTP_STATUS} (500) for an unknown
  *   code. Fail-closed: an unrecognised code never resolves to a 2xx/3xx success.
  */
-export function httpStatusForErrorCode(code: ErrorCode): number {
-  // `?? FAIL_CLOSED_HTTP_STATUS` guards against a runtime value outside the known union
-  // (noUncheckedIndexedAccess makes the lookup `number | undefined`).
-  return ERROR_CODE_HTTP_STATUS[code] ?? FAIL_CLOSED_HTTP_STATUS;
-}
+export function httpStatusForErrorCode(code: ErrorCode): number {}
 
 /**
killedBy: httpStatusForErrorCode maps each documented code to its specific status
statusReason: expected undefined to be 400 // Object.is equality

[Killed] LogicalOperator
src/errors.ts:58:10
 export function httpStatusForErrorCode(code: ErrorCode): number {
   // `?? FAIL_CLOSED_HTTP_STATUS` guards against a runtime value outside the known union
   // (noUncheckedIndexedAccess makes the lookup `number | undefined`).
-  return ERROR_CODE_HTTP_STATUS[code] ?? FAIL_CLOSED_HTTP_STATUS;
+  return ERROR_CODE_HTTP_STATUS[code] && FAIL_CLOSED_HTTP_STATUS;
 }
 
killedBy: httpStatusForErrorCode maps each documented code to its specific status
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ObjectLiteral
src/errors.ts:65:40
  * The wire shape of an API error: a code, a human-readable message, and the HTTP status the
  * caller will have received. `httpStatus` is bounded to the 4xx/5xx error range.
  */
-export const ApiErrorSchema = z.object({
-  code: ErrorCodeSchema,
-  message: z.string().min(1),
-  httpStatus: z.number().int().min(400).max(599),
-});
+export const ApiErrorSchema = z.object({});
 
 /** A validated API error. */
killedBy: parseApiError parses a valid api error
statusReason: expected {} to deeply equal { code: 'INVALID_INPUT', …(2) }

[Killed] MethodExpression
src/errors.ts:67:12
  */
 export const ApiErrorSchema = z.object({
   code: ErrorCodeSchema,
-  message: z.string().min(1),
+  message: z.string().max(1),
   httpStatus: z.number().int().min(400).max(599),
 });
killedBy: makeApiError produces a value that passes ApiError validation for every code
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/errors.ts:68:15
 export const ApiErrorSchema = z.object({
   code: ErrorCodeSchema,
   message: z.string().min(1),
-  httpStatus: z.number().int().min(400).max(599),
+  httpStatus: z.number().int().max(400).max(599),
 });
 
killedBy: makeApiError produces a value that passes ApiError validation for every code
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/errors.ts:68:15
 export const ApiErrorSchema = z.object({
   code: ErrorCodeSchema,
   message: z.string().min(1),
-  httpStatus: z.number().int().min(400).max(599),
+  httpStatus: z.number().int().min(400).min(599),
 });
 
killedBy: makeApiError produces a value that passes ApiError validation for every code
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/errors.ts:79:57
  *
  * @throws {z.ZodError} if the input does not satisfy {@link ApiErrorSchema}.
  */
-export function parseApiError(input: unknown): ApiError {
-  return ApiErrorSchema.parse(input);
-}
+export function parseApiError(input: unknown): ApiError {}
 
 /** Non-throwing variant of {@link parseApiError}. */
killedBy: parseApiError parses a valid api error
statusReason: expected undefined to deeply equal { code: 'INVALID_INPUT', …(2) }

[Killed] BlockStatement
src/errors.ts:84:93
 }
 
 /** Non-throwing variant of {@link parseApiError}. */
-export function safeParseApiError(input: unknown): z.SafeParseReturnType<unknown, ApiError> {
-  return ApiErrorSchema.safeParse(input);
-}
+export function safeParseApiError(input: unknown): z.SafeParseReturnType<unknown, ApiError> {}
 
 /**
killedBy: makeApiError produces a value that passes ApiError validation for every code
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
src/errors.ts:92:74
  * Build a wire-ready {@link ApiError} for a code and message, deriving the HTTP status from
  * the canonical mapping so the status can never disagree with the code.
  */
-export function makeApiError(code: ErrorCode, message: string): ApiError {
-  return { code, message, httpStatus: httpStatusForErrorCode(code) };
-}
+export function makeApiError(code: ErrorCode, message: string): ApiError {}
 
killedBy: makeApiError derives httpStatus from the code so they cannot disagree
statusReason: expected undefined to deeply equal { code: 'RATE_LIMITED', …(2) }
