[Killed] BlockStatement
src/router.ts:60:37
 /** Build a {@link ProviderRouting} map from an array of {@link ProviderConfig}. */
 export function routingFromConfigs(
   configs: ReadonlyArray<ProviderConfig>,
-): Map<ProviderId, ProviderRouting> {
-  const map = new Map<ProviderId, ProviderRouting>();
-  for (const config of configs) {
-    if (!config.enabled) {
-      continue; // disabled providers are never routing candidates.
-    }
-    map.set(config.id, {
-      priority: config.priority,
-      costPerCallUsd: config.costPerCallUsd,
-      timeoutMs: config.timeoutMs,
-    });
-  }
-  return map;
-}
+): Map<ProviderId, ProviderRouting> {}
 
 /**
killedBy: EngineRouter routingFromConfigs drops disabled providers and maps fields
statusReason: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/router.ts:62:33
   configs: ReadonlyArray<ProviderConfig>,
 ): Map<ProviderId, ProviderRouting> {
   const map = new Map<ProviderId, ProviderRouting>();
-  for (const config of configs) {
-    if (!config.enabled) {
-      continue; // disabled providers are never routing candidates.
-    }
-    map.set(config.id, {
-      priority: config.priority,
-      costPerCallUsd: config.costPerCallUsd,
-      timeoutMs: config.timeoutMs,
-    });
-  }
+  for (const config of configs) {}
   return map;
 }
killedBy: EngineRouter routingFromConfigs drops disabled providers and maps fields
statusReason: expected undefined to deeply equal { priority: 2, …(2) }

[Killed] BooleanLiteral
src/router.ts:63:9
 ): Map<ProviderId, ProviderRouting> {
   const map = new Map<ProviderId, ProviderRouting>();
   for (const config of configs) {
-    if (!config.enabled) {
+    if (config.enabled) {
       continue; // disabled providers are never routing candidates.
     }
killedBy: EngineRouter routingFromConfigs drops disabled providers and maps fields
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/router.ts:63:9
 ): Map<ProviderId, ProviderRouting> {
   const map = new Map<ProviderId, ProviderRouting>();
   for (const config of configs) {
-    if (!config.enabled) {
+    if (false) {
       continue; // disabled providers are never routing candidates.
     }
killedBy: EngineRouter routingFromConfigs drops disabled providers and maps fields
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/router.ts:66:24
     if (!config.enabled) {
       continue; // disabled providers are never routing candidates.
     }
-    map.set(config.id, {
-      priority: config.priority,
-      costPerCallUsd: config.costPerCallUsd,
-      timeoutMs: config.timeoutMs,
-    });
+    map.set(config.id, {});
   }
   return map;
killedBy: EngineRouter routingFromConfigs drops disabled providers and maps fields
statusReason: expected {} to deeply equal { priority: 2, …(2) }

[Killed] BlockStatement
src/router.ts:90:5
   public constructor(
     registry: ReadonlyMap<ProviderId, TryOnProvider>,
     options: EngineRouterOptions,
-  ) {
-    this.registry = registry;
-    this.routing = options.routing;
-    this.defaultTimeoutMs = options.defaultTimeoutMs;
-    this.clock = options.clock ?? SYSTEM_CLOCK;
-    this.abortControllerFactory = options.abortControllerFactory ?? (() => new AbortController());
-    this.logger = options.logger ?? NOOP_LOGGER;
-  }
+  ) {}
 
   /**
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] LogicalOperator
src/router.ts:94:18
     this.registry = registry;
     this.routing = options.routing;
     this.defaultTimeoutMs = options.defaultTimeoutMs;
-    this.clock = options.clock ?? SYSTEM_CLOCK;
+    this.clock = options.clock && SYSTEM_CLOCK;
     this.abortControllerFactory = options.abortControllerFactory ?? (() => new AbortController());
     this.logger = options.logger ?? NOOP_LOGGER;
killedBy: EngineRouter records a non-negative measured latency stamped over the provider value
statusReason: expected +0 to be 7 // Object.is equality

[Killed] LogicalOperator
src/router.ts:95:35
     this.routing = options.routing;
     this.defaultTimeoutMs = options.defaultTimeoutMs;
     this.clock = options.clock ?? SYSTEM_CLOCK;
-    this.abortControllerFactory = options.abortControllerFactory ?? (() => new AbortController());
+    this.abortControllerFactory = options.abortControllerFactory && (() => new AbortController());
     this.logger = options.logger ?? NOOP_LOGGER;
   }
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/router.ts:95:70
     this.routing = options.routing;
     this.defaultTimeoutMs = options.defaultTimeoutMs;
     this.clock = options.clock ?? SYSTEM_CLOCK;
-    this.abortControllerFactory = options.abortControllerFactory ?? (() => new AbortController());
+    this.abortControllerFactory = options.abortControllerFactory ?? (() => undefined);
     this.logger = options.logger ?? NOOP_LOGGER;
   }
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/router.ts:96:19
     this.defaultTimeoutMs = options.defaultTimeoutMs;
     this.clock = options.clock ?? SYSTEM_CLOCK;
     this.abortControllerFactory = options.abortControllerFactory ?? (() => new AbortController());
-    this.logger = options.logger ?? NOOP_LOGGER;
+    this.logger = options.logger && NOOP_LOGGER;
   }
 
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: Cannot read properties of undefined (reading 'warn')

[Killed] ConditionalExpression
src/router.ts:112:9
     options: RouteOptions = {},
   ): Promise<RouteOutcome> {
     const candidates = orderCandidates(tenant.allowedProviders, this.routing, this.registry);
-    if (candidates.length === 0) {
+    if (true) {
       // fail-closed: an empty allow-list (or no registered candidate) yields a typed error,
       // never a silent success. The deterministic fallback only applies when it is allow-listed.
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/router.ts:112:9
     options: RouteOptions = {},
   ): Promise<RouteOutcome> {
     const candidates = orderCandidates(tenant.allowedProviders, this.routing, this.registry);
-    if (candidates.length === 0) {
+    if (candidates.length !== 0) {
       // fail-closed: an empty allow-list (or no registered candidate) yields a typed error,
       // never a silent success. The deterministic fallback only applies when it is allow-listed.
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/router.ts:115:47
     if (candidates.length === 0) {
       // fail-closed: an empty allow-list (or no registered candidate) yields a typed error,
       // never a silent success. The deterministic fallback only applies when it is allow-listed.
-      this.logger.warn('router.noCandidates', { tenantId: tenant.tenantId });
+      this.logger.warn('router.noCandidates', {});
       return {
         ok: false,

[Survived] StringLiteral
src/router.ts:118:47
       this.logger.warn('router.noCandidates', { tenantId: tenant.tenantId });
       return {
         ok: false,
-        error: makeApiError('PROVIDER_ERROR', 'no provider is permitted for this tenant'),
+        error: makeApiError('PROVIDER_ERROR', ""),
       };
     }

[Killed] ArrowFunction
src/router.ts:131:11
       const started = this.clock.now();
       try {
         const result = await runWithTimeout(
-          (signal) => provider.tryOn(req, { timeoutMs, signal, logger: this.logger }),
+          () => undefined,
           {
             timeoutMs,
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/router.ts:131:43
       const started = this.clock.now();
       try {
         const result = await runWithTimeout(
-          (signal) => provider.tryOn(req, { timeoutMs, signal, logger: this.logger }),
+          (signal) => provider.tryOn(req, {}),
           {
             timeoutMs,
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/router.ts:140:39
             providerLabel: candidate.id,
           },
         );
-        const latencyMs = Math.max(0, this.clock.now() - started);
+        const latencyMs = Math.max(0, this.clock.now() + started);
         // Stamp authoritative routing metadata over whatever the provider returned, then
         // re-validate at the router boundary (defence in depth): a provider that bypassed its
killedBy: EngineRouter — latency arithmetic (mutation-hardening) stamps latencyMs as (now - started), an exact positive elapsed value
statusReason: expected 2250 to be 250 // Object.is equality

[Killed] MethodExpression
src/router.ts:140:27
             providerLabel: candidate.id,
           },
         );
-        const latencyMs = Math.max(0, this.clock.now() - started);
+        const latencyMs = Math.min(0, this.clock.now() - started);
         // Stamp authoritative routing metadata over whatever the provider returned, then
         // re-validate at the router boundary (defence in depth): a provider that bypassed its
killedBy: EngineRouter records a non-negative measured latency stamped over the provider value
statusReason: expected +0 to be 7 // Object.is equality

[Killed] BooleanLiteral
src/router.ts:150:21
             ...result,
             provider: candidate.id,
             latencyMs,
-            cached: false,
+            cached: true,
             costUsd: candidate.costPerCallUsd,
           },
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/router.ts:153:11
             cached: false,
             costUsd: candidate.costPerCallUsd,
           },
-          `router:${candidate.id}`,
+          ``,
         );
         return { ok: true, result: stamped };

[Killed] BooleanLiteral
src/router.ts:155:22
           },
           `router:${candidate.id}`,
         );
-        return { ok: true, result: stamped };
+        return { ok: false, result: stamped };
       } catch (error) {
         lastError = error;
killedBy: EngineRouter — latency arithmetic (mutation-hardening) stamps latencyMs as (now - started), an exact positive elapsed value
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/router.ts:156:23
           `router:${candidate.id}`,
         );
         return { ok: true, result: stamped };
-      } catch (error) {
-        lastError = error;
-        this.logger.warn('router.providerFailed', {
-          provider: candidate.id,
-          tenantId: tenant.tenantId,
-          reason: error instanceof Error ? error.message : String(error),
-        });
-        // fall through to the next candidate.
-      }
+      } catch (error) {}
     }
 

[Survived] ObjectLiteral
src/router.ts:158:51
         return { ok: true, result: stamped };
       } catch (error) {
         lastError = error;
-        this.logger.warn('router.providerFailed', {
-          provider: candidate.id,
-          tenantId: tenant.tenantId,
-          reason: error instanceof Error ? error.message : String(error),
-        });
+        this.logger.warn('router.providerFailed', {});
         // fall through to the next candidate.
       }

[Killed] StringLiteral
src/router.ts:174:27
     });
     return {
       ok: false,
-      error: makeApiError('PROVIDER_ERROR', 'all permitted providers failed'),
+      error: makeApiError("", 'all permitted providers failed'),
     };
   }
killedBy: EngineRouter returns PROVIDER_ERROR when every permitted provider fails (no deterministic allowed)
statusReason: expected '' to be 'PROVIDER_ERROR' // Object.is equality

[Killed] BlockStatement
src/router.ts:179:97
   }
 
   /** Resolve the effective timeout: per-call override, else provider config, else default. */
-  private resolveTimeout(candidate: ProviderRouting, callTimeoutMs: number | undefined): number {
-    if (callTimeoutMs !== undefined) {
-      return callTimeoutMs;
-    }
-    return candidate.timeoutMs ?? this.defaultTimeoutMs;
-  }
+  private resolveTimeout(candidate: ProviderRouting, callTimeoutMs: number | undefined): number {}
 }
 
killedBy: EngineRouter — per-provider timeout preferred over default (mutation-hardening) uses the candidate.timeoutMs (short) and times out before the long default would
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/router.ts:180:38
 
   /** Resolve the effective timeout: per-call override, else provider config, else default. */
   private resolveTimeout(candidate: ProviderRouting, callTimeoutMs: number | undefined): number {
-    if (callTimeoutMs !== undefined) {
-      return callTimeoutMs;
-    }
+    if (callTimeoutMs !== undefined) {}
     return candidate.timeoutMs ?? this.defaultTimeoutMs;
   }
killedBy: EngineRouter honours a per-call timeout override regardless of provider config
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/router.ts:180:9
 
   /** Resolve the effective timeout: per-call override, else provider config, else default. */
   private resolveTimeout(candidate: ProviderRouting, callTimeoutMs: number | undefined): number {
-    if (callTimeoutMs !== undefined) {
+    if (false) {
       return callTimeoutMs;
     }
killedBy: EngineRouter honours a per-call timeout override regardless of provider config
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/router.ts:183:12
     if (callTimeoutMs !== undefined) {
       return callTimeoutMs;
     }
-    return candidate.timeoutMs ?? this.defaultTimeoutMs;
+    return candidate.timeoutMs && this.defaultTimeoutMs;
   }
 }
killedBy: EngineRouter — per-provider timeout preferred over default (mutation-hardening) uses the candidate.timeoutMs (short) and times out before the long default would
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
