[Killed] ArithmeticOperator
src/api-key-auth.ts:31:23
  * scrypt memory ceiling. Default is 32 MiB which N=2^15,r=8 sits right on; raise it so the KDF
  * runs without tripping the limit while still bounding memory (control: bounded KDF cost).
  */
-const SCRYPT_MAXMEM = 64 * 1024 * 1024;
+const SCRYPT_MAXMEM = 64 * 1024 / 1024;
 /** Plaintext secret length in bytes before hex encoding. */
 const SECRET_BYTES = 32;
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] ArithmeticOperator
src/api-key-auth.ts:31:23
  * scrypt memory ceiling. Default is 32 MiB which N=2^15,r=8 sits right on; raise it so the KDF
  * runs without tripping the limit while still bounding memory (control: bounded KDF cost).
  */
-const SCRYPT_MAXMEM = 64 * 1024 * 1024;
+const SCRYPT_MAXMEM = 64 / 1024 * 1024;
 /** Plaintext secret length in bytes before hex encoding. */
 const SECRET_BYTES = 32;
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:92:65
   | { readonly ok: false; readonly reason: VerifyFailureReason };
 
 /** Derive the scrypt hash for a plaintext + hex salt, returned as a raw buffer. */
-function deriveHash(plaintext: string, saltHex: string): Buffer {
-  return scryptSync(plaintext, Buffer.from(saltHex, 'hex'), HASH_BYTES, {
-    N: SCRYPT_N,
-    r: SCRYPT_R,
-    p: SCRYPT_P,
-    maxmem: SCRYPT_MAXMEM,
-  });
-}
+function deriveHash(plaintext: string, saltHex: string): Buffer {}
 
 /**
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/api-key-auth.ts:93:53
 
 /** Derive the scrypt hash for a plaintext + hex salt, returned as a raw buffer. */
 function deriveHash(plaintext: string, saltHex: string): Buffer {
-  return scryptSync(plaintext, Buffer.from(saltHex, 'hex'), HASH_BYTES, {
+  return scryptSync(plaintext, Buffer.from(saltHex, ""), HASH_BYTES, {
     N: SCRYPT_N,
     r: SCRYPT_R,
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:106:71
  * only a salted scrypt hash. Each key gets a fresh CSPRNG salt, so identical secrets never
  * produce identical hashes (control: defeats precomputed-hash / rainbow-table attacks).
  */
-export function createApiKey(input: CreateApiKeyInput): CreatedApiKey {
-  const keyId = randomBytes(KEY_ID_BYTES).toString('hex'); // public id, non-secret
-  const plaintext = randomBytes(SECRET_BYTES).toString('hex'); // CSPRNG secret
-  const salt = randomBytes(SALT_BYTES).toString('hex'); // per-key unique salt
-  const hash = deriveHash(plaintext, salt).toString('hex');
-
-  const record: ApiKeyRecord = {
-    keyId,
-    tenantId: input.tenantId,
-    scopes: [...input.scopes],
-    salt,
-    hash,
-    ...(input.expiresAt !== undefined ? { expiresAt: input.expiresAt } : {}),
-  };
-  return { keyId, plaintext, record };
-}
+export function createApiKey(input: CreateApiKeyInput): CreatedApiKey {}
 
 /**
killedBy: createApiKey expiry-spread path (kills the L118 conditional) omits expiresAt entirely when none is supplied
statusReason: Cannot destructure property 'record' of 'createApiKey(...)' as it is undefined.

[Killed] StringLiteral
src/api-key-auth.ts:110:53
   const keyId = randomBytes(KEY_ID_BYTES).toString('hex'); // public id, non-secret
   const plaintext = randomBytes(SECRET_BYTES).toString('hex'); // CSPRNG secret
   const salt = randomBytes(SALT_BYTES).toString('hex'); // per-key unique salt
-  const hash = deriveHash(plaintext, salt).toString('hex');
+  const hash = deriveHash(plaintext, salt).toString("");
 
   const record: ApiKeyRecord = {
killedBy: createApiKey expiry-spread path (kills the L118 conditional) omits expiresAt entirely when none is supplied
statusReason: Unknown encoding:

[Killed] EqualityOperator
src/api-key-auth.ts:118:9
     scopes: [...input.scopes],
     salt,
     hash,
-    ...(input.expiresAt !== undefined ? { expiresAt: input.expiresAt } : {}),
+    ...(input.expiresAt === undefined ? { expiresAt: input.expiresAt } : {}),
   };
   return { keyId, plaintext, record };
killedBy: createApiKey expiry-spread path (kills the L118 conditional) omits expiresAt entirely when none is supplied
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/api-key-auth.ts:118:9
     scopes: [...input.scopes],
     salt,
     hash,
-    ...(input.expiresAt !== undefined ? { expiresAt: input.expiresAt } : {}),
+    ...(true ? { expiresAt: input.expiresAt } : {}),
   };
   return { keyId, plaintext, record };
killedBy: createApiKey expiry-spread path (kills the L118 conditional) omits expiresAt entirely when none is supplied
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/api-key-auth.ts:138:5
 ): VerifyResult {
   // fail-closed: a structurally broken record can never authenticate.
   if (
-    typeof plaintext !== 'string' ||
-    plaintext.length === 0 ||
-    typeof record.salt !== 'string' ||
-    typeof record.hash !== 'string' ||
-    record.salt.length === 0 ||
-    record.hash.length === 0
+    true
   ) {
     return { ok: false, reason: 'malformed' };
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] LogicalOperator
src/api-key-auth.ts:138:5
 ): VerifyResult {
   // fail-closed: a structurally broken record can never authenticate.
   if (
-    typeof plaintext !== 'string' ||
-    plaintext.length === 0 ||
-    typeof record.salt !== 'string' ||
-    typeof record.hash !== 'string' ||
-    record.salt.length === 0 ||
+    (typeof plaintext !== 'string' || plaintext.length === 0 || typeof record.salt !== 'string' || typeof record.hash !== 'string') && record.salt.length === 0 ||
     record.hash.length === 0
   ) {
killedBy: verifyApiKey tamper rejection fails closed on a malformed (empty) record
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] ConditionalExpression
src/api-key-auth.ts:139:5
   // fail-closed: a structurally broken record can never authenticate.
   if (
     typeof plaintext !== 'string' ||
-    plaintext.length === 0 ||
+    false ||
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
killedBy: verifyApiKey tamper rejection fails closed on a malformed (empty) record
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] EqualityOperator
src/api-key-auth.ts:139:5
   // fail-closed: a structurally broken record can never authenticate.
   if (
     typeof plaintext !== 'string' ||
-    plaintext.length === 0 ||
+    plaintext.length !== 0 ||
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] EqualityOperator
src/api-key-auth.ts:140:5
   if (
     typeof plaintext !== 'string' ||
     plaintext.length === 0 ||
-    typeof record.salt !== 'string' ||
+    typeof record.salt === 'string' ||
     typeof record.hash !== 'string' ||
     record.salt.length === 0 ||
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] ConditionalExpression
src/api-key-auth.ts:140:5
   if (
     typeof plaintext !== 'string' ||
     plaintext.length === 0 ||
-    typeof record.salt !== 'string' ||
+    false ||
     typeof record.hash !== 'string' ||
     record.salt.length === 0 ||
killedBy: malformed-record typeof guards (kills the false-ing of the typeof arms) refuses a record whose salt is an array, not a string (reason stays malformed)
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] ConditionalExpression
src/api-key-auth.ts:141:5
     typeof plaintext !== 'string' ||
     plaintext.length === 0 ||
     typeof record.salt !== 'string' ||
-    typeof record.hash !== 'string' ||
+    false ||
     record.salt.length === 0 ||
     record.hash.length === 0
killedBy: malformed-record typeof guards (kills the false-ing of the typeof arms) refuses a record whose hash is an array, not a string (reason stays malformed)
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] EqualityOperator
src/api-key-auth.ts:141:5
     typeof plaintext !== 'string' ||
     plaintext.length === 0 ||
     typeof record.salt !== 'string' ||
-    typeof record.hash !== 'string' ||
+    typeof record.hash === 'string' ||
     record.salt.length === 0 ||
     record.hash.length === 0
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] EqualityOperator
src/api-key-auth.ts:142:5
     plaintext.length === 0 ||
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
-    record.salt.length === 0 ||
+    record.salt.length !== 0 ||
     record.hash.length === 0
   ) {
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] ConditionalExpression
src/api-key-auth.ts:142:5
     plaintext.length === 0 ||
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
-    record.salt.length === 0 ||
+    false ||
     record.hash.length === 0
   ) {
killedBy: verifyApiKey tamper rejection fails closed on a malformed (empty) record
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] ConditionalExpression
src/api-key-auth.ts:143:5
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
     record.salt.length === 0 ||
-    record.hash.length === 0
+    false
   ) {
     return { ok: false, reason: 'malformed' };
killedBy: verifyApiKey tamper rejection fails closed on a malformed (empty) record
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] EqualityOperator
src/api-key-auth.ts:143:5
     typeof record.salt !== 'string' ||
     typeof record.hash !== 'string' ||
     record.salt.length === 0 ||
-    record.hash.length === 0
+    record.hash.length !== 0
   ) {
     return { ok: false, reason: 'malformed' };
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'malformed' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:144:5
     typeof record.hash !== 'string' ||
     record.salt.length === 0 ||
     record.hash.length === 0
-  ) {
-    return { ok: false, reason: 'malformed' };
-  }
+  ) {}
 
   let expected: Buffer;
killedBy: malformed-record typeof guards (kills the false-ing of the typeof arms) refuses a record whose salt is an array, not a string (reason stays malformed)
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] BooleanLiteral
src/api-key-auth.ts:145:18
     record.salt.length === 0 ||
     record.hash.length === 0
   ) {
-    return { ok: false, reason: 'malformed' };
+    return { ok: true, reason: 'malformed' };
   }
 
killedBy: malformed-record typeof guards (kills the false-ing of the typeof arms) refuses a record whose salt is an array, not a string (reason stays malformed)
statusReason: expected { ok: true, reason: 'malformed' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] StringLiteral
src/api-key-auth.ts:145:33
     record.salt.length === 0 ||
     record.hash.length === 0
   ) {
-    return { ok: false, reason: 'malformed' };
+    return { ok: false, reason: "" };
   }
 
killedBy: verifyApiKey tamper rejection fails closed on a malformed (empty) record
statusReason: expected { ok: false, reason: '' } to deeply equal { ok: false, reason: 'malformed' }

[Killed] BlockStatement
src/api-key-auth.ts:150:7
 
   let expected: Buffer;
   let actual: Buffer;
-  try {
-    expected = Buffer.from(record.hash, 'hex');
-    actual = deriveHash(plaintext, record.salt);
-  } catch {
+  try {} catch {
     return { ok: false, reason: 'malformed' }; // fail-closed on undecodable record
   }
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/api-key-auth.ts:151:41
   let expected: Buffer;
   let actual: Buffer;
   try {
-    expected = Buffer.from(record.hash, 'hex');
+    expected = Buffer.from(record.hash, "");
     actual = deriveHash(plaintext, record.salt);
   } catch {
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: true }

[NoCoverage] BlockStatement
src/api-key-auth.ts:153:11
   try {
     expected = Buffer.from(record.hash, 'hex');
     actual = deriveHash(plaintext, record.salt);
-  } catch {
-    return { ok: false, reason: 'malformed' }; // fail-closed on undecodable record
-  }
+  } catch {}
 
   // Constant-time over equal-length buffers; unequal length is a definite mismatch.

[NoCoverage] BooleanLiteral
src/api-key-auth.ts:154:18
     expected = Buffer.from(record.hash, 'hex');
     actual = deriveHash(plaintext, record.salt);
   } catch {
-    return { ok: false, reason: 'malformed' }; // fail-closed on undecodable record
+    return { ok: true, reason: 'malformed' }; // fail-closed on undecodable record
   }
 

[NoCoverage] StringLiteral
src/api-key-auth.ts:154:33
     expected = Buffer.from(record.hash, 'hex');
     actual = deriveHash(plaintext, record.salt);
   } catch {
-    return { ok: false, reason: 'malformed' }; // fail-closed on undecodable record
+    return { ok: false, reason: "" }; // fail-closed on undecodable record
   }
 

[Killed] ConditionalExpression
src/api-key-auth.ts:159:5
 
   // Constant-time over equal-length buffers; unequal length is a definite mismatch.
   if (
-    expected.length !== actual.length ||
-    !timingSafeEqual(expected, actual)
+    true
   ) {
     return { ok: false, reason: 'mismatch' };
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: true }

[Killed] LogicalOperator
src/api-key-auth.ts:159:5
 
   // Constant-time over equal-length buffers; unequal length is a definite mismatch.
   if (
-    expected.length !== actual.length ||
-    !timingSafeEqual(expected, actual)
+    expected.length !== actual.length && !timingSafeEqual(expected, actual)
   ) {
     return { ok: false, reason: 'mismatch' };
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) rejects a near-miss plaintext against the same fixed vector
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'mismatch' }

[Killed] BooleanLiteral
src/api-key-auth.ts:160:5
   // Constant-time over equal-length buffers; unequal length is a definite mismatch.
   if (
     expected.length !== actual.length ||
-    !timingSafeEqual(expected, actual)
+    timingSafeEqual(expected, actual)
   ) {
     return { ok: false, reason: 'mismatch' };
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'mismatch' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:161:5
   if (
     expected.length !== actual.length ||
     !timingSafeEqual(expected, actual)
-  ) {
-    return { ok: false, reason: 'mismatch' };
-  }
+  ) {}
 
   // tenant isolation: a valid secret is still refused outside its own tenant.
killedBy: verifyApiKey tamper rejection rejects a one-character tamper of the plaintext
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'mismatch' }

[Killed] BooleanLiteral
src/api-key-auth.ts:162:18
     expected.length !== actual.length ||
     !timingSafeEqual(expected, actual)
   ) {
-    return { ok: false, reason: 'mismatch' };
+    return { ok: true, reason: 'mismatch' };
   }
 
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) rejects a near-miss plaintext against the same fixed vector
statusReason: expected { ok: true, reason: 'mismatch' } to deeply equal { ok: false, reason: 'mismatch' }

[Killed] StringLiteral
src/api-key-auth.ts:162:33
     expected.length !== actual.length ||
     !timingSafeEqual(expected, actual)
   ) {
-    return { ok: false, reason: 'mismatch' };
+    return { ok: false, reason: "" };
   }
 
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) rejects a near-miss plaintext against the same fixed vector
statusReason: expected { ok: false, reason: '' } to deeply equal { ok: false, reason: 'mismatch' }

[Killed] EqualityOperator
src/api-key-auth.ts:166:7
   }
 
   // tenant isolation: a valid secret is still refused outside its own tenant.
-  if (record.tenantId !== ctx.tenantId) {
+  if (record.tenantId === ctx.tenantId) {
     return { ok: false, reason: 'wrong-tenant' };
   }
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'wrong-tenant' } to deeply equal { ok: true }

[Killed] ConditionalExpression
src/api-key-auth.ts:166:7
   }
 
   // tenant isolation: a valid secret is still refused outside its own tenant.
-  if (record.tenantId !== ctx.tenantId) {
+  if (true) {
     return { ok: false, reason: 'wrong-tenant' };
   }
killedBy: KDF known-answer vector (kills salt-encoding and scrypt-param mutants) verifies the genuine plaintext against the precomputed scrypt hash
statusReason: expected { ok: false, reason: 'wrong-tenant' } to deeply equal { ok: true }

[Killed] BooleanLiteral
src/api-key-auth.ts:167:18
 
   // tenant isolation: a valid secret is still refused outside its own tenant.
   if (record.tenantId !== ctx.tenantId) {
-    return { ok: false, reason: 'wrong-tenant' };
+    return { ok: true, reason: 'wrong-tenant' };
   }
 
killedBy: verifyApiKey tenant isolation denies a valid secret presented for the wrong tenant
statusReason: expected { ok: true, reason: 'wrong-tenant' } to deeply equal { ok: false, reason: 'wrong-tenant' }

[Killed] EqualityOperator
src/api-key-auth.ts:171:7
   }
 
   // fail-closed: an expired key is refused even though its secret matches.
-  if (record.expiresAt !== undefined) {
+  if (record.expiresAt === undefined) {
     const now = ctx.now ?? new Date();
     const exp = Date.parse(record.expiresAt);
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false, reason: 'expired' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:171:39
   }
 
   // fail-closed: an expired key is refused even though its secret matches.
-  if (record.expiresAt !== undefined) {
-    const now = ctx.now ?? new Date();
-    const exp = Date.parse(record.expiresAt);
-    if (Number.isNaN(exp) || now.getTime() >= exp) {
-      return { ok: false, reason: 'expired' };
-    }
-  }
+  if (record.expiresAt !== undefined) {}
 
   // least privilege: every required scope must be granted, else refuse.
killedBy: verifyApiKey expiry (injected clock) denies exactly at expiry (inclusive cutoff)
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'expired' }

[Killed] LogicalOperator
src/api-key-auth.ts:172:17
 
   // fail-closed: an expired key is refused even though its secret matches.
   if (record.expiresAt !== undefined) {
-    const now = ctx.now ?? new Date();
+    const now = ctx.now && new Date();
     const exp = Date.parse(record.expiresAt);
     if (Number.isNaN(exp) || now.getTime() >= exp) {
killedBy: verifyApiKey expiry (injected clock) allows one millisecond before expiry
statusReason: expected { ok: false, reason: 'expired' } to deeply equal { ok: true }

[Killed] ConditionalExpression
src/api-key-auth.ts:174:9
   if (record.expiresAt !== undefined) {
     const now = ctx.now ?? new Date();
     const exp = Date.parse(record.expiresAt);
-    if (Number.isNaN(exp) || now.getTime() >= exp) {
+    if (true) {
       return { ok: false, reason: 'expired' };
     }
killedBy: verifyApiKey expiry (injected clock) allows one millisecond before expiry
statusReason: expected { ok: false, reason: 'expired' } to deeply equal { ok: true }

[Killed] BlockStatement
src/api-key-auth.ts:174:52
   if (record.expiresAt !== undefined) {
     const now = ctx.now ?? new Date();
     const exp = Date.parse(record.expiresAt);
-    if (Number.isNaN(exp) || now.getTime() >= exp) {
-      return { ok: false, reason: 'expired' };
-    }
+    if (Number.isNaN(exp) || now.getTime() >= exp) {}
   }
 
killedBy: verifyApiKey expiry (injected clock) denies exactly at expiry (inclusive cutoff)
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'expired' }

[Killed] BooleanLiteral
src/api-key-auth.ts:175:20
     const now = ctx.now ?? new Date();
     const exp = Date.parse(record.expiresAt);
     if (Number.isNaN(exp) || now.getTime() >= exp) {
-      return { ok: false, reason: 'expired' };
+      return { ok: true, reason: 'expired' };
     }
   }
killedBy: verifyApiKey expiry (injected clock) denies exactly at expiry (inclusive cutoff)
statusReason: expected { ok: true, reason: 'expired' } to deeply equal { ok: false, reason: 'expired' }

[Killed] EqualityOperator
src/api-key-auth.ts:180:7
   }
 
   // least privilege: every required scope must be granted, else refuse.
-  if (ctx.requiredScopes !== undefined) {
+  if (ctx.requiredScopes === undefined) {
     const granted = new Set(record.scopes);
     for (const need of ctx.requiredScopes) {
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: ctx.requiredScopes is not iterable

[Killed] BlockStatement
src/api-key-auth.ts:180:41
   }
 
   // least privilege: every required scope must be granted, else refuse.
-  if (ctx.requiredScopes !== undefined) {
-    const granted = new Set(record.scopes);
-    for (const need of ctx.requiredScopes) {
-      if (!granted.has(need)) {
-        return { ok: false, reason: 'missing-scope' };
-      }
-    }
-  }
+  if (ctx.requiredScopes !== undefined) {}
 
   return { ok: true };
killedBy: verifyApiKey scope enforcement denies when a required scope is missing (least privilege)
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'missing-scope' }

[Killed] BlockStatement
src/api-key-auth.ts:182:44
   // least privilege: every required scope must be granted, else refuse.
   if (ctx.requiredScopes !== undefined) {
     const granted = new Set(record.scopes);
-    for (const need of ctx.requiredScopes) {
-      if (!granted.has(need)) {
-        return { ok: false, reason: 'missing-scope' };
-      }
-    }
+    for (const need of ctx.requiredScopes) {}
   }
 
killedBy: verifyApiKey scope enforcement denies when a required scope is missing (least privilege)
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'missing-scope' }

[Killed] ConditionalExpression
src/api-key-auth.ts:183:11
   if (ctx.requiredScopes !== undefined) {
     const granted = new Set(record.scopes);
     for (const need of ctx.requiredScopes) {
-      if (!granted.has(need)) {
+      if (false) {
         return { ok: false, reason: 'missing-scope' };
       }
killedBy: verifyApiKey scope enforcement denies when a required scope is missing (least privilege)
statusReason: expected { ok: true } to deeply equal { ok: false, reason: 'missing-scope' }

[Killed] ConditionalExpression
src/api-key-auth.ts:183:11
   if (ctx.requiredScopes !== undefined) {
     const granted = new Set(record.scopes);
     for (const need of ctx.requiredScopes) {
-      if (!granted.has(need)) {
+      if (true) {
         return { ok: false, reason: 'missing-scope' };
       }
killedBy: verifyApiKey scope enforcement allows when all required scopes are granted
statusReason: expected { ok: false, reason: 'missing-scope' } to deeply equal { ok: true }

[Killed] BooleanLiteral
src/api-key-auth.ts:184:22
     const granted = new Set(record.scopes);
     for (const need of ctx.requiredScopes) {
       if (!granted.has(need)) {
-        return { ok: false, reason: 'missing-scope' };
+        return { ok: true, reason: 'missing-scope' };
       }
     }
killedBy: verifyApiKey scope enforcement denies when a required scope is missing (least privilege)
statusReason: expected { ok: true, reason: 'missing-scope' } to deeply equal { ok: false, reason: 'missing-scope' }

[Killed] ObjectLiteral
src/api-key-auth.ts:184:16
     const granted = new Set(record.scopes);
     for (const need of ctx.requiredScopes) {
       if (!granted.has(need)) {
-        return { ok: false, reason: 'missing-scope' };
+        return {};
       }
     }
killedBy: verifyApiKey scope enforcement denies when a required scope is missing (least privilege)
statusReason: expected {} to deeply equal { ok: false, reason: 'missing-scope' }

[Killed] BooleanLiteral
src/api-key-auth.ts:189:16
     }
   }
 
-  return { ok: true };
+  return { ok: false };
 }
 
killedBy: verifyApiKey round-trip verifies a freshly issued key for its own tenant
statusReason: expected { ok: false } to deeply equal { ok: true }
