[Killed] StringLiteral
src/jobs.ts:18:82
  * The lifecycle states of a try-on job. A job is created `queued`, moves to `processing`
  * while a provider runs, and ends terminally as `succeeded` or `failed`.
  */
-export const TryOnJobStatusSchema = z.enum(['queued', 'processing', 'succeeded', 'failed']);
+export const TryOnJobStatusSchema = z.enum(['queued', 'processing', 'succeeded', ""]);
 
 /** A try-on job lifecycle status. */
killedBy: parseTryOnJob accepts a failed job carrying an error
statusReason: [
  {
    "received": "failed",
    "code": "invalid_enum_value",
    "options": [
      "queued",
      "processing",
      "succeeded",

[Killed] MethodExpression
src/jobs.ts:31:10
  * `idempotencyKey` deduplicates retries of the same logical request.
  */
 export const TryOnJobSchema = z.object({
-  jobId: z.string().min(1),
+  jobId: z.string().max(1),
   status: TryOnJobStatusSchema,
   request: TryOnRequestSchema,
killedBy: parseTryOnJob parses a valid queued job (request defaults applied)
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/jobs.ts:35:10
   status: TryOnJobStatusSchema,
   request: TryOnRequestSchema,
   result: TryOnResultSchema.optional(),
-  error: z.string().min(1).optional(),
+  error: z.string().max(1).optional(),
   createdAt: z.string().datetime(),
   updatedAt: z.string().datetime(),
killedBy: parseTryOnJob accepts a failed job carrying an error
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] MethodExpression
src/jobs.ts:38:19
   error: z.string().min(1).optional(),
   createdAt: z.string().datetime(),
   updatedAt: z.string().datetime(),
-  idempotencyKey: z.string().min(1).optional(),
+  idempotencyKey: z.string().max(1).optional(),
 });
 
killedBy: parseTryOnJob accepts an optional idempotencyKey
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "string",
    "inclusive": true,
    "exact": false,
    "message": "String must contain at most 1 character(s)",

[Killed] BlockStatement
src/jobs.ts:49:57
  *
  * @throws {z.ZodError} if the input does not satisfy {@link TryOnJobSchema}.
  */
-export function parseTryOnJob(input: unknown): TryOnJob {
-  // fail-closed: a corrupted or partial job record is rejected, not trusted.
-  return TryOnJobSchema.parse(input);
-}
+export function parseTryOnJob(input: unknown): TryOnJob {}
 
 /** Non-throwing variant of {@link parseTryOnJob}. */
killedBy: parseTryOnJob parses a valid queued job (request defaults applied)
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/jobs.ts:55:93
 }
 
 /** Non-throwing variant of {@link parseTryOnJob}. */
-export function safeParseTryOnJob(input: unknown): z.SafeParseReturnType<unknown, TryOnJob> {
-  return TryOnJobSchema.safeParse(input);
-}
+export function safeParseTryOnJob(input: unknown): z.SafeParseReturnType<unknown, TryOnJob> {}
 
killedBy: parseTryOnJob accepts every status value
statusReason: Cannot read properties of undefined (reading 'success')
