[Killed] ArrayDeclaration
src/providers.ts:17:40
  * The closed set of supported provider backends. `deterministic` is the always-available,
  * non-AI fallback that produces a reproducible result so the engine never hard-fails.
  */
-export const ProviderIdSchema = z.enum([
-  'fal',
-  'replicate',
-  'google-vto',
-  'self-hosted',
-  'deterministic',
-]);
+export const ProviderIdSchema = z.enum([]);
 
 /** A supported provider backend id. */
killedBy: parseAuditEvent accepts optional provider and costUsd
statusReason: [
  {
    "received": "fal",
    "code": "invalid_enum_value",
    "options": [],
    "path": [
      "provider"
    ],

[Killed] MethodExpression
src/providers.ts:41:14
   priority: z.number().int(),
   costPerCallUsd: z.number().nonnegative(),
   // Bound the timeout to a sane window: at least 1ms, at most 5 minutes.
-  timeoutMs: z.number().int().min(1).max(300_000),
+  timeoutMs: z.number().int().min(1).min(300_000),
   // At least one in-flight call; capped so a single provider cannot monopolise resources.
   maxConcurrency: z.number().int().min(1).max(1000),
killedBy: parseProviderConfig parses a valid config
statusReason: [
  {
    "code": "too_small",
    "minimum": 300000,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be greater than or equal to 300000",

[Killed] MethodExpression
src/providers.ts:41:14
   priority: z.number().int(),
   costPerCallUsd: z.number().nonnegative(),
   // Bound the timeout to a sane window: at least 1ms, at most 5 minutes.
-  timeoutMs: z.number().int().min(1).max(300_000),
+  timeoutMs: z.number().int().max(1).max(300_000),
   // At least one in-flight call; capped so a single provider cannot monopolise resources.
   maxConcurrency: z.number().int().min(1).max(1000),
killedBy: parseProviderConfig parses a valid config
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] MethodExpression
src/providers.ts:43:19
   // Bound the timeout to a sane window: at least 1ms, at most 5 minutes.
   timeoutMs: z.number().int().min(1).max(300_000),
   // At least one in-flight call; capped so a single provider cannot monopolise resources.
-  maxConcurrency: z.number().int().min(1).max(1000),
+  maxConcurrency: z.number().int().min(1).min(1000),
 });
 
killedBy: parseProviderConfig parses a valid config
statusReason: [
  {
    "code": "too_small",
    "minimum": 1000,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be greater than or equal to 1000",

[Killed] MethodExpression
src/providers.ts:43:19
   // Bound the timeout to a sane window: at least 1ms, at most 5 minutes.
   timeoutMs: z.number().int().min(1).max(300_000),
   // At least one in-flight call; capped so a single provider cannot monopolise resources.
-  maxConcurrency: z.number().int().min(1).max(1000),
+  maxConcurrency: z.number().int().max(1).max(1000),
 });
 
killedBy: parseProviderConfig parses a valid config
statusReason: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "number",
    "inclusive": true,
    "exact": false,
    "message": "Number must be less than or equal to 1",

[Killed] BlockStatement
src/providers.ts:54:61
  *
  * @throws {z.ZodError} if the input is not a known provider id.
  */
-export function parseProviderId(input: unknown): ProviderId {
-  return ProviderIdSchema.parse(input);
-}
+export function parseProviderId(input: unknown): ProviderId {}
 
 /** Non-throwing variant of {@link parseProviderId}. */
killedBy: parseProviderId accepts every known provider id
statusReason: expected undefined to be 'fal' // Object.is equality

[Killed] BlockStatement
src/providers.ts:59:97
 }
 
 /** Non-throwing variant of {@link parseProviderId}. */
-export function safeParseProviderId(input: unknown): z.SafeParseReturnType<unknown, ProviderId> {
-  return ProviderIdSchema.safeParse(input);
-}
+export function safeParseProviderId(input: unknown): z.SafeParseReturnType<unknown, ProviderId> {}
 
 /**
killedBy: parseProviderId safeParseProviderId reports success for known and failure for unknown ids
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
src/providers.ts:68:69
  *
  * @throws {z.ZodError} if the input does not satisfy {@link ProviderConfigSchema}.
  */
-export function parseProviderConfig(input: unknown): ProviderConfig {
-  // fail-closed: a malformed provider config is rejected rather than partially applied.
-  return ProviderConfigSchema.parse(input);
-}
+export function parseProviderConfig(input: unknown): ProviderConfig {}
 
 /** Non-throwing variant of {@link parseProviderConfig}. */
killedBy: parseProviderConfig parses a valid config
statusReason: expected undefined to deeply equal { id: 'fal', enabled: true, …(4) }

[Killed] BlockStatement
src/providers.ts:76:51
 /** Non-throwing variant of {@link parseProviderConfig}. */
 export function safeParseProviderConfig(
   input: unknown,
-): z.SafeParseReturnType<unknown, ProviderConfig> {
-  return ProviderConfigSchema.safeParse(input);
-}
+): z.SafeParseReturnType<unknown, ProviderConfig> {}
 
killedBy: parseProviderConfig safeParse fails for a missing enabled flag
statusReason: Cannot read properties of undefined (reading 'success')
