[Killed] ArithmeticOperator
src/image-validation.ts:35:13
 
 /** Conservative default limits: 8 MiB, 4096x4096. */
 export const DEFAULT_IMAGE_LIMITS: ImageValidationLimits = {
-  maxBytes: 8 * 1024 * 1024,
+  maxBytes: 8 / 1024 * 1024,
   maxWidth: 4096,
   maxHeight: 4096,
killedBy: defaults DEFAULT_IMAGE_LIMITS are sane and used when omitted
statusReason: expected 8 to be 8388608 // Object.is equality

[Killed] ArithmeticOperator
src/image-validation.ts:35:13
 
 /** Conservative default limits: 8 MiB, 4096x4096. */
 export const DEFAULT_IMAGE_LIMITS: ImageValidationLimits = {
-  maxBytes: 8 * 1024 * 1024,
+  maxBytes: 8 * 1024 / 1024,
   maxWidth: 4096,
   maxHeight: 4096,
killedBy: defaults DEFAULT_IMAGE_LIMITS are sane and used when omitted
statusReason: expected 8 to be 8388608 // Object.is equality

[Killed] BlockStatement
src/image-validation.ts:77:67
  * bytes after the parsed header — leave this boundary (threat T2).
  */
 export class PassthroughImageSanitizer implements ImageSanitizer {
-  sanitize(bytes: Uint8Array, _format: SniffedFormat): Uint8Array {
-    return bytes;
-  }
+  sanitize(bytes: Uint8Array, _format: SniffedFormat): Uint8Array {}
 }
 
killedBy: sanitizer seam default passthrough returns the original validated bytes
statusReason: expected undefined to deeply equal Uint8Array[ 137, 80, 78, 71, 13, …(15) ]

[Killed] BlockStatement
src/image-validation.ts:83:54
 }
 
 /** Map a sniffed format to the MIME string a caller would declare. */
-function formatToMime(format: SniffedFormat): string {
-  return format; // SniffedFormat values are themselves MIME strings
-}
+function formatToMime(format: SniffedFormat): string {}
 
 /**
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, reason: 'mime-mismatch' } to match object { ok: true, format: 'image/png', …(2) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/image-validation.ts:98:39
   sanitizer: ImageSanitizer = new PassthroughImageSanitizer(),
 ): ImageValidationResult {
   // Size ceiling first: bound work before parsing untrusted structure.
-  if (bytes.length > limits.maxBytes) {
-    return { ok: false, reason: 'too-large' }; // fail-closed: oversize payload
-  }
+  if (bytes.length > limits.maxBytes) {}
 
   const format = sniffFormat(bytes);
killedBy: byte-size boundary rejects a payload one byte over maxBytes (fail-closed before parse)
statusReason: expected { ok: true, format: 'image/png', …(3) } to deeply equal { ok: false, reason: 'too-large' }

[Killed] EqualityOperator
src/image-validation.ts:98:7
   sanitizer: ImageSanitizer = new PassthroughImageSanitizer(),
 ): ImageValidationResult {
   // Size ceiling first: bound work before parsing untrusted structure.
-  if (bytes.length > limits.maxBytes) {
+  if (bytes.length >= limits.maxBytes) {
     return { ok: false, reason: 'too-large' }; // fail-closed: oversize payload
   }
killedBy: byte-size boundary accepts a payload exactly at maxBytes
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/image-validation.ts:99:18
 ): ImageValidationResult {
   // Size ceiling first: bound work before parsing untrusted structure.
   if (bytes.length > limits.maxBytes) {
-    return { ok: false, reason: 'too-large' }; // fail-closed: oversize payload
+    return { ok: true, reason: 'too-large' }; // fail-closed: oversize payload
   }
 
killedBy: byte-size boundary rejects a payload one byte over maxBytes (fail-closed before parse)
statusReason: expected { ok: true, reason: 'too-large' } to deeply equal { ok: false, reason: 'too-large' }

[Killed] BlockStatement
src/image-validation.ts:103:24
   }
 
   const format = sniffFormat(bytes);
-  if (format === null) {
-    return { ok: false, reason: 'unrecognised-format' }; // fail-closed: unknown bytes
-  }
+  if (format === null) {}
 
   // Declared MIME must equal the true format — defeats extension/MIME spoofing.
killedBy: malformed / truncated input rejects unrecognised bytes
statusReason: Cannot read properties of undefined (reading 'width')

[Killed] EqualityOperator
src/image-validation.ts:103:7
   }
 
   const format = sniffFormat(bytes);
-  if (format === null) {
+  if (format !== null) {
     return { ok: false, reason: 'unrecognised-format' }; // fail-closed: unknown bytes
   }
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { ok: true, format: 'image/png', …(2) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/image-validation.ts:104:18
 
   const format = sniffFormat(bytes);
   if (format === null) {
-    return { ok: false, reason: 'unrecognised-format' }; // fail-closed: unknown bytes
+    return { ok: true, reason: 'unrecognised-format' }; // fail-closed: unknown bytes
   }
 
killedBy: malformed / truncated input rejects unrecognised bytes
statusReason: expected { ok: true, …(1) } to deeply equal { ok: false, …(1) }

[Killed] ConditionalExpression
src/image-validation.ts:108:37
   }
 
   // Declared MIME must equal the true format — defeats extension/MIME spoofing.
-  if (declaredMime !== undefined && declaredMime !== formatToMime(format)) {
+  if (declaredMime !== undefined && true) {
     return { ok: false, reason: 'mime-mismatch' };
   }
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, reason: 'mime-mismatch' } to match object { ok: true, format: 'image/png', …(2) }
(1 matching property omitted from actual)

[Killed] LogicalOperator
src/image-validation.ts:108:7
   }
 
   // Declared MIME must equal the true format — defeats extension/MIME spoofing.
-  if (declaredMime !== undefined && declaredMime !== formatToMime(format)) {
+  if (declaredMime !== undefined || declaredMime !== formatToMime(format)) {
     return { ok: false, reason: 'mime-mismatch' };
   }
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, reason: 'mime-mismatch' } to match object { ok: true, format: 'image/png', …(2) }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/image-validation.ts:109:18
 
   // Declared MIME must equal the true format — defeats extension/MIME spoofing.
   if (declaredMime !== undefined && declaredMime !== formatToMime(format)) {
-    return { ok: false, reason: 'mime-mismatch' };
+    return { ok: true, reason: 'mime-mismatch' };
   }
 
killedBy: MIME / extension spoofing rejected rejects PNG-declared bytes that are actually JPEG
statusReason: expected { ok: true, reason: 'mime-mismatch' } to deeply equal { ok: false, reason: 'mime-mismatch' }

[Killed] ObjectLiteral
src/image-validation.ts:109:12
 
   // Declared MIME must equal the true format — defeats extension/MIME spoofing.
   if (declaredMime !== undefined && declaredMime !== formatToMime(format)) {
-    return { ok: false, reason: 'mime-mismatch' };
+    return {};
   }
 
killedBy: MIME / extension spoofing rejected rejects PNG-declared bytes that are actually JPEG
statusReason: expected {} to deeply equal { ok: false, reason: 'mime-mismatch' }

[Killed] ConditionalExpression
src/image-validation.ts:113:7
   }
 
   const dims = parseDimensions(format, bytes);
-  if (dims === null) {
+  if (false) {
     return { ok: false, reason: 'malformed-header' }; // fail-closed: truncated/garbled
   }
killedBy: malformed / truncated input rejects a truncated PNG header that sniffs but will not parse
statusReason: Cannot read properties of null (reading 'width')

[Killed] BlockStatement
src/image-validation.ts:113:22
   }
 
   const dims = parseDimensions(format, bytes);
-  if (dims === null) {
-    return { ok: false, reason: 'malformed-header' }; // fail-closed: truncated/garbled
-  }
+  if (dims === null) {}
 
   if (dims.width > limits.maxWidth || dims.height > limits.maxHeight) {
killedBy: malformed / truncated input rejects a truncated PNG header that sniffs but will not parse
statusReason: Cannot read properties of null (reading 'width')

[Killed] BooleanLiteral
src/image-validation.ts:114:18
 
   const dims = parseDimensions(format, bytes);
   if (dims === null) {
-    return { ok: false, reason: 'malformed-header' }; // fail-closed: truncated/garbled
+    return { ok: true, reason: 'malformed-header' }; // fail-closed: truncated/garbled
   }
 
killedBy: malformed / truncated input rejects a truncated PNG header that sniffs but will not parse
statusReason: expected { Object (ok, reason) } to deeply equal { ok: false, …(1) }

[Killed] ConditionalExpression
src/image-validation.ts:117:7
     return { ok: false, reason: 'malformed-header' }; // fail-closed: truncated/garbled
   }
 
-  if (dims.width > limits.maxWidth || dims.height > limits.maxHeight) {
+  if (false) {
     return { ok: false, reason: 'dimensions-too-large' }; // fail-closed: dimension bomb
   }
killedBy: dimension boundary (dimension-bomb defence) rejects width one over the cap
statusReason: expected { ok: true, format: 'image/png', …(3) } to deeply equal { ok: false, …(1) }

[Killed] ConditionalExpression
src/image-validation.ts:117:7
     return { ok: false, reason: 'malformed-header' }; // fail-closed: truncated/garbled
   }
 
-  if (dims.width > limits.maxWidth || dims.height > limits.maxHeight) {
+  if (false || dims.height > limits.maxHeight) {
     return { ok: false, reason: 'dimensions-too-large' }; // fail-closed: dimension bomb
   }
killedBy: dimension boundary (dimension-bomb defence) rejects width one over the cap
statusReason: expected { ok: true, format: 'image/png', …(3) } to deeply equal { ok: false, …(1) }

[Killed] BooleanLiteral
src/image-validation.ts:118:18
   }
 
   if (dims.width > limits.maxWidth || dims.height > limits.maxHeight) {
-    return { ok: false, reason: 'dimensions-too-large' }; // fail-closed: dimension bomb
+    return { ok: true, reason: 'dimensions-too-large' }; // fail-closed: dimension bomb
   }
 
killedBy: dimension boundary (dimension-bomb defence) rejects width one over the cap
statusReason: expected { ok: true, …(1) } to deeply equal { ok: false, …(1) }

[Killed] ObjectLiteral
src/image-validation.ts:121:10
     return { ok: false, reason: 'dimensions-too-large' }; // fail-closed: dimension bomb
   }
 
-  return {
-    ok: true,
-    format,
-    width: dims.width,
-    height: dims.height,
-    bytes: sanitizer.sanitize(bytes, format),
-  };
+  return {};
 }
 
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected {} to match object { ok: true, format: 'image/png', …(2) }

[Killed] BlockStatement
src/image-validation.ts:140:26
   ref: ImageRef,
   limits: ImageValidationLimits = DEFAULT_IMAGE_LIMITS,
   sanitizer: ImageSanitizer = new PassthroughImageSanitizer(),
-): ImageValidationResult {
-  if (ref.kind !== 'base64') {
-    // fail-closed: no inline bytes to validate for a URL ref at this boundary.
-    return { ok: false, reason: 'unrecognised-format' };
-  }
-
-  let bytes: Uint8Array;
-  try {
-    bytes = new Uint8Array(Buffer.from(ref.data, 'base64'));
-  } catch {
-    return { ok: false, reason: 'malformed-header' }; // fail-closed on undecodable base64
-  }
-
-  return validateImageBytes(bytes, ref.mimeType, limits, sanitizer);
-}
+): ImageValidationResult {}
 
killedBy: validateImageRef (base64 path) accepts a valid base64 PNG whose bytes match the declared mimeType
statusReason: expected undefined to match object { ok: true, format: 'image/png' }

[Killed] BlockStatement
src/image-validation.ts:141:30
   limits: ImageValidationLimits = DEFAULT_IMAGE_LIMITS,
   sanitizer: ImageSanitizer = new PassthroughImageSanitizer(),
 ): ImageValidationResult {
-  if (ref.kind !== 'base64') {
-    // fail-closed: no inline bytes to validate for a URL ref at this boundary.
-    return { ok: false, reason: 'unrecognised-format' };
-  }
+  if (ref.kind !== 'base64') {}
 
   let bytes: Uint8Array;
killedBy: validateImageRef (base64 path) rejects a URL ref at this boundary (no inline bytes to inspect)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: false, …(1) }

[Killed] ConditionalExpression
src/image-validation.ts:141:7
   limits: ImageValidationLimits = DEFAULT_IMAGE_LIMITS,
   sanitizer: ImageSanitizer = new PassthroughImageSanitizer(),
 ): ImageValidationResult {
-  if (ref.kind !== 'base64') {
+  if (false) {
     // fail-closed: no inline bytes to validate for a URL ref at this boundary.
     return { ok: false, reason: 'unrecognised-format' };
killedBy: validateImageRef (base64 path) rejects a URL ref at this boundary (no inline bytes to inspect)
statusReason: expected { ok: false, …(1) } to deeply equal { ok: false, …(1) }

[Killed] BooleanLiteral
src/image-validation.ts:143:18
 ): ImageValidationResult {
   if (ref.kind !== 'base64') {
     // fail-closed: no inline bytes to validate for a URL ref at this boundary.
-    return { ok: false, reason: 'unrecognised-format' };
+    return { ok: true, reason: 'unrecognised-format' };
   }
 
killedBy: validateImageRef (base64 path) rejects a URL ref at this boundary (no inline bytes to inspect)
statusReason: expected { ok: true, …(1) } to deeply equal { ok: false, …(1) }

[Killed] ObjectLiteral
src/image-validation.ts:143:12
 ): ImageValidationResult {
   if (ref.kind !== 'base64') {
     // fail-closed: no inline bytes to validate for a URL ref at this boundary.
-    return { ok: false, reason: 'unrecognised-format' };
+    return {};
   }
 
killedBy: validateImageRef (base64 path) rejects a URL ref at this boundary (no inline bytes to inspect)
statusReason: expected {} to deeply equal { ok: false, …(1) }

[Killed] BlockStatement
src/image-validation.ts:147:7
   }
 
   let bytes: Uint8Array;
-  try {
-    bytes = new Uint8Array(Buffer.from(ref.data, 'base64'));
-  } catch {
+  try {} catch {
     return { ok: false, reason: 'malformed-header' }; // fail-closed on undecodable base64
   }
killedBy: validateImageRef (base64 path) accepts a valid base64 PNG whose bytes match the declared mimeType
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/image-validation.ts:148:50
 
   let bytes: Uint8Array;
   try {
-    bytes = new Uint8Array(Buffer.from(ref.data, 'base64'));
+    bytes = new Uint8Array(Buffer.from(ref.data, ""));
   } catch {
     return { ok: false, reason: 'malformed-header' }; // fail-closed on undecodable base64
killedBy: validateImageRef (base64 path) accepts a valid base64 PNG whose bytes match the declared mimeType
statusReason: expected { ok: false, …(1) } to match object { ok: true, format: 'image/png' }
(1 matching property omitted from actual)

[NoCoverage] BlockStatement
src/image-validation.ts:149:11
   let bytes: Uint8Array;
   try {
     bytes = new Uint8Array(Buffer.from(ref.data, 'base64'));
-  } catch {
-    return { ok: false, reason: 'malformed-header' }; // fail-closed on undecodable base64
-  }
+  } catch {}
 
   return validateImageBytes(bytes, ref.mimeType, limits, sanitizer);

[NoCoverage] BooleanLiteral
src/image-validation.ts:150:18
   try {
     bytes = new Uint8Array(Buffer.from(ref.data, 'base64'));
   } catch {
-    return { ok: false, reason: 'malformed-header' }; // fail-closed on undecodable base64
+    return { ok: true, reason: 'malformed-header' }; // fail-closed on undecodable base64
   }
 
