[Killed] BlockStatement
src/internal/stable_request_hash.ts:18:54
  * Canonically serialise an arbitrary JSON-ish value with object keys sorted recursively, so
  * two structurally-equal requests serialise to the exact same string regardless of key order.
  */
-export function canonicalize(value: unknown): string {
-  if (value === null || typeof value !== 'object') {
-    // Primitives (and null) serialise directly; JSON.stringify handles escaping.
-    return JSON.stringify(value) ?? 'null';
-  }
-  if (Array.isArray(value)) {
-    return `[${value.map((item) => canonicalize(item)).join(',')}]`;
-  }
-  const record = value as Record<string, unknown>;
-  const keys = Object.keys(record).sort();
-  const entries = keys.map((key) => `${JSON.stringify(key)}:${canonicalize(record[key])}`);
-  return `{${entries.join(',')}}`;
-}
+export function canonicalize(value: unknown): string {}
 
 /** The 32-bit FNV-1a offset basis and prime — fixed by the algorithm specification. */
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/internal/stable_request_hash.ts:19:7
  * two structurally-equal requests serialise to the exact same string regardless of key order.
  */
 export function canonicalize(value: unknown): string {
-  if (value === null || typeof value !== 'object') {
+  if (value === null && typeof value !== 'object') {
     // Primitives (and null) serialise directly; JSON.stringify handles escaping.
     return JSON.stringify(value) ?? 'null';
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/internal/stable_request_hash.ts:19:25
  * two structurally-equal requests serialise to the exact same string regardless of key order.
  */
 export function canonicalize(value: unknown): string {
-  if (value === null || typeof value !== 'object') {
+  if (value === null || typeof value === 'object') {
     // Primitives (and null) serialise directly; JSON.stringify handles escaping.
     return JSON.stringify(value) ?? 'null';
killedBy: canonicalize is invariant to object key ordering
statusReason: expected '{"b":1,"a":2,"c":{"y":1,"x":2}}' to be '{"a":2,"c":{"x":2,"y":1},"b":1}' // Object.is equality

[Killed] LogicalOperator
src/internal/stable_request_hash.ts:21:12
 export function canonicalize(value: unknown): string {
   if (value === null || typeof value !== 'object') {
     // Primitives (and null) serialise directly; JSON.stringify handles escaping.
-    return JSON.stringify(value) ?? 'null';
+    return JSON.stringify(value) && 'null';
   }
   if (Array.isArray(value)) {
killedBy: canonicalize distinguishes arrays from objects and preserves array order
statusReason: expected '[null,null,null]' not to be '[null,null,null]' // Object.is equality

[Killed] ArrowFunction
src/internal/stable_request_hash.ts:24:26
     return JSON.stringify(value) ?? 'null';
   }
   if (Array.isArray(value)) {
-    return `[${value.map((item) => canonicalize(item)).join(',')}]`;
+    return `[${value.map(() => undefined).join(',')}]`;
   }
   const record = value as Record<string, unknown>;
killedBy: canonicalize distinguishes arrays from objects and preserves array order
statusReason: expected '[,,]' not to be '[,,]' // Object.is equality

[Killed] StringLiteral
src/internal/stable_request_hash.ts:24:12
     return JSON.stringify(value) ?? 'null';
   }
   if (Array.isArray(value)) {
-    return `[${value.map((item) => canonicalize(item)).join(',')}]`;
+    return ``;
   }
   const record = value as Record<string, unknown>;
killedBy: canonicalize distinguishes arrays from objects and preserves array order
statusReason: expected '' not to be '' // Object.is equality

[Killed] MethodExpression
src/internal/stable_request_hash.ts:27:16
     return `[${value.map((item) => canonicalize(item)).join(',')}]`;
   }
   const record = value as Record<string, unknown>;
-  const keys = Object.keys(record).sort();
+  const keys = Object.keys(record);
   const entries = keys.map((key) => `${JSON.stringify(key)}:${canonicalize(record[key])}`);
   return `{${entries.join(',')}}`;
killedBy: canonicalize is invariant to object key ordering
statusReason: expected '{"b":1,"a":2,"c":{"y":1,"x":2}}' to be '{"a":2,"c":{"x":2,"y":1},"b":1}' // Object.is equality

[Killed] ArrowFunction
src/internal/stable_request_hash.ts:28:28
   }
   const record = value as Record<string, unknown>;
   const keys = Object.keys(record).sort();
-  const entries = keys.map((key) => `${JSON.stringify(key)}:${canonicalize(record[key])}`);
+  const entries = keys.map(() => undefined);
   return `{${entries.join(',')}}`;
 }
killedBy: DeterministicProvider produces distinct URLs for requests differing only in productId (property)
statusReason: Property failed after 1 tests
{ seed: -513830413, path: "0:0:0:0:1:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","!"]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/internal/stable_request_hash.ts:28:37
   }
   const record = value as Record<string, unknown>;
   const keys = Object.keys(record).sort();
-  const entries = keys.map((key) => `${JSON.stringify(key)}:${canonicalize(record[key])}`);
+  const entries = keys.map((key) => ``);
   return `{${entries.join(',')}}`;
 }
killedBy: stableRequestHash changes when a meaningful field changes
statusReason: expected '5761bdc5bbbd0d19' not to be '5761bdc5bbbd0d19' // Object.is equality

[Survived] StringLiteral
src/internal/stable_request_hash.ts:29:27
   const record = value as Record<string, unknown>;
   const keys = Object.keys(record).sort();
   const entries = keys.map((key) => `${JSON.stringify(key)}:${canonicalize(record[key])}`);
-  return `{${entries.join(',')}}`;
+  return `{${entries.join("")}}`;
 }
 

[Killed] BlockStatement
src/internal/stable_request_hash.ts:42:48
  * Pure and deterministic: identical input always yields the identical number, on every
  * runtime, with no allocation beyond the loop. Used only as a reproducible fingerprint.
  */
-export function fnv1a32(input: string): number {
-  let hash = FNV_OFFSET_BASIS;
-  for (let i = 0; i < input.length; i += 1) {
-    hash ^= input.charCodeAt(i) & 0xff;
-    // FNV-1a multiply; `Math.imul` keeps the result a 32-bit integer multiply.
-    hash = Math.imul(hash, FNV_PRIME);
-  }
-  // `>>> 0` coerces to an unsigned 32-bit integer so the digest is stable and non-negative.
-  return hash >>> 0;
-}
+export function fnv1a32(input: string): number {}
 
 /**
killedBy: fnv1a32 matches the known FNV-1a 32-bit vector for the empty string and "a"
statusReason: expected undefined to be 2166136261 // Object.is equality

[Killed] BlockStatement
src/internal/stable_request_hash.ts:44:45
  */
 export function fnv1a32(input: string): number {
   let hash = FNV_OFFSET_BASIS;
-  for (let i = 0; i < input.length; i += 1) {
-    hash ^= input.charCodeAt(i) & 0xff;
-    // FNV-1a multiply; `Math.imul` keeps the result a 32-bit integer multiply.
-    hash = Math.imul(hash, FNV_PRIME);
-  }
+  for (let i = 0; i < input.length; i += 1) {}
   // `>>> 0` coerces to an unsigned 32-bit integer so the digest is stable and non-negative.
   return hash >>> 0;
killedBy: DeterministicProvider produces distinct URLs for requests differing only in productId (property)
statusReason: Property failed after 1 tests
{ seed: 1474745066, path: "0:0:0:1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","!"]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/internal/stable_request_hash.ts:44:19
  */
 export function fnv1a32(input: string): number {
   let hash = FNV_OFFSET_BASIS;
-  for (let i = 0; i < input.length; i += 1) {
+  for (let i = 0; false; i += 1) {
     hash ^= input.charCodeAt(i) & 0xff;
     // FNV-1a multiply; `Math.imul` keeps the result a 32-bit integer multiply.
killedBy: fnv1a32 matches the known FNV-1a 32-bit vector for the empty string and "a"
statusReason: expected 2166136261 to be 3826002220 // Object.is equality

[Killed] BlockStatement
src/internal/stable_request_hash.ts:60:62
  * the fingerprint to 64 bits of hex so distinct requests are very unlikely to collide while
  * remaining fully deterministic and crypto-free.
  */
-export function stableRequestHash(req: TryOnRequest): string {
-  const canonical = canonicalize(req);
-  const reversed = canonical.split('').reverse().join('');
-  const high = fnv1a32(canonical);
-  const low = fnv1a32(reversed);
-  return high.toString(16).padStart(8, '0') + low.toString(16).padStart(8, '0');
-}
+export function stableRequestHash(req: TryOnRequest): string {}
 
killedBy: stableRequestHash is a fixed 16-char lowercase hex digest
statusReason: .toMatch() expects to receive a string, but got undefined

[Survived] MethodExpression
src/internal/stable_request_hash.ts:62:20
  */
 export function stableRequestHash(req: TryOnRequest): string {
   const canonical = canonicalize(req);
-  const reversed = canonical.split('').reverse().join('');
+  const reversed = canonical.split('').join('');
   const high = fnv1a32(canonical);
   const low = fnv1a32(reversed);

[Survived] StringLiteral
src/internal/stable_request_hash.ts:62:55
  */
 export function stableRequestHash(req: TryOnRequest): string {
   const canonical = canonicalize(req);
-  const reversed = canonical.split('').reverse().join('');
+  const reversed = canonical.split('').reverse().join("Stryker was here!");
   const high = fnv1a32(canonical);
   const low = fnv1a32(reversed);

[Killed] ArithmeticOperator
src/internal/stable_request_hash.ts:65:10
   const reversed = canonical.split('').reverse().join('');
   const high = fnv1a32(canonical);
   const low = fnv1a32(reversed);
-  return high.toString(16).padStart(8, '0') + low.toString(16).padStart(8, '0');
+  return high.toString(16).padStart(8, '0') - low.toString(16).padStart(8, '0');
 }
 
killedBy: stableRequestHash is a fixed 16-char lowercase hex digest
statusReason: .toMatch() expects to receive a string, but got number

[Survived] StringLiteral
src/internal/stable_request_hash.ts:65:76
   const reversed = canonical.split('').reverse().join('');
   const high = fnv1a32(canonical);
   const low = fnv1a32(reversed);
-  return high.toString(16).padStart(8, '0') + low.toString(16).padStart(8, '0');
+  return high.toString(16).padStart(8, '0') + low.toString(16).padStart(8, "");
 }
 
