[Killed] StringLiteral
src/audit-log.ts:40:3
  * field via an unexpected key, it does not survive into the trail.
  */
 const REDACT_KEYS = new Set([
-  'apikey',
+  "",
   'apikeyplaintext',
   'plaintext',
killedBy: every REDACT_KEYS entry is enforced (kills blanked-literal mutants) redacts the "apikey" key
statusReason: expected 'super-secret-value' to be '[REDACTED]' // Object.is equality

[Killed] StringLiteral
src/audit-log.ts:41:3
  */
 const REDACT_KEYS = new Set([
   'apikey',
-  'apikeyplaintext',
+  "",
   'plaintext',
   'secret',
killedBy: every REDACT_KEYS entry is enforced (kills blanked-literal mutants) redacts the "apikeyplaintext" key
statusReason: expected 'super-secret-value' to be '[REDACTED]' // Object.is equality

[Killed] StringLiteral
src/audit-log.ts:42:3
 const REDACT_KEYS = new Set([
   'apikey',
   'apikeyplaintext',
-  'plaintext',
+  "",
   'secret',
   'token',
killedBy: every REDACT_KEYS entry is enforced (kills blanked-literal mutants) redacts the "plaintext" key
statusReason: expected 'super-secret-value' to be '[REDACTED]' // Object.is equality

[Killed] StringLiteral
src/audit-log.ts:43:3
   'apikey',
   'apikeyplaintext',
   'plaintext',
-  'secret',
+  "",
   'token',
   'authorization',
killedBy: every REDACT_KEYS entry is enforced (kills blanked-literal mutants) redacts the "secret" key
statusReason: expected 'super-secret-value' to be '[REDACTED]' // Object.is equality

[Killed] StringLiteral
src/audit-log.ts:45:3
   'plaintext',
   'secret',
   'token',
-  'authorization',
+  "",
   'password',
   'data', // inline base64 image data
killedBy: redaction of secret/PII-shaped fields blanks each secret-shaped key while preserving non-secret keys
statusReason: expected 'Bearer xyz' to be '[REDACTED]' // Object.is equality

[Killed] StringLiteral
src/audit-log.ts:47:3
   'token',
   'authorization',
   'password',
-  'data', // inline base64 image data
+  "", // inline base64 image data
   'imagedata',
   'bytes',
killedBy: redaction of secret/PII-shaped fields blanks each secret-shaped key while preserving non-secret keys
statusReason: expected 'iVBORw0base64image==' to be '[REDACTED]' // Object.is equality

[Killed] BlockStatement
src/audit-log.ts:61:56
  * policy can be asserted directly — it runs before schema validation, defence-in-depth against a
  * secret reaching storage even if a future schema keeps a free-text field.
  */
-export function redactSecrets(value: unknown): unknown {
-  if (Array.isArray(value)) {
-    return value.map(redactSecrets);
-  }
-  if (value !== null && typeof value === 'object') {
-    const out: Record<string, unknown> = {};
-    for (const [key, v] of Object.entries(value)) {
-      out[key] = REDACT_KEYS.has(key.toLowerCase()) ? REDACTED : redactSecrets(v);
-    }
-    return out;
-  }
-  return value;
-}
+export function redactSecrets(value: unknown): unknown {}
 
 /**
killedBy: immutability and ordering preserves append order across multiple events
statusReason: [
  {
    "code": "invalid_type",
    "expected": "object",
    "received": "undefined",
    "path": [],
    "message": "Required"
  }

[Killed] ConditionalExpression
src/audit-log.ts:62:7
  * secret reaching storage even if a future schema keeps a free-text field.
  */
 export function redactSecrets(value: unknown): unknown {
-  if (Array.isArray(value)) {
+  if (false) {
     return value.map(redactSecrets);
   }
killedBy: array handling is structurally preserved (kills the Array.isArray branch removal) returns a genuine array (not an index-keyed object) for a top-level array input
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/audit-log.ts:62:29
  * secret reaching storage even if a future schema keeps a free-text field.
  */
 export function redactSecrets(value: unknown): unknown {
-  if (Array.isArray(value)) {
-    return value.map(redactSecrets);
-  }
+  if (Array.isArray(value)) {}
   if (value !== null && typeof value === 'object') {
     const out: Record<string, unknown> = {};
killedBy: array handling is structurally preserved (kills the Array.isArray branch removal) returns a genuine array (not an index-keyed object) for a top-level array input
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/audit-log.ts:65:7
   if (Array.isArray(value)) {
     return value.map(redactSecrets);
   }
-  if (value !== null && typeof value === 'object') {
+  if (false) {
     const out: Record<string, unknown> = {};
     for (const [key, v] of Object.entries(value)) {
killedBy: redaction of secret/PII-shaped fields blanks each secret-shaped key while preserving non-secret keys
statusReason: expected 'ak_live_123' to be '[REDACTED]' // Object.is equality

[Killed] EqualityOperator
src/audit-log.ts:65:25
   if (Array.isArray(value)) {
     return value.map(redactSecrets);
   }
-  if (value !== null && typeof value === 'object') {
+  if (value !== null && typeof value !== 'object') {
     const out: Record<string, unknown> = {};
     for (const [key, v] of Object.entries(value)) {
killedBy: redaction of secret/PII-shaped fields blanks each secret-shaped key while preserving non-secret keys
statusReason: expected 'ak_live_123' to be '[REDACTED]' // Object.is equality

[Killed] BlockStatement
src/audit-log.ts:67:51
   }
   if (value !== null && typeof value === 'object') {
     const out: Record<string, unknown> = {};
-    for (const [key, v] of Object.entries(value)) {
-      out[key] = REDACT_KEYS.has(key.toLowerCase()) ? REDACTED : redactSecrets(v);
-    }
+    for (const [key, v] of Object.entries(value)) {}
     return out;
   }
killedBy: every REDACT_KEYS entry is enforced (kills blanked-literal mutants) redacts the "apikey" key
statusReason: expected undefined to be '[REDACTED]' // Object.is equality

[Killed] MethodExpression
src/audit-log.ts:68:34
   if (value !== null && typeof value === 'object') {
     const out: Record<string, unknown> = {};
     for (const [key, v] of Object.entries(value)) {
-      out[key] = REDACT_KEYS.has(key.toLowerCase()) ? REDACTED : redactSecrets(v);
+      out[key] = REDACT_KEYS.has(key.toUpperCase()) ? REDACTED : redactSecrets(v);
     }
     return out;
killedBy: redaction of secret/PII-shaped fields blanks each secret-shaped key while preserving non-secret keys
statusReason: expected 'ak_live_123' to be '[REDACTED]' // Object.is equality

[Killed] BlockStatement
src/audit-log.ts:83:38
 export class InMemoryAuditSink implements AuditSink {
   private readonly events: AuditEvent[] = [];
 
-  append(event: unknown): AuditEvent {
-    // Redact BEFORE validation so secret-shaped fields never reach storage even transiently.
-    const redacted = redactSecrets(event);
-    // fail-closed: a malformed event throws here and is never appended.
-    const validated = parseAuditEvent(redacted);
-    this.events.push(validated);
-    return validated;
-  }
+  append(event: unknown): AuditEvent {}
 
   list(): readonly AuditEvent[] {
killedBy: immutability and ordering preserves append order across multiple events
statusReason: expected [] to deeply equal [ 'a', 'b', 'c' ]

[Killed] BlockStatement
src/audit-log.ts:92:33
     return validated;
   }
 
-  list(): readonly AuditEvent[] {
-    // Defensive copy: callers cannot splice/reorder the recorded trail.
-    return [...this.events];
-  }
+  list(): readonly AuditEvent[] {}
 
   size(): number {
killedBy: immutability and ordering preserves append order across multiple events
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/audit-log.ts:97:18
     return [...this.events];
   }
 
-  size(): number {
-    return this.events.length;
-  }
+  size(): number {}
 }
 
killedBy: immutability and ordering preserves append order across multiple events
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
src/audit-log.ts:107:73
  * applies so callers can pre-check an event. Re-exports schema use so the redaction policy and the
  * schema stay co-located.
  */
-export function redactAndValidateAuditEvent(event: unknown): AuditEvent {
-  return AuditEventSchema.parse(redactSecrets(event));
-}
+export function redactAndValidateAuditEvent(event: unknown): AuditEvent {}
 
killedBy: redaction of secret/PII-shaped fields redacts before schema validation in redactAndValidateAuditEvent
statusReason: Cannot read properties of undefined (reading 'eventId')
