[Killed] LogicalOperator
src/image-dimensions.ts:25:5
 export function sniffFormat(buf: Uint8Array): SniffedFormat | null {
   // PNG: 89 50 4E 47 0D 0A 1A 0A
   if (
-    buf.length >= 8 &&
-    buf[0] === 0x89 &&
-    buf[1] === 0x50 &&
-    buf[2] === 0x4e &&
+    buf.length >= 8 && buf[0] === 0x89 && buf[1] === 0x50 || buf[2] === 0x4e &&
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 0 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:25:5
 export function sniffFormat(buf: Uint8Array): SniffedFormat | null {
   // PNG: 89 50 4E 47 0D 0A 1A 0A
   if (
-    buf.length >= 8 &&
-    buf[0] === 0x89 &&
-    buf[1] === 0x50 &&
-    buf[2] === 0x4e &&
-    buf[3] === 0x47 &&
-    buf[4] === 0x0d &&
-    buf[5] === 0x0a &&
-    buf[6] === 0x1a &&
-    buf[7] === 0x0a
+    false
   ) {
     return 'image/png';
killedBy: sniffFormat identifies each real format from its magic bytes
statusReason: expected null to be 'image/png' // Object.is equality

[Killed] ConditionalExpression
src/image-dimensions.ts:26:5
   // PNG: 89 50 4E 47 0D 0A 1A 0A
   if (
     buf.length >= 8 &&
-    buf[0] === 0x89 &&
+    true &&
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 0 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:26:5
   // PNG: 89 50 4E 47 0D 0A 1A 0A
   if (
     buf.length >= 8 &&
-    buf[0] === 0x89 &&
+    buf[0] !== 0x89 &&
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 0 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:27:5
   if (
     buf.length >= 8 &&
     buf[0] === 0x89 &&
-    buf[1] === 0x50 &&
+    buf[1] !== 0x50 &&
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 1 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:27:5
   if (
     buf.length >= 8 &&
     buf[0] === 0x89 &&
-    buf[1] === 0x50 &&
+    true &&
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 1 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:28:5
     buf.length >= 8 &&
     buf[0] === 0x89 &&
     buf[1] === 0x50 &&
-    buf[2] === 0x4e &&
+    buf[2] !== 0x4e &&
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 2 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:28:5
     buf.length >= 8 &&
     buf[0] === 0x89 &&
     buf[1] === 0x50 &&
-    buf[2] === 0x4e &&
+    true &&
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 2 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:29:5
     buf[0] === 0x89 &&
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
-    buf[3] === 0x47 &&
+    true &&
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 3 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:29:5
     buf[0] === 0x89 &&
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
-    buf[3] === 0x47 &&
+    buf[3] !== 0x47 &&
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 3 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:30:5
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
-    buf[4] === 0x0d &&
+    true &&
     buf[5] === 0x0a &&
     buf[6] === 0x1a &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 4 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:30:5
     buf[1] === 0x50 &&
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
-    buf[4] === 0x0d &&
+    buf[4] !== 0x0d &&
     buf[5] === 0x0a &&
     buf[6] === 0x1a &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 4 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:31:5
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
-    buf[5] === 0x0a &&
+    buf[5] !== 0x0a &&
     buf[6] === 0x1a &&
     buf[7] === 0x0a
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 5 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:31:5
     buf[2] === 0x4e &&
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
-    buf[5] === 0x0a &&
+    true &&
     buf[6] === 0x1a &&
     buf[7] === 0x0a
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 5 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:32:5
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
-    buf[6] === 0x1a &&
+    buf[6] !== 0x1a &&
     buf[7] === 0x0a
   ) {
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 6 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:32:5
     buf[3] === 0x47 &&
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
-    buf[6] === 0x1a &&
+    true &&
     buf[7] === 0x0a
   ) {
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 6 corrupted
statusReason: expected 'image/png' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:33:5
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
     buf[6] === 0x1a &&
-    buf[7] === 0x0a
+    true
   ) {
     return 'image/png';
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 7 corrupted
statusReason: expected 'image/png' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:33:5
     buf[4] === 0x0d &&
     buf[5] === 0x0a &&
     buf[6] === 0x1a &&
-    buf[7] === 0x0a
+    buf[7] !== 0x0a
   ) {
     return 'image/png';
killedBy: sniffFormat — every magic byte is load-bearing rejects a PNG with signature byte 7 corrupted
statusReason: expected 'image/png' to be null

[Killed] BlockStatement
src/image-dimensions.ts:34:5
     buf[5] === 0x0a &&
     buf[6] === 0x1a &&
     buf[7] === 0x0a
-  ) {
-    return 'image/png';
-  }
+  ) {}
   // JPEG: starts FF D8 FF
   if (buf.length >= 3 && buf[0] === 0xff && buf[1] === 0xd8 && buf[2] === 0xff) {
killedBy: sniffFormat — length boundary is exact (kills >= -> > and EqualityOperator) accepts a PNG signature at exactly the 8-byte minimum
statusReason: expected null to be 'image/png' // Object.is equality

[Killed] StringLiteral
src/image-dimensions.ts:35:12
     buf[6] === 0x1a &&
     buf[7] === 0x0a
   ) {
-    return 'image/png';
+    return "";
   }
   // JPEG: starts FF D8 FF
killedBy: sniffFormat — length boundary is exact (kills >= -> > and EqualityOperator) accepts a PNG signature at exactly the 8-byte minimum
statusReason: expected '' to be 'image/png' // Object.is equality

[Killed] ConditionalExpression
src/image-dimensions.ts:38:64
     return 'image/png';
   }
   // JPEG: starts FF D8 FF
-  if (buf.length >= 3 && buf[0] === 0xff && buf[1] === 0xd8 && buf[2] === 0xff) {
+  if (buf.length >= 3 && buf[0] === 0xff && buf[1] === 0xd8 && true) {
     return 'image/jpeg';
   }
killedBy: sniffFormat — every magic byte is load-bearing rejects a JPEG with signature byte 2 corrupted
statusReason: expected 'image/jpeg' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:38:45
     return 'image/png';
   }
   // JPEG: starts FF D8 FF
-  if (buf.length >= 3 && buf[0] === 0xff && buf[1] === 0xd8 && buf[2] === 0xff) {
+  if (buf.length >= 3 && buf[0] === 0xff && buf[1] !== 0xd8 && buf[2] === 0xff) {
     return 'image/jpeg';
   }
killedBy: sniffFormat — every magic byte is load-bearing rejects a JPEG with signature byte 1 corrupted
statusReason: expected 'image/jpeg' to be null

[Killed] LogicalOperator
src/image-dimensions.ts:43:5
   }
   // WebP: "RIFF" .... "WEBP"
   if (
-    buf.length >= 12 &&
-    buf[0] === 0x52 &&
-    buf[1] === 0x49 &&
-    buf[2] === 0x46 &&
-    buf[3] === 0x46 &&
+    buf.length >= 12 && buf[0] === 0x52 && buf[1] === 0x49 && buf[2] === 0x46 || buf[3] === 0x46 &&
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 0 corrupted
statusReason: expected 'image/webp' to be null

[Killed] LogicalOperator
src/image-dimensions.ts:43:5
   }
   // WebP: "RIFF" .... "WEBP"
   if (
-    buf.length >= 12 &&
-    buf[0] === 0x52 &&
-    buf[1] === 0x49 &&
+    buf.length >= 12 && buf[0] === 0x52 || buf[1] === 0x49 &&
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 0 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:44:5
   // WebP: "RIFF" .... "WEBP"
   if (
     buf.length >= 12 &&
-    buf[0] === 0x52 &&
+    true &&
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 0 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:44:5
   // WebP: "RIFF" .... "WEBP"
   if (
     buf.length >= 12 &&
-    buf[0] === 0x52 &&
+    buf[0] !== 0x52 &&
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 0 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:45:5
   if (
     buf.length >= 12 &&
     buf[0] === 0x52 &&
-    buf[1] === 0x49 &&
+    true &&
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 1 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:45:5
   if (
     buf.length >= 12 &&
     buf[0] === 0x52 &&
-    buf[1] === 0x49 &&
+    buf[1] !== 0x49 &&
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 1 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:46:5
     buf.length >= 12 &&
     buf[0] === 0x52 &&
     buf[1] === 0x49 &&
-    buf[2] === 0x46 &&
+    true &&
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 2 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:46:5
     buf.length >= 12 &&
     buf[0] === 0x52 &&
     buf[1] === 0x49 &&
-    buf[2] === 0x46 &&
+    buf[2] !== 0x46 &&
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 2 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:47:5
     buf[0] === 0x52 &&
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
-    buf[3] === 0x46 &&
+    true &&
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 3 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:47:5
     buf[0] === 0x52 &&
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
-    buf[3] === 0x46 &&
+    buf[3] !== 0x46 &&
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 3 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:48:5
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
-    buf[8] === 0x57 &&
+    true &&
     buf[9] === 0x45 &&
     buf[10] === 0x42 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 8 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:48:5
     buf[1] === 0x49 &&
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
-    buf[8] === 0x57 &&
+    buf[8] !== 0x57 &&
     buf[9] === 0x45 &&
     buf[10] === 0x42 &&
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 8 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:49:5
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
-    buf[9] === 0x45 &&
+    buf[9] !== 0x45 &&
     buf[10] === 0x42 &&
     buf[11] === 0x50
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 9 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:49:5
     buf[2] === 0x46 &&
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
-    buf[9] === 0x45 &&
+    true &&
     buf[10] === 0x42 &&
     buf[11] === 0x50
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 9 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:50:5
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
-    buf[10] === 0x42 &&
+    true &&
     buf[11] === 0x50
   ) {
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 10 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:50:5
     buf[3] === 0x46 &&
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
-    buf[10] === 0x42 &&
+    buf[10] !== 0x42 &&
     buf[11] === 0x50
   ) {
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 10 corrupted
statusReason: expected 'image/webp' to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:51:5
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
     buf[10] === 0x42 &&
-    buf[11] === 0x50
+    true
   ) {
     return 'image/webp';
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 11 corrupted
statusReason: expected 'image/webp' to be null

[Killed] EqualityOperator
src/image-dimensions.ts:51:5
     buf[8] === 0x57 &&
     buf[9] === 0x45 &&
     buf[10] === 0x42 &&
-    buf[11] === 0x50
+    buf[11] !== 0x50
   ) {
     return 'image/webp';
killedBy: sniffFormat — every magic byte is load-bearing rejects a WebP with signature byte 11 corrupted
statusReason: expected 'image/webp' to be null

[Killed] BlockStatement
src/image-dimensions.ts:52:5
     buf[9] === 0x45 &&
     buf[10] === 0x42 &&
     buf[11] === 0x50
-  ) {
-    return 'image/webp';
-  }
+  ) {}
   return null;
 }
killedBy: sniffFormat — length boundary is exact (kills >= -> > and EqualityOperator) accepts a WebP signature at exactly 12 bytes and rejects at 11
statusReason: expected null to be 'image/webp' // Object.is equality

[Killed] BlockStatement
src/image-dimensions.ts:59:65
 }
 
 /** Read a big-endian uint16 at offset, or `null` if out of bounds. */
-function readU16BE(buf: Uint8Array, off: number): number | null {
-  if (off + 1 >= buf.length) return null;
-  return (buf[off]! << 8) | buf[off + 1]!;
-}
+function readU16BE(buf: Uint8Array, off: number): number | null {}
 
 /** Read a big-endian uint32 at offset, or `null` if out of bounds. */
killedBy: JPEG dimension parsing — marker walk boundaries rejects a JPEG whose declared segment length is exactly 1 (< 2 guard)
statusReason: expected { width: undefined, height: undefined } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:60:7
 
 /** Read a big-endian uint16 at offset, or `null` if out of bounds. */
 function readU16BE(buf: Uint8Array, off: number): number | null {
-  if (off + 1 >= buf.length) return null;
+  if (true) return null;
   return (buf[off]! << 8) | buf[off + 1]!;
 }
killedBy: JPEG dimension parsing — marker walk boundaries treats a marker just past the RST range (0xD8) as standalone, not a length segment
statusReason: expected null to deeply equal { width: 60, height: 50 }

[Killed] EqualityOperator
src/image-dimensions.ts:60:7
 
 /** Read a big-endian uint16 at offset, or `null` if out of bounds. */
 function readU16BE(buf: Uint8Array, off: number): number | null {
-  if (off + 1 >= buf.length) return null;
+  if (off + 1 < buf.length) return null;
   return (buf[off]! << 8) | buf[off + 1]!;
 }
killedBy: JPEG dimension parsing — marker walk boundaries treats a marker just past the RST range (0xD8) as standalone, not a length segment
statusReason: expected null to deeply equal { width: 60, height: 50 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:61:33
 /** Read a big-endian uint16 at offset, or `null` if out of bounds. */
 function readU16BE(buf: Uint8Array, off: number): number | null {
   if (off + 1 >= buf.length) return null;
-  return (buf[off]! << 8) | buf[off + 1]!;
+  return (buf[off]! << 8) | buf[off - 1]!;
 }
 
killedBy: JPEG dimension parsing — marker walk boundaries rejects a JPEG whose declared segment length is exactly 1 (< 2 guard)
statusReason: expected { width: 10, height: 8 } to be null

[Killed] BlockStatement
src/image-dimensions.ts:65:65
 }
 
 /** Read a big-endian uint32 at offset, or `null` if out of bounds. */
-function readU32BE(buf: Uint8Array, off: number): number | null {
-  if (off + 3 >= buf.length) return null;
-  return (
-    (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
-    (buf[off + 2]! << 8) |
-    buf[off + 3]!
-  ) >>> 0;
-}
+function readU32BE(buf: Uint8Array, off: number): number | null {}
 
 /** PNG dimensions live in the IHDR chunk: width @16, height @20 (big-endian uint32). */
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected { width: undefined, height: undefined } to deeply equal { width: 16909060, height: 7 }

[Killed] ConditionalExpression
src/image-dimensions.ts:66:7
 
 /** Read a big-endian uint32 at offset, or `null` if out of bounds. */
 function readU32BE(buf: Uint8Array, off: number): number | null {
-  if (off + 3 >= buf.length) return null;
+  if (true) return null;
   return (
     (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected null to deeply equal { width: 16909060, height: 7 }

[Killed] EqualityOperator
src/image-dimensions.ts:66:7
 
 /** Read a big-endian uint32 at offset, or `null` if out of bounds. */
 function readU32BE(buf: Uint8Array, off: number): number | null {
-  if (off + 3 >= buf.length) return null;
+  if (off + 3 < buf.length) return null;
   return (
     (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected null to deeply equal { width: 16909060, height: 7 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:68:35
 function readU32BE(buf: Uint8Array, off: number): number | null {
   if (off + 3 >= buf.length) return null;
   return (
-    (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
+    (buf[off]! * 0x1000000 + (buf[off - 1]! << 16)) |
     (buf[off + 2]! << 8) |
     buf[off + 3]!
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected { width: 5374592, height: 8389088 } to deeply equal { width: 640, height: 480 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:68:6
 function readU32BE(buf: Uint8Array, off: number): number | null {
   if (off + 3 >= buf.length) return null;
   return (
-    (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
+    (buf[off]! * 0x1000000 - (buf[off + 1]! << 16)) |
     (buf[off + 2]! << 8) |
     buf[off + 3]!
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected { width: 16646916, height: 7 } to deeply equal { width: 16909060, height: 7 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:69:10
   if (off + 3 >= buf.length) return null;
   return (
     (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
-    (buf[off + 2]! << 8) |
+    (buf[off - 2]! << 8) |
     buf[off + 3]!
   ) >>> 0;
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected { width: 17536, height: 736 } to deeply equal { width: 640, height: 480 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:70:9
   return (
     (buf[off]! * 0x1000000 + (buf[off + 1]! << 16)) |
     (buf[off + 2]! << 8) |
-    buf[off + 3]!
+    buf[off - 3]!
   ) >>> 0;
 }
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected { width: 16909128, height: 2 } to deeply equal { width: 16909060, height: 7 }

[Killed] BlockStatement
src/image-dimensions.ts:75:70
 }
 
 /** PNG dimensions live in the IHDR chunk: width @16, height @20 (big-endian uint32). */
-function parsePngDimensions(buf: Uint8Array): ImageDimensions | null {
-  // The first chunk after the 8-byte signature must be IHDR ("IHDR" @12).
-  if (buf.length < 24) return null;
-  if (
-    buf[12] !== 0x49 ||
-    buf[13] !== 0x48 ||
-    buf[14] !== 0x44 ||
-    buf[15] !== 0x52
-  ) {
-    return null; // fail-closed: not a well-formed PNG header
-  }
-  const width = readU32BE(buf, 16);
-  const height = readU32BE(buf, 20);
-  if (width === null || height === null || width === 0 || height === 0) return null;
-  return { width, height };
-}
+function parsePngDimensions(buf: Uint8Array): ImageDimensions | null {}
 
 /** Markers that carry frame dimensions. SOF0..SOF15 excluding the non-SOF DHT/JPG/DAC slots. */
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected undefined to deeply equal { width: 640, height: 480 }

[Killed] EqualityOperator
src/image-dimensions.ts:77:7
 /** PNG dimensions live in the IHDR chunk: width @16, height @20 (big-endian uint32). */
 function parsePngDimensions(buf: Uint8Array): ImageDimensions | null {
   // The first chunk after the 8-byte signature must be IHDR ("IHDR" @12).
-  if (buf.length < 24) return null;
+  if (buf.length >= 24) return null;
   if (
     buf[12] !== 0x49 ||
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected null to deeply equal { width: 16909060, height: 7 }

[Killed] ConditionalExpression
src/image-dimensions.ts:77:7
 /** PNG dimensions live in the IHDR chunk: width @16, height @20 (big-endian uint32). */
 function parsePngDimensions(buf: Uint8Array): ImageDimensions | null {
   // The first chunk after the 8-byte signature must be IHDR ("IHDR" @12).
-  if (buf.length < 24) return null;
+  if (true) return null;
   if (
     buf[12] !== 0x49 ||
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) decodes a width above 0xFFFFFF so the *0x1000000 term is required
statusReason: expected null to deeply equal { width: 16909060, height: 7 }

[Killed] LogicalOperator
src/image-dimensions.ts:79:5
   // The first chunk after the 8-byte signature must be IHDR ("IHDR" @12).
   if (buf.length < 24) return null;
   if (
-    buf[12] !== 0x49 ||
-    buf[13] !== 0x48 ||
+    buf[12] !== 0x49 && buf[13] !== 0x48 ||
     buf[14] !== 0x44 ||
     buf[15] !== 0x52
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) rejects each individual IHDR tag byte being corrupted
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:79:5
   // The first chunk after the 8-byte signature must be IHDR ("IHDR" @12).
   if (buf.length < 24) return null;
   if (
-    buf[12] !== 0x49 ||
-    buf[13] !== 0x48 ||
-    buf[14] !== 0x44 ||
-    buf[15] !== 0x52
+    false
   ) {
     return null; // fail-closed: not a well-formed PNG header
killedBy: parseDimensions fail-closed rejects a PNG whose first chunk is not IHDR
statusReason: expected { width: 10, height: 10 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:80:5
   if (buf.length < 24) return null;
   if (
     buf[12] !== 0x49 ||
-    buf[13] !== 0x48 ||
+    buf[13] === 0x48 ||
     buf[14] !== 0x44 ||
     buf[15] !== 0x52
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected null to deeply equal { width: 640, height: 480 }

[Killed] ConditionalExpression
src/image-dimensions.ts:80:5
   if (buf.length < 24) return null;
   if (
     buf[12] !== 0x49 ||
-    buf[13] !== 0x48 ||
+    false ||
     buf[14] !== 0x44 ||
     buf[15] !== 0x52
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) rejects each individual IHDR tag byte being corrupted
statusReason: expected { width: 10, height: 10 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:81:5
   if (
     buf[12] !== 0x49 ||
     buf[13] !== 0x48 ||
-    buf[14] !== 0x44 ||
+    buf[14] === 0x44 ||
     buf[15] !== 0x52
   ) {
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected null to deeply equal { width: 640, height: 480 }

[Killed] ConditionalExpression
src/image-dimensions.ts:81:5
   if (
     buf[12] !== 0x49 ||
     buf[13] !== 0x48 ||
-    buf[14] !== 0x44 ||
+    false ||
     buf[15] !== 0x52
   ) {
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) rejects each individual IHDR tag byte being corrupted
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:82:5
     buf[12] !== 0x49 ||
     buf[13] !== 0x48 ||
     buf[14] !== 0x44 ||
-    buf[15] !== 0x52
+    false
   ) {
     return null; // fail-closed: not a well-formed PNG header
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) rejects each individual IHDR tag byte being corrupted
statusReason: expected { width: 10, height: 10 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:82:5
     buf[12] !== 0x49 ||
     buf[13] !== 0x48 ||
     buf[14] !== 0x44 ||
-    buf[15] !== 0x52
+    buf[15] === 0x52
   ) {
     return null; // fail-closed: not a well-formed PNG header
killedBy: parseDimensions round-trip recovers exact PNG dimensions
statusReason: expected null to deeply equal { width: 640, height: 480 }

[Killed] BlockStatement
src/image-dimensions.ts:83:5
     buf[13] !== 0x48 ||
     buf[14] !== 0x44 ||
     buf[15] !== 0x52
-  ) {
-    return null; // fail-closed: not a well-formed PNG header
-  }
+  ) {}
   const width = readU32BE(buf, 16);
   const height = readU32BE(buf, 20);
killedBy: parseDimensions fail-closed rejects a PNG whose first chunk is not IHDR
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:88:7
   }
   const width = readU32BE(buf, 16);
   const height = readU32BE(buf, 20);
-  if (width === null || height === null || width === 0 || height === 0) return null;
+  if (false) return null;
   return { width, height };
 }
killedBy: parseDimensions fail-closed rejects a zero-dimension PNG
statusReason: expected { width: +0, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:88:7
   }
   const width = readU32BE(buf, 16);
   const height = readU32BE(buf, 20);
-  if (width === null || height === null || width === 0 || height === 0) return null;
+  if (false || height === 0) return null;
   return { width, height };
 }
killedBy: PNG dimension parsing — exact arithmetic and bounds (kills readU32BE mutants) rejects a zero width but accepts width 1 (boundary of the === 0 guard)
statusReason: expected { width: +0, height: 5 } to be null
