[Killed] BlockStatement
src/providers/fal.ts:65:53
 }
 
 /** Resolve the person and garment image inputs from a request. */
-function mapInput(req: TryOnRequest): FalTryOnInput {
-  const human = imageRefToInput(req.personImage);
-  // A request may carry an explicit garment image; otherwise the product id is the garment ref.
-  const garmentRef = req.params?.garmentImage;
-  const garment = garmentRef ? imageRefToInput(garmentRef) : `product:${req.productId}`;
-  const input: FalTryOnInput = {
-    human_image_url: human,
-    garment_image_url: garment,
-    num_samples: req.params?.numSamples ?? 1,
-  };
-  // exactOptionalPropertyTypes: only attach `seed` when actually provided.
-  return req.params?.seed === undefined ? input : { ...input, seed: req.params.seed };
-}
+function mapInput(req: TryOnRequest): FalTryOnInput {}
 
 /** Extract the first usable https image URL from a fal output, or fail closed. */
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected undefined to deeply equal { …(4) }

[Killed] OptionalChaining
src/providers/fal.ts:68:22
 function mapInput(req: TryOnRequest): FalTryOnInput {
   const human = imageRefToInput(req.personImage);
   // A request may carry an explicit garment image; otherwise the product id is the garment ref.
-  const garmentRef = req.params?.garmentImage;
+  const garmentRef = req.params.garmentImage;
   const garment = garmentRef ? imageRefToInput(garmentRef) : `product:${req.productId}`;
   const input: FalTryOnInput = {
killedBy: FalProvider defaults num_samples to 1 and resolves garment from productId when none supplied
statusReason: Cannot read properties of undefined (reading 'garmentImage')

[Killed] OptionalChaining
src/providers/fal.ts:73:18
   const input: FalTryOnInput = {
     human_image_url: human,
     garment_image_url: garment,
-    num_samples: req.params?.numSamples ?? 1,
+    num_samples: req.params.numSamples ?? 1,
   };
   // exactOptionalPropertyTypes: only attach `seed` when actually provided.
killedBy: FalProvider defaults num_samples to 1 and resolves garment from productId when none supplied
statusReason: Cannot read properties of undefined (reading 'numSamples')

[Killed] LogicalOperator
src/providers/fal.ts:73:18
   const input: FalTryOnInput = {
     human_image_url: human,
     garment_image_url: garment,
-    num_samples: req.params?.numSamples ?? 1,
+    num_samples: req.params?.numSamples && 1,
   };
   // exactOptionalPropertyTypes: only attach `seed` when actually provided.
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] ConditionalExpression
src/providers/fal.ts:76:10
     num_samples: req.params?.numSamples ?? 1,
   };
   // exactOptionalPropertyTypes: only attach `seed` when actually provided.
-  return req.params?.seed === undefined ? input : { ...input, seed: req.params.seed };
+  return false ? input : { ...input, seed: req.params.seed };
 }
 
killedBy: FalProvider defaults num_samples to 1 and resolves garment from productId when none supplied
statusReason: Cannot read properties of undefined (reading 'seed')

[Killed] EqualityOperator
src/providers/fal.ts:76:10
     num_samples: req.params?.numSamples ?? 1,
   };
   // exactOptionalPropertyTypes: only attach `seed` when actually provided.
-  return req.params?.seed === undefined ? input : { ...input, seed: req.params.seed };
+  return req.params?.seed !== undefined ? input : { ...input, seed: req.params.seed };
 }
 
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected { …(3) } to deeply equal { …(4) }

[Killed] BlockStatement
src/providers/fal.ts:80:55
 }
 
 /** Extract the first usable https image URL from a fal output, or fail closed. */
-function extractImageUrl(out: FalTryOnOutput): string {
-  const single = out.image?.url;
-  if (typeof single === 'string' && single.length > 0) {
-    return single;
-  }
-  const first = out.images?.[0]?.url;
-  if (typeof first === 'string' && first.length > 0) {
-    return first;
-  }
-  // fail-closed: no image in the upstream payload is an error, not an empty success.
-  throw new Error('fal: response contained no image url');
-}
+function extractImageUrl(out: FalTryOnOutput): string {}
 
 export class FalProvider implements TryOnProvider {
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: fal: malformed provider result — [
  {
    "code": "invalid_type",
    "expected": "string",
    "received": "undefined",
    "path": [
      "resultImageUrl"
    ],

[Killed] OptionalChaining
src/providers/fal.ts:81:18
 
 /** Extract the first usable https image URL from a fal output, or fail closed. */
 function extractImageUrl(out: FalTryOnOutput): string {
-  const single = out.image?.url;
+  const single = out.image.url;
   if (typeof single === 'string' && single.length > 0) {
     return single;
killedBy: FalProvider reads the first url from an images[] array output
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ConditionalExpression
src/providers/fal.ts:82:7
 /** Extract the first usable https image URL from a fal output, or fail closed. */
 function extractImageUrl(out: FalTryOnOutput): string {
   const single = out.image?.url;
-  if (typeof single === 'string' && single.length > 0) {
+  if (false) {
     return single;
   }
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: fal: response contained no image url

[Killed] BlockStatement
src/providers/fal.ts:82:56
 /** Extract the first usable https image URL from a fal output, or fail closed. */
 function extractImageUrl(out: FalTryOnOutput): string {
   const single = out.image?.url;
-  if (typeof single === 'string' && single.length > 0) {
-    return single;
-  }
+  if (typeof single === 'string' && single.length > 0) {}
   const first = out.images?.[0]?.url;
   if (typeof first === 'string' && first.length > 0) {
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: fal: response contained no image url

[Killed] OptionalChaining
src/providers/fal.ts:85:17
   if (typeof single === 'string' && single.length > 0) {
     return single;
   }
-  const first = out.images?.[0]?.url;
+  const first = out.images[0]?.url;
   if (typeof first === 'string' && first.length > 0) {
     return first;
killedBy: FalProvider fails closed when the output carries no image url
statusReason: expected [Function] to throw error matching /no image url/ but got 'Cannot read properties of undefined (…'

[Survived] OptionalChaining
src/providers/fal.ts:85:17
   if (typeof single === 'string' && single.length > 0) {
     return single;
   }
-  const first = out.images?.[0]?.url;
+  const first = out.images?.[0].url;
   if (typeof first === 'string' && first.length > 0) {
     return first;

[Killed] ConditionalExpression
src/providers/fal.ts:86:7
     return single;
   }
   const first = out.images?.[0]?.url;
-  if (typeof first === 'string' && first.length > 0) {
+  if (true) {
     return first;
   }
killedBy: FalProvider fails closed when the output carries no image url
statusReason: expected [Function] to throw error matching /no image url/ but got 'fal: malformed provider result — [\n …'

[Killed] ConditionalExpression
src/providers/fal.ts:86:7
     return single;
   }
   const first = out.images?.[0]?.url;
-  if (typeof first === 'string' && first.length > 0) {
+  if (true && first.length > 0) {
     return first;
   }
killedBy: FalProvider fails closed when the output carries no image url
statusReason: expected [Function] to throw error matching /no image url/ but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/providers/fal.ts:100:56
   private readonly costPerCallUsd: number;
   private readonly endpoint: string;
 
-  public constructor(options: FalProviderOptions = {}) {
-    this.runner = options.runner;
-    this.runnerFactory = options.runnerFactory ?? defaultFalRunnerFactory;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
-    this.endpoint = options.endpoint ?? FAL_TRYON_ENDPOINT;
-  }
+  public constructor(options: FalProviderOptions = {}) {}
 
   /** Lazily resolve the runner; building the real client fails closed without FAL_KEY. */
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: this.runnerFactory is not a function

[Killed] LogicalOperator
src/providers/fal.ts:102:26
 
   public constructor(options: FalProviderOptions = {}) {
     this.runner = options.runner;
-    this.runnerFactory = options.runnerFactory ?? defaultFalRunnerFactory;
+    this.runnerFactory = options.runnerFactory && defaultFalRunnerFactory;
     this.costPerCallUsd = options.costPerCallUsd ?? 0;
     this.endpoint = options.endpoint ?? FAL_TRYON_ENDPOINT;
killedBy: FalProvider lazily builds the runner via the injected factory exactly once
statusReason: fal: FAL_KEY is not configured

[Killed] LogicalOperator
src/providers/fal.ts:103:27
   public constructor(options: FalProviderOptions = {}) {
     this.runner = options.runner;
     this.runnerFactory = options.runnerFactory ?? defaultFalRunnerFactory;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
+    this.costPerCallUsd = options.costPerCallUsd && 0;
     this.endpoint = options.endpoint ?? FAL_TRYON_ENDPOINT;
   }
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected +0 to be 0.05 // Object.is equality

[Killed] LogicalOperator
src/providers/fal.ts:104:21
     this.runner = options.runner;
     this.runnerFactory = options.runnerFactory ?? defaultFalRunnerFactory;
     this.costPerCallUsd = options.costPerCallUsd ?? 0;
-    this.endpoint = options.endpoint ?? FAL_TRYON_ENDPOINT;
+    this.endpoint = options.endpoint && FAL_TRYON_ENDPOINT;
   }
 
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected undefined to be 'fal-ai/cat-vton' // Object.is equality

[Killed] BlockStatement
src/providers/fal.ts:108:38
   }
 
   /** Lazily resolve the runner; building the real client fails closed without FAL_KEY. */
-  private resolveRunner(): FalRunner {
-    if (this.runner) {
-      return this.runner;
-    }
-    this.runner = this.runnerFactory();
-    return this.runner;
-  }
+  private resolveRunner(): FalRunner {}
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] ConditionalExpression
src/providers/fal.ts:109:9
 
   /** Lazily resolve the runner; building the real client fails closed without FAL_KEY. */
   private resolveRunner(): FalRunner {
-    if (this.runner) {
+    if (false) {
       return this.runner;
     }
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: fal: FAL_KEY is not configured

[Killed] ConditionalExpression
src/providers/fal.ts:109:9
 
   /** Lazily resolve the runner; building the real client fails closed without FAL_KEY. */
   private resolveRunner(): FalRunner {
-    if (this.runner) {
+    if (true) {
       return this.runner;
     }
killedBy: FalProvider lazily builds the runner via the injected factory exactly once
statusReason: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/providers/fal.ts:116:85
     return this.runner;
   }
 
-  public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
-    const input = mapInput(req);
-    const runner = this.resolveRunner();
-    ctx.logger.debug('fal.tryOn', { endpoint: this.endpoint, tenantId: req.tenantId });
-    const result = await runner.subscribe(this.endpoint, {
-      input,
-      abortSignal: ctx.signal,
-    });
-    const url = extractImageUrl(result.data);
-    // Re-validate the mapped result against the contract (https-only url, non-negative cost).
-    return validateProviderResult(
-      {
-        resultImageUrl: url,
-        provider: this.id,
-        latencyMs: 0,
-        cached: false,
-        costUsd: this.costPerCallUsd,
-      },
-      'fal',
-    );
-  }
+  public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {}
 }
 
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected undefined to be 'fal-ai/cat-vton' // Object.is equality

[Survived] BooleanLiteral
src/providers/fal.ts:131:17
         resultImageUrl: url,
         provider: this.id,
         latencyMs: 0,
-        cached: false,
+        cached: true,
         costUsd: this.costPerCallUsd,
       },

[Survived] StringLiteral
src/providers/fal.ts:134:7
         cached: false,
         costUsd: this.costPerCallUsd,
       },
-      'fal',
+      "",
     );
   }

[Killed] BlockStatement
src/providers/fal.ts:145:54
  * fail-closed: with no credential we refuse rather than issuing an unauthenticated request.
  * Kept out of the hot path and isolated so unit tests (which inject a runner) never load it.
  */
-export function defaultFalRunnerFactory(): FalRunner {
-  const key = process.env['FAL_KEY'];
-  if (!key || key.length === 0) {
-    throw new Error('fal: FAL_KEY is not configured');
-  }
-  // Lazy require keeps @fal-ai/client (CommonJS) off the unit-test path entirely; tests inject
-  // a fake runner and never reach this branch. createRequire is the ESM-safe way to load it.
-  const require = createRequire(import.meta.url);
-  const mod = require('@fal-ai/client') as {
-    createFalClient: (cfg: { credentials: string }) => FalRunner;
-  };
-  return mod.createFalClient({ credentials: key });
-}
+export function defaultFalRunnerFactory(): FalRunner {}
 
killedBy: FalProvider default runner factory fails closed when FAL_KEY is absent
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/providers/fal.ts:147:7
  */
 export function defaultFalRunnerFactory(): FalRunner {
   const key = process.env['FAL_KEY'];
-  if (!key || key.length === 0) {
+  if (key || key.length === 0) {
     throw new Error('fal: FAL_KEY is not configured');
   }
killedBy: FalProvider default runner factory fails closed when FAL_KEY is absent
statusReason: expected [Function] to throw error matching /FAL_KEY is not configured/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/providers/fal.ts:147:7
  */
 export function defaultFalRunnerFactory(): FalRunner {
   const key = process.env['FAL_KEY'];
-  if (!key || key.length === 0) {
+  if (false) {
     throw new Error('fal: FAL_KEY is not configured');
   }
killedBy: FalProvider default runner factory fails closed when FAL_KEY is absent
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/providers/fal.ts:148:21
 export function defaultFalRunnerFactory(): FalRunner {
   const key = process.env['FAL_KEY'];
   if (!key || key.length === 0) {
-    throw new Error('fal: FAL_KEY is not configured');
+    throw new Error("");
   }
   // Lazy require keeps @fal-ai/client (CommonJS) off the unit-test path entirely; tests inject
killedBy: FalProvider default runner factory fails closed when FAL_KEY is absent
statusReason: expected [Function] to throw error matching /FAL_KEY is not configured/ but got ''
