[Killed] BlockStatement
src/image-dimensions.ts:98:71
 ]);
 
 /** JPEG: walk marker segments until a Start-Of-Frame, then read height @5, width @7. */
-function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {
-  let off = 2; // skip SOI (FF D8)
-  while (off + 1 < buf.length) {
-    if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
-    const marker = buf[off + 1]!;
-    // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
-    if (marker === 0xd8 || marker === 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
-      off += 2;
-      continue;
-    }
-    const segLen = readU16BE(buf, off + 2);
-    if (segLen === null || segLen < 2) return null; // fail-closed on bad length
-    if (SOF_MARKERS.has(marker)) {
-      const height = readU16BE(buf, off + 5);
-      const width = readU16BE(buf, off + 7);
-      if (width === null || height === null || width === 0 || height === 0) return null;
-      return { width, height };
-    }
-    off += 2 + segLen; // advance past this segment
-  }
-  return null; // no SOF found
-}
+function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {}
 
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
killedBy: parseDimensions round-trip recovers exact JPEG dimensions
statusReason: expected undefined to deeply equal { width: 800, height: 600 }

[Killed] ConditionalExpression
src/image-dimensions.ts:100:10
 /** JPEG: walk marker segments until a Start-Of-Frame, then read height @5, width @7. */
 function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {
   let off = 2; // skip SOI (FF D8)
-  while (off + 1 < buf.length) {
+  while (false) {
     if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
killedBy: JPEG dimension parsing — marker walk boundaries treats a marker just past the RST range (0xD8) as standalone, not a length segment
statusReason: expected null to deeply equal { width: 60, height: 50 }

[Killed] EqualityOperator
src/image-dimensions.ts:100:10
 /** JPEG: walk marker segments until a Start-Of-Frame, then read height @5, width @7. */
 function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {
   let off = 2; // skip SOI (FF D8)
-  while (off + 1 < buf.length) {
+  while (off + 1 >= buf.length) {
     if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { Object (ok, format, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/image-dimensions.ts:101:9
 function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {
   let off = 2; // skip SOI (FF D8)
   while (off + 1 < buf.length) {
-    if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
+    if (true) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { Object (ok, format, ...) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/image-dimensions.ts:101:9
 function parseJpegDimensions(buf: Uint8Array): ImageDimensions | null {
   let off = 2; // skip SOI (FF D8)
   while (off + 1 < buf.length) {
-    if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
+    if (false) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
killedBy: JPEG dimension parsing — marker walk boundaries rejects when the first marker byte is not 0xFF
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ArithmeticOperator
src/image-dimensions.ts:102:24
   let off = 2; // skip SOI (FF D8)
   while (off + 1 < buf.length) {
     if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
-    const marker = buf[off + 1]!;
+    const marker = buf[off - 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
     if (marker === 0xd8 || marker === 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { Object (ok, format, ...) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
src/image-dimensions.ts:104:28
     if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
-    if (marker === 0xd8 || marker === 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
+    if (marker === 0xd8 || marker !== 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
       off += 2;
       continue;
killedBy: JPEG reader bounds and null-arms (kills readU16BE off+N and width/height===null) treats 0x01 (TEM) and 0xD0 (RST0, bottom of range) as standalone markers
statusReason: expected null to deeply equal { width: 77, height: 55 }

[Killed] ConditionalExpression
src/image-dimensions.ts:104:9
     if (buf[off] !== 0xff) return null; // marker must start with FF — else corrupt
     const marker = buf[off + 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
-    if (marker === 0xd8 || marker === 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
+    if (false) {
       off += 2;
       continue;
killedBy: parseDimensions fail-closed skips standalone JPEG markers then finds the SOF
statusReason: expected null to deeply equal { width: 200, height: 100 }

[Killed] AssignmentOperator
src/image-dimensions.ts:105:7
     const marker = buf[off + 1]!;
     // Standalone markers (RSTn, SOI, EOI, TEM) carry no length; skip 2 bytes.
     if (marker === 0xd8 || marker === 0xd9 || marker === 0x01 || (marker >= 0xd0 && marker <= 0xd7)) {
-      off += 2;
+      off -= 2;
       continue;
     }
killedBy: parseDimensions fail-closed skips standalone JPEG markers then finds the SOF
statusReason: expected null to deeply equal { width: 200, height: 100 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:108:35
       off += 2;
       continue;
     }
-    const segLen = readU16BE(buf, off + 2);
+    const segLen = readU16BE(buf, off - 2);
     if (segLen === null || segLen < 2) return null; // fail-closed on bad length
     if (SOF_MARKERS.has(marker)) {
killedBy: JPEG reader bounds and null-arms (kills readU16BE off+N and width/height===null) rejects a JPEG whose declared segment length is exactly 2 minus one (boundary of < 2)
statusReason: expected { width: 10, height: 10 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:109:9
       continue;
     }
     const segLen = readU16BE(buf, off + 2);
-    if (segLen === null || segLen < 2) return null; // fail-closed on bad length
+    if (segLen !== null || segLen < 2) return null; // fail-closed on bad length
     if (SOF_MARKERS.has(marker)) {
       const height = readU16BE(buf, off + 5);
killedBy: parseDimensions round-trip recovers exact JPEG dimensions
statusReason: expected null to deeply equal { width: 800, height: 600 }

[Killed] ConditionalExpression
src/image-dimensions.ts:109:9
       continue;
     }
     const segLen = readU16BE(buf, off + 2);
-    if (segLen === null || segLen < 2) return null; // fail-closed on bad length
+    if (false) return null; // fail-closed on bad length
     if (SOF_MARKERS.has(marker)) {
       const height = readU16BE(buf, off + 5);
killedBy: parseDimensions fail-closed rejects a JPEG with a corrupt segment length
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:110:9
     }
     const segLen = readU16BE(buf, off + 2);
     if (segLen === null || segLen < 2) return null; // fail-closed on bad length
-    if (SOF_MARKERS.has(marker)) {
+    if (true) {
       const height = readU16BE(buf, off + 5);
       const width = readU16BE(buf, off + 7);
killedBy: parseDimensions fail-closed skips a non-SOF segment (APP0) before reaching the SOF frame
statusReason: expected { width: 49152, height: 255 } to deeply equal { width: 240, height: 320 }

[Killed] BlockStatement
src/image-dimensions.ts:110:34
     }
     const segLen = readU16BE(buf, off + 2);
     if (segLen === null || segLen < 2) return null; // fail-closed on bad length
-    if (SOF_MARKERS.has(marker)) {
-      const height = readU16BE(buf, off + 5);
-      const width = readU16BE(buf, off + 7);
-      if (width === null || height === null || width === 0 || height === 0) return null;
-      return { width, height };
-    }
+    if (SOF_MARKERS.has(marker)) {}
     off += 2 + segLen; // advance past this segment
   }
killedBy: parseDimensions round-trip recovers exact JPEG dimensions
statusReason: expected null to deeply equal { width: 800, height: 600 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:111:37
     const segLen = readU16BE(buf, off + 2);
     if (segLen === null || segLen < 2) return null; // fail-closed on bad length
     if (SOF_MARKERS.has(marker)) {
-      const height = readU16BE(buf, off + 5);
+      const height = readU16BE(buf, off - 5);
       const width = readU16BE(buf, off + 7);
       if (width === null || height === null || width === 0 || height === 0) return null;
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { Object (ok, format, ...) }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/image-dimensions.ts:112:36
     if (segLen === null || segLen < 2) return null; // fail-closed on bad length
     if (SOF_MARKERS.has(marker)) {
       const height = readU16BE(buf, off + 5);
-      const width = readU16BE(buf, off + 7);
+      const width = readU16BE(buf, off - 7);
       if (width === null || height === null || width === 0 || height === 0) return null;
       return { width, height };
killedBy: parseDimensions round-trip recovers exact JPEG dimensions
statusReason: expected null to deeply equal { width: 800, height: 600 }

[Killed] EqualityOperator
src/image-dimensions.ts:113:29
     if (SOF_MARKERS.has(marker)) {
       const height = readU16BE(buf, off + 5);
       const width = readU16BE(buf, off + 7);
-      if (width === null || height === null || width === 0 || height === 0) return null;
+      if (width === null || height !== null || width === 0 || height === 0) return null;
       return { width, height };
     }
killedBy: JPEG dimension parsing — marker walk boundaries treats a marker just past the RST range (0xD8) as standalone, not a length segment
statusReason: expected null to deeply equal { width: 60, height: 50 }

[Killed] ConditionalExpression
src/image-dimensions.ts:113:48
     if (SOF_MARKERS.has(marker)) {
       const height = readU16BE(buf, off + 5);
       const width = readU16BE(buf, off + 7);
-      if (width === null || height === null || width === 0 || height === 0) return null;
+      if (width === null || height === null || false || height === 0) return null;
       return { width, height };
     }
killedBy: JPEG dimension parsing — marker walk boundaries rejects a SOF frame whose width is zero
statusReason: expected { width: +0, height: 10 } to be null

[Killed] AssignmentOperator
src/image-dimensions.ts:116:5
       if (width === null || height === null || width === 0 || height === 0) return null;
       return { width, height };
     }
-    off += 2 + segLen; // advance past this segment
+    off -= 2 + segLen; // advance past this segment
   }
   return null; // no SOF found
killedBy: parseDimensions fail-closed skips a non-SOF segment (APP0) before reaching the SOF frame
statusReason: expected null to deeply equal { width: 240, height: 320 }

[Timeout] ArithmeticOperator
src/image-dimensions.ts:116:12
       if (width === null || height === null || width === 0 || height === 0) return null;
       return { width, height };
     }
-    off += 2 + segLen; // advance past this segment
+    off += 2 - segLen; // advance past this segment
   }
   return null; // no SOF found

[Killed] BlockStatement
src/image-dimensions.ts:122:65
 }
 
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
-function readU24LE(buf: Uint8Array, off: number): number | null {
-  if (off + 2 >= buf.length) return null;
-  return buf[off]! | (buf[off + 1]! << 8) | (buf[off + 2]! << 16);
-}
+function readU24LE(buf: Uint8Array, off: number): number | null {}
 
 /** WebP has three sub-formats (VP8, VP8L, VP8X), each storing dimensions differently. */
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8X and recovers the +1 canvas size exactly
statusReason: expected { width: NaN, height: NaN } to deeply equal { width: 66051, height: 263430 }

[Killed] EqualityOperator
src/image-dimensions.ts:123:7
 
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
 function readU24LE(buf: Uint8Array, off: number): number | null {
-  if (off + 2 >= buf.length) return null;
+  if (off + 2 > buf.length) return null;
   return buf[off]! | (buf[off + 1]! << 8) | (buf[off + 2]! << 16);
 }
killedBy: WebP VP8X reader bounds and fourcc disambiguation returns null when the VP8X height uint24 read runs past the buffer
statusReason: expected { width: 100, height: 200 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:123:7
 
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
 function readU24LE(buf: Uint8Array, off: number): number | null {
-  if (off + 2 >= buf.length) return null;
+  if (off + 2 < buf.length) return null;
   return buf[off]! | (buf[off + 1]! << 8) | (buf[off + 2]! << 16);
 }
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8X and recovers the +1 canvas size exactly
statusReason: expected null to deeply equal { width: 66051, height: 263430 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:124:27
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
 function readU24LE(buf: Uint8Array, off: number): number | null {
   if (off + 2 >= buf.length) return null;
-  return buf[off]! | (buf[off + 1]! << 8) | (buf[off + 2]! << 16);
+  return buf[off]! | (buf[off - 1]! << 8) | (buf[off + 2]! << 16);
 }
 
killedBy: WebP VP8L and VP8X sub-formats parses a VP8X extended header
statusReason: expected { width: 244, height: 144 } to deeply equal { width: 500, height: 400 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:124:50
 /** Read a little-endian uint24 at offset, or `null` if out of bounds. */
 function readU24LE(buf: Uint8Array, off: number): number | null {
   if (off + 2 >= buf.length) return null;
-  return buf[off]! | (buf[off + 1]! << 8) | (buf[off + 2]! << 16);
+  return buf[off]! | (buf[off + 1]! << 8) | (buf[off - 2]! << 16);
 }
 
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8X and recovers the +1 canvas size exactly
statusReason: expected { width: 515, height: 132358 } to deeply equal { width: 66051, height: 263430 }

[Killed] ConditionalExpression
src/image-dimensions.ts:129:7
 
 /** WebP has three sub-formats (VP8, VP8L, VP8X), each storing dimensions differently. */
 function parseWebpDimensions(buf: Uint8Array): ImageDimensions | null {
-  if (buf.length < 16) return null;
+  if (true) return null;
   // The chunk FourCC sits at offset 12.
   const c12 = buf[12], c13 = buf[13], c14 = buf[14], c15 = buf[15];
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected null to deeply equal { width: 100, height: 200 }

[Killed] EqualityOperator
src/image-dimensions.ts:129:7
 
 /** WebP has three sub-formats (VP8, VP8L, VP8X), each storing dimensions differently. */
 function parseWebpDimensions(buf: Uint8Array): ImageDimensions | null {
-  if (buf.length < 16) return null;
+  if (buf.length >= 16) return null;
   // The chunk FourCC sits at offset 12.
   const c12 = buf[12], c13 = buf[13], c14 = buf[14], c15 = buf[15];
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected null to deeply equal { width: 100, height: 200 }

[Killed] ConditionalExpression
src/image-dimensions.ts:133:7
   // The chunk FourCC sits at offset 12.
   const c12 = buf[12], c13 = buf[13], c14 = buf[14], c15 = buf[15];
   // "VP8 " (lossy)
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x20) {
+  if (true) {
     // 16-bit key-frame header: width @26, height @28 as 14-bit little-endian values.
     if (buf.length < 30) return null;
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected null to deeply equal { width: 100, height: 200 }

[Killed] ConditionalExpression
src/image-dimensions.ts:133:7
   // The chunk FourCC sits at offset 12.
   const c12 = buf[12], c13 = buf[13], c14 = buf[14], c15 = buf[15];
   // "VP8 " (lossy)
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x20) {
+  if (true && c13 === 0x50 && c14 === 0x38 && c15 === 0x20) {
     // 16-bit key-frame header: width @26, height @28 as 14-bit little-endian values.
     if (buf.length < 30) return null;
killedBy: WebP sub-format parsing — boundaries and fourcc bytes rejects each corrupted "VP8 " fourcc byte
statusReason: expected { width: 10, height: 10 } to be null

[Killed] EqualityOperator
src/image-dimensions.ts:135:9
   // "VP8 " (lossy)
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x20) {
     // 16-bit key-frame header: width @26, height @28 as 14-bit little-endian values.
-    if (buf.length < 30) return null;
+    if (buf.length >= 30) return null;
     const width = (buf[26]! | (buf[27]! << 8)) & 0x3fff;
     const height = (buf[28]! | (buf[29]! << 8)) & 0x3fff;
killedBy: WebP sub-format parsing — boundaries and fourcc bytes rejects a VP8 whose key-frame header is truncated to 29 bytes (< 30 guard)
statusReason: expected { width: 10, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:135:9
   // "VP8 " (lossy)
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x20) {
     // 16-bit key-frame header: width @26, height @28 as 14-bit little-endian values.
-    if (buf.length < 30) return null;
+    if (false) return null;
     const width = (buf[26]! | (buf[27]! << 8)) & 0x3fff;
     const height = (buf[28]! | (buf[29]! << 8)) & 0x3fff;
killedBy: WebP sub-format parsing — boundaries and fourcc bytes rejects a VP8 whose key-frame header is truncated to 29 bytes (< 30 guard)
statusReason: expected { width: 10, height: 10 } to be null

[Killed] LogicalOperator
src/image-dimensions.ts:138:9
     if (buf.length < 30) return null;
     const width = (buf[26]! | (buf[27]! << 8)) & 0x3fff;
     const height = (buf[28]! | (buf[29]! << 8)) & 0x3fff;
-    if (width === 0 || height === 0) return null;
+    if (width === 0 && height === 0) return null;
     return { width, height };
   }
killedBy: WebP sub-format parsing — boundaries and fourcc bytes rejects a VP8 with zero width or zero height
statusReason: expected { width: +0, height: 10 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:138:9
     if (buf.length < 30) return null;
     const width = (buf[26]! | (buf[27]! << 8)) & 0x3fff;
     const height = (buf[28]! | (buf[29]! << 8)) & 0x3fff;
-    if (width === 0 || height === 0) return null;
+    if (false) return null;
     return { width, height };
   }
killedBy: WebP sub-format parsing — boundaries and fourcc bytes rejects a VP8 with zero width or zero height
statusReason: expected { width: +0, height: 10 } to be null

[Killed] LogicalOperator
src/image-dimensions.ts:142:7
     return { width, height };
   }
   // "VP8L" (lossless): 1 signature byte then 14+14 bits packed little-endian.
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x4c) {
+  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 || c15 === 0x4c) {
     if (buf.length < 25 || buf[20] !== 0x2f) return null; // 0x2f signature
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8X and recovers the +1 canvas size exactly
statusReason: expected null to deeply equal { width: 66051, height: 263430 }

[Killed] EqualityOperator
src/image-dimensions.ts:142:55
     return { width, height };
   }
   // "VP8L" (lossless): 1 signature byte then 14+14 bits packed little-endian.
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x4c) {
+  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 !== 0x4c) {
     if (buf.length < 25 || buf[20] !== 0x2f) return null; // 0x2f signature
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected null to deeply equal { width: 100, height: 200 }

[Killed] EqualityOperator
src/image-dimensions.ts:143:28
   }
   // "VP8L" (lossless): 1 signature byte then 14+14 bits packed little-endian.
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x4c) {
-    if (buf.length < 25 || buf[20] !== 0x2f) return null; // 0x2f signature
+    if (buf.length < 25 || buf[20] === 0x2f) return null; // 0x2f signature
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
     const packed = b0 | (b1 << 8) | (b2 << 16) | (b3 << 24);
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8L and rejects when its 0x2f signature byte is wrong
statusReason: expected null to deeply equal { width: 300, height: 200 }

[Killed] EqualityOperator
src/image-dimensions.ts:143:9
   }
   // "VP8L" (lossless): 1 signature byte then 14+14 bits packed little-endian.
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x4c) {
-    if (buf.length < 25 || buf[20] !== 0x2f) return null; // 0x2f signature
+    if (buf.length <= 25 || buf[20] !== 0x2f) return null; // 0x2f signature
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
     const packed = b0 | (b1 << 8) | (b2 << 16) | (b3 << 24);
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8L and rejects when its 0x2f signature byte is wrong
statusReason: expected null to deeply equal { width: 300, height: 200 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:146:19
     if (buf.length < 25 || buf[20] !== 0x2f) return null; // 0x2f signature
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
     const packed = b0 | (b1 << 8) | (b2 << 16) | (b3 << 24);
-    const width = (packed & 0x3fff) + 1;
+    const width = (packed & 0x3fff) - 1;
     const height = ((packed >> 14) & 0x3fff) + 1;
     return { width, height };
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8L and rejects when its 0x2f signature byte is wrong
statusReason: expected { width: 298, height: 200 } to deeply equal { width: 300, height: 200 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:147:20
     const b0 = buf[21]!, b1 = buf[22]!, b2 = buf[23]!, b3 = buf[24]!;
     const packed = b0 | (b1 << 8) | (b2 << 16) | (b3 << 24);
     const width = (packed & 0x3fff) + 1;
-    const height = ((packed >> 14) & 0x3fff) + 1;
+    const height = (packed >> 14 & 0x3fff) - 1;
     return { width, height };
   }
killedBy: WebP sub-format parsing — boundaries and fourcc bytes parses VP8L and rejects when its 0x2f signature byte is wrong
statusReason: expected { width: 300, height: 198 } to deeply equal { width: 300, height: 200 }

[Killed] EqualityOperator
src/image-dimensions.ts:151:39
     return { width, height };
   }
   // "VP8X" (extended): canvas size is 24-bit little-endian minus-one at 24/27.
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x58) {
+  if (c12 === 0x56 && c13 === 0x50 && c14 !== 0x38 && c15 === 0x58) {
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
killedBy: WebP VP8L and VP8X sub-formats parses a VP8X extended header
statusReason: expected null to deeply equal { width: 500, height: 400 }

[Killed] EqualityOperator
src/image-dimensions.ts:151:7
     return { width, height };
   }
   // "VP8X" (extended): canvas size is 24-bit little-endian minus-one at 24/27.
-  if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x58) {
+  if (c12 !== 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x58) {
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected null to deeply equal { width: 100, height: 200 }

[Killed] ConditionalExpression
src/image-dimensions.ts:154:9
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x58) {
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
-    if (w === null || h === null) return null;
+    if (false) return null;
     return { width: w + 1, height: h + 1 };
   }
killedBy: WebP VP8X reader bounds and fourcc disambiguation returns null when the VP8X height uint24 read runs past the buffer
statusReason: expected { width: 100, height: 1 } to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:154:23
   if (c12 === 0x56 && c13 === 0x50 && c14 === 0x38 && c15 === 0x58) {
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
-    if (w === null || h === null) return null;
+    if (w === null || false) return null;
     return { width: w + 1, height: h + 1 };
   }
killedBy: WebP VP8X reader bounds and fourcc disambiguation returns null when the VP8X height uint24 read runs past the buffer
statusReason: expected { width: 100, height: 1 } to be null

[Killed] ArithmeticOperator
src/image-dimensions.ts:155:36
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
     if (w === null || h === null) return null;
-    return { width: w + 1, height: h + 1 };
+    return { width: w + 1, height: h - 1 };
   }
   return null;
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected { width: 100, height: 198 } to deeply equal { width: 100, height: 200 }

[Killed] ArithmeticOperator
src/image-dimensions.ts:155:21
     const w = readU24LE(buf, 24);
     const h = readU24LE(buf, 27);
     if (w === null || h === null) return null;
-    return { width: w + 1, height: h + 1 };
+    return { width: w - 1, height: h + 1 };
   }
   return null;
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected { width: 98, height: 200 } to deeply equal { width: 100, height: 200 }

[Killed] BlockStatement
src/image-dimensions.ts:164:27
 export function parseDimensions(
   format: SniffedFormat,
   buf: Uint8Array,
-): ImageDimensions | null {
-  switch (format) {
-    case 'image/png':
-      return parsePngDimensions(buf);
-    case 'image/jpeg':
-      return parseJpegDimensions(buf);
-    case 'image/webp':
-      return parseWebpDimensions(buf);
-  }
-}
+): ImageDimensions | null {}
 
killedBy: JPEG reader bounds and null-arms (kills readU16BE off+N and width/height===null) returns null when the width uint16 read runs one byte past the buffer
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:166:5
   buf: Uint8Array,
 ): ImageDimensions | null {
   switch (format) {
-    case 'image/png':
-      return parsePngDimensions(buf);
+    case 'image/png':
     case 'image/jpeg':
       return parseJpegDimensions(buf);
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { ok: true, format: 'image/png', …(2) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/image-dimensions.ts:168:5
   switch (format) {
     case 'image/png':
       return parsePngDimensions(buf);
-    case 'image/jpeg':
-      return parseJpegDimensions(buf);
+    case 'image/jpeg':
     case 'image/webp':
       return parseWebpDimensions(buf);
killedBy: valid samples accepted accepts a valid PNG/JPEG/WebP and reports the sniffed format + dimensions
statusReason: expected { ok: false, …(1) } to match object { Object (ok, format, ...) }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/image-dimensions.ts:168:10
   switch (format) {
     case 'image/png':
       return parsePngDimensions(buf);
-    case 'image/jpeg':
+    case "":
       return parseJpegDimensions(buf);
     case 'image/webp':
killedBy: JPEG reader bounds and null-arms (kills readU16BE off+N and width/height===null) returns null when the width uint16 read runs one byte past the buffer
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/image-dimensions.ts:170:5
       return parsePngDimensions(buf);
     case 'image/jpeg':
       return parseJpegDimensions(buf);
-    case 'image/webp':
-      return parseWebpDimensions(buf);
+    case 'image/webp':
   }
 }
killedBy: WebP VP8X reader bounds and fourcc disambiguation parses a full VP8X header
statusReason: expected undefined to deeply equal { width: 100, height: 200 }
