[Killed] BlockStatement
src/router_ordering.ts:41:23
   allowedProviders: ReadonlyArray<ProviderId>,
   routing: ReadonlyMap<ProviderId, ProviderRouting>,
   registry: ReadonlyMap<ProviderId, TryOnProvider>,
-): OrderedCandidate[] {
-  // Dedupe the allow-list so a repeated entry cannot duplicate a candidate.
-  const seen = new Set<ProviderId>();
-  const candidates: OrderedCandidate[] = [];
-  for (const id of allowedProviders) {
-    if (seen.has(id)) {
-      continue;
-    }
-    seen.add(id);
-    const meta = routing.get(id);
-    // deny-by-default: skip providers without routing metadata or a registered implementation.
-    if (!meta || !registry.has(id)) {
-      continue;
-    }
-    candidates.push({ id, ...meta });
-  }
-  candidates.sort(compareCandidates);
-  return candidates;
-}
+): OrderedCandidate[] {}
 
 /** Total, deterministic ordering: cost asc, then priority asc, then id asc. */
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/router_ordering.ts:44:42
 ): OrderedCandidate[] {
   // Dedupe the allow-list so a repeated entry cannot duplicate a candidate.
   const seen = new Set<ProviderId>();
-  const candidates: OrderedCandidate[] = [];
+  const candidates: OrderedCandidate[] = ["Stryker was here"];
   for (const id of allowedProviders) {
     if (seen.has(id)) {
killedBy: EngineRouter — latency arithmetic (mutation-hardening) stamps latencyMs as (now - started), an exact positive elapsed value
statusReason: expected +0 to be 250 // Object.is equality

[Killed] BlockStatement
src/router_ordering.ts:45:38
   // Dedupe the allow-list so a repeated entry cannot duplicate a candidate.
   const seen = new Set<ProviderId>();
   const candidates: OrderedCandidate[] = [];
-  for (const id of allowedProviders) {
-    if (seen.has(id)) {
-      continue;
-    }
-    seen.add(id);
-    const meta = routing.get(id);
-    // deny-by-default: skip providers without routing metadata or a registered implementation.
-    if (!meta || !registry.has(id)) {
-      continue;
-    }
-    candidates.push({ id, ...meta });
-  }
+  for (const id of allowedProviders) {}
   candidates.sort(compareCandidates);
   return candidates;
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/router_ordering.ts:46:9
   const seen = new Set<ProviderId>();
   const candidates: OrderedCandidate[] = [];
   for (const id of allowedProviders) {
-    if (seen.has(id)) {
+    if (false) {
       continue;
     }
killedBy: orderCandidates dedupes a repeated allow-list entry
statusReason: expected [ …(3) ] to have a length of 1 but got 3

[Killed] ConditionalExpression
src/router_ordering.ts:46:9
   const seen = new Set<ProviderId>();
   const candidates: OrderedCandidate[] = [];
   for (const id of allowedProviders) {
-    if (seen.has(id)) {
+    if (true) {
       continue;
     }
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/router_ordering.ts:52:18
     seen.add(id);
     const meta = routing.get(id);
     // deny-by-default: skip providers without routing metadata or a registered implementation.
-    if (!meta || !registry.has(id)) {
+    if (!meta || registry.has(id)) {
       continue;
     }
killedBy: orderCandidates orders by cost ascending, then priority ascending, then id
statusReason: expected [] to deeply equal [ 'deterministic', 'replicate', …(2) ]

[Killed] BlockStatement
src/router_ordering.ts:52:37
     seen.add(id);
     const meta = routing.get(id);
     // deny-by-default: skip providers without routing metadata or a registered implementation.
-    if (!meta || !registry.has(id)) {
-      continue;
-    }
+    if (!meta || !registry.has(id)) {}
     candidates.push({ id, ...meta });
   }
killedBy: orderCandidates drops allow-listed providers with no routing metadata or no implementation
statusReason: expected [ 'replicate', 'fal', 'google-vto' ] to deeply equal [ 'fal' ]

[Killed] MethodExpression
src/router_ordering.ts:57:3
     }
     candidates.push({ id, ...meta });
   }
-  candidates.sort(compareCandidates);
+  candidates;
   return candidates;
 }
killedBy: orderCandidates orders by cost ascending, then priority ascending, then id
statusReason: expected [ 'fal', 'replicate', …(2) ] to deeply equal [ 'deterministic', 'replicate', …(2) ]

[Killed] BlockStatement
src/router_ordering.ts:62:78
 }
 
 /** Total, deterministic ordering: cost asc, then priority asc, then id asc. */
-function compareCandidates(a: OrderedCandidate, b: OrderedCandidate): number {
-  if (a.costPerCallUsd !== b.costPerCallUsd) {
-    return a.costPerCallUsd - b.costPerCallUsd;
-  }
-  if (a.priority !== b.priority) {
-    return a.priority - b.priority;
-  }
-  // Stable final tiebreak so equal cost+priority never depends on input order.
-  return a.id < b.id ? -1 : a.id > b.id ? 1 : 0;
-}
+function compareCandidates(a: OrderedCandidate, b: OrderedCandidate): number {}
 
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected 'fal' to be 'replicate' // Object.is equality

[Killed] EqualityOperator
src/router_ordering.ts:63:7
 
 /** Total, deterministic ordering: cost asc, then priority asc, then id asc. */
 function compareCandidates(a: OrderedCandidate, b: OrderedCandidate): number {
-  if (a.costPerCallUsd !== b.costPerCallUsd) {
+  if (a.costPerCallUsd === b.costPerCallUsd) {
     return a.costPerCallUsd - b.costPerCallUsd;
   }
killedBy: orderCandidates orders by cost ascending, then priority ascending, then id
statusReason: expected [ 'fal', 'replicate', …(2) ] to deeply equal [ 'deterministic', 'replicate', …(2) ]

[Killed] ConditionalExpression
src/router_ordering.ts:63:7
 
 /** Total, deterministic ordering: cost asc, then priority asc, then id asc. */
 function compareCandidates(a: OrderedCandidate, b: OrderedCandidate): number {
-  if (a.costPerCallUsd !== b.costPerCallUsd) {
+  if (false) {
     return a.costPerCallUsd - b.costPerCallUsd;
   }
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected 'fal' to be 'replicate' // Object.is equality

[Killed] ArithmeticOperator
src/router_ordering.ts:64:12
 /** Total, deterministic ordering: cost asc, then priority asc, then id asc. */
 function compareCandidates(a: OrderedCandidate, b: OrderedCandidate): number {
   if (a.costPerCallUsd !== b.costPerCallUsd) {
-    return a.costPerCallUsd - b.costPerCallUsd;
+    return a.costPerCallUsd + b.costPerCallUsd;
   }
   if (a.priority !== b.priority) {
killedBy: orderCandidates orders by cost ascending, then priority ascending, then id
statusReason: expected [ 'fal', 'replicate', …(2) ] to deeply equal [ 'deterministic', 'replicate', …(2) ]

[Killed] BlockStatement
src/router_ordering.ts:66:34
   if (a.costPerCallUsd !== b.costPerCallUsd) {
     return a.costPerCallUsd - b.costPerCallUsd;
   }
-  if (a.priority !== b.priority) {
-    return a.priority - b.priority;
-  }
+  if (a.priority !== b.priority) {}
   // Stable final tiebreak so equal cost+priority never depends on input order.
   return a.id < b.id ? -1 : a.id > b.id ? 1 : 0;
killedBy: orderCandidates — priority tiebreak (cost tied) orders by priority ASC when cost is identical (kills the priority-branch mutant)
statusReason: expected [ 'fal', 'replicate' ] to deeply equal [ 'replicate', 'fal' ]

[Killed] ConditionalExpression
src/router_ordering.ts:66:7
   if (a.costPerCallUsd !== b.costPerCallUsd) {
     return a.costPerCallUsd - b.costPerCallUsd;
   }
-  if (a.priority !== b.priority) {
+  if (false) {
     return a.priority - b.priority;
   }
killedBy: orderCandidates — priority tiebreak (cost tied) orders by priority ASC when cost is identical (kills the priority-branch mutant)
statusReason: expected [ 'fal', 'replicate' ] to deeply equal [ 'replicate', 'fal' ]

[Killed] ArithmeticOperator
src/router_ordering.ts:67:12
     return a.costPerCallUsd - b.costPerCallUsd;
   }
   if (a.priority !== b.priority) {
-    return a.priority - b.priority;
+    return a.priority + b.priority;
   }
   // Stable final tiebreak so equal cost+priority never depends on input order.
killedBy: orderCandidates produces a total deterministic order regardless of allow-list ordering (property)
statusReason: Property failed after 1 tests
{ seed: 168679873, path: "0", endOnFailure: true }
Counterexample: [["replicate","google-vto","deterministic","fal","self-hosted"]]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/router_ordering.ts:70:10
     return a.priority - b.priority;
   }
   // Stable final tiebreak so equal cost+priority never depends on input order.
-  return a.id < b.id ? -1 : a.id > b.id ? 1 : 0;
+  return false ? -1 : a.id > b.id ? 1 : 0;
 }
 
killedBy: orderCandidates breaks an exact cost+priority tie by provider id ascending
statusReason: expected [ 'replicate', 'fal' ] to deeply equal [ 'fal', 'replicate' ]

[Killed] EqualityOperator
src/router_ordering.ts:70:10
     return a.priority - b.priority;
   }
   // Stable final tiebreak so equal cost+priority never depends on input order.
-  return a.id < b.id ? -1 : a.id > b.id ? 1 : 0;
+  return a.id >= b.id ? -1 : a.id > b.id ? 1 : 0;
 }
 
killedBy: orderCandidates — id tiebreak (cost AND priority tied) orders by id ASC when cost and priority are both identical (kills the id-comparator mutant)
statusReason: expected [ 'self-hosted', 'google-vto' ] to deeply equal [ 'google-vto', 'self-hosted' ]
