[Survived] ObjectLiteral
src/router_timeout.ts:23:42
 }
 
 /** The production clock, bound to wall-clock time and the host timer functions. */
-export const SYSTEM_CLOCK: RouterClock = {
-  now: () => Date.now(),
-  setTimer: (callback, ms) => setTimeout(callback, ms),
-  clearTimer: (handle) => clearTimeout(handle as ReturnType<typeof setTimeout>),
-};
+export const SYSTEM_CLOCK: RouterClock = {};
 
 /** Options controlling a single timed attempt. */

[Survived] ArrowFunction
src/router_timeout.ts:24:8
 
 /** The production clock, bound to wall-clock time and the host timer functions. */
 export const SYSTEM_CLOCK: RouterClock = {
-  now: () => Date.now(),
+  now: () => undefined,
   setTimer: (callback, ms) => setTimeout(callback, ms),
   clearTimer: (handle) => clearTimeout(handle as ReturnType<typeof setTimeout>),

[Survived] ArrowFunction
src/router_timeout.ts:25:13
 /** The production clock, bound to wall-clock time and the host timer functions. */
 export const SYSTEM_CLOCK: RouterClock = {
   now: () => Date.now(),
-  setTimer: (callback, ms) => setTimeout(callback, ms),
+  setTimer: () => undefined,
   clearTimer: (handle) => clearTimeout(handle as ReturnType<typeof setTimeout>),
 };

[Survived] ArrowFunction
src/router_timeout.ts:26:15
 export const SYSTEM_CLOCK: RouterClock = {
   now: () => Date.now(),
   setTimer: (callback, ms) => setTimeout(callback, ms),
-  clearTimer: (handle) => clearTimeout(handle as ReturnType<typeof setTimeout>),
+  clearTimer: () => undefined,
 };
 

[Killed] BlockStatement
src/router_timeout.ts:43:64
 
 /** Error thrown when an attempt exceeds its deadline, distinguishable from provider errors. */
 export class ProviderTimeoutError extends Error {
-  public constructor(providerLabel: string, timeoutMs: number) {
-    super(`${providerLabel}: timed out after ${timeoutMs}ms`);
-    this.name = 'ProviderTimeoutError';
-  }
+  public constructor(providerLabel: string, timeoutMs: number) {}
 }
 
killedBy: EngineRouter falls through a timing-out provider to the deterministic fallback
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BooleanLiteral
src/router_timeout.ts:63:19
   const { timeoutMs, clock, controller, callerSignal, providerLabel } = options;
 
   return new Promise<T>((resolve, reject) => {
-    let settled = false;
+    let settled = true;
     const finish = (fn: () => void): void => {
       if (settled) {
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/router_timeout.ts:64:46
 
   return new Promise<T>((resolve, reject) => {
     let settled = false;
-    const finish = (fn: () => void): void => {
-      if (settled) {
-        return; // guard against a late timer/abort firing after the attempt already settled.
-      }
-      settled = true;
-      clock.clearTimer(timer);
-      if (callerSignal) {
-        callerSignal.removeEventListener('abort', onCallerAbort);
-      }
-      fn();
-    };
+    const finish = (fn: () => void): void => {};
 
     const onCallerAbort = (): void => {
killedBy: runWithTimeout resolves with the attempt value and clears the pending timer
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/router_timeout.ts:65:11
   return new Promise<T>((resolve, reject) => {
     let settled = false;
     const finish = (fn: () => void): void => {
-      if (settled) {
+      if (true) {
         return; // guard against a late timer/abort firing after the attempt already settled.
       }
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[NoCoverage] BlockStatement
src/router_timeout.ts:65:20
   return new Promise<T>((resolve, reject) => {
     let settled = false;
     const finish = (fn: () => void): void => {
-      if (settled) {
-        return; // guard against a late timer/abort firing after the attempt already settled.
-      }
+      if (settled) {}
       settled = true;
       clock.clearTimer(timer);

[Survived] BooleanLiteral
src/router_timeout.ts:68:17
       if (settled) {
         return; // guard against a late timer/abort firing after the attempt already settled.
       }
-      settled = true;
+      settled = false;
       clock.clearTimer(timer);
       if (callerSignal) {

[Killed] ConditionalExpression
src/router_timeout.ts:70:11
       }
       settled = true;
       clock.clearTimer(timer);
-      if (callerSignal) {
+      if (true) {
         callerSignal.removeEventListener('abort', onCallerAbort);
       }
killedBy: runWithTimeout resolves with the attempt value and clears the pending timer
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BlockStatement
src/router_timeout.ts:70:25
       }
       settled = true;
       clock.clearTimer(timer);
-      if (callerSignal) {
-        callerSignal.removeEventListener('abort', onCallerAbort);
-      }
+      if (callerSignal) {}
       fn();
     };

[Killed] BlockStatement
src/router_timeout.ts:76:39
       fn();
     };
 
-    const onCallerAbort = (): void => {
-      // Propagate caller cancellation into the attempt, then reject this race.
-      controller.abort();
-      finish(() => reject(new Error(`${providerLabel}: cancelled by caller`)));
-    };
+    const onCallerAbort = (): void => {};
 
     const timer = clock.setTimer(() => {
killedBy: runWithTimeout rejects immediately when the caller signal is already aborted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/router_timeout.ts:79:14
     const onCallerAbort = (): void => {
       // Propagate caller cancellation into the attempt, then reject this race.
       controller.abort();
-      finish(() => reject(new Error(`${providerLabel}: cancelled by caller`)));
+      finish(() => undefined);
     };
 
killedBy: runWithTimeout rejects immediately when the caller signal is already aborted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/router_timeout.ts:82:40
       finish(() => reject(new Error(`${providerLabel}: cancelled by caller`)));
     };
 
-    const timer = clock.setTimer(() => {
-      // fail-closed on deadline: abort the attempt's signal, then reject with a timeout error.
-      controller.abort();
-      finish(() => reject(new ProviderTimeoutError(providerLabel, timeoutMs)));
-    }, timeoutMs);
+    const timer = clock.setTimer(() => {}, timeoutMs);
 
     if (callerSignal) {
killedBy: runWithTimeout rejects with a ProviderTimeoutError and aborts the attempt signal on deadline
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/router_timeout.ts:85:14
     const timer = clock.setTimer(() => {
       // fail-closed on deadline: abort the attempt's signal, then reject with a timeout error.
       controller.abort();
-      finish(() => reject(new ProviderTimeoutError(providerLabel, timeoutMs)));
+      finish(() => undefined);
     }, timeoutMs);
 
killedBy: runWithTimeout rejects with a ProviderTimeoutError and aborts the attempt signal on deadline
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/router_timeout.ts:88:9
       finish(() => reject(new ProviderTimeoutError(providerLabel, timeoutMs)));
     }, timeoutMs);
 
-    if (callerSignal) {
+    if (false) {
       if (callerSignal.aborted) {
         onCallerAbort();
killedBy: runWithTimeout rejects immediately when the caller signal is already aborted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/router_timeout.ts:88:23
       finish(() => reject(new ProviderTimeoutError(providerLabel, timeoutMs)));
     }, timeoutMs);
 
-    if (callerSignal) {
-      if (callerSignal.aborted) {
-        onCallerAbort();
-        return;
-      }
-      callerSignal.addEventListener('abort', onCallerAbort, { once: true });
-    }
+    if (callerSignal) {}
 
     // Kick off the attempt; its resolution/rejection wins the race if it beats the deadline.
killedBy: runWithTimeout rejects immediately when the caller signal is already aborted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/router_timeout.ts:89:11
     }, timeoutMs);
 
     if (callerSignal) {
-      if (callerSignal.aborted) {
+      if (true) {
         onCallerAbort();
         return;
killedBy: runWithTimeout aborts and rejects when the caller cancels mid-flight
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/router_timeout.ts:89:33
     }, timeoutMs);
 
     if (callerSignal) {
-      if (callerSignal.aborted) {
-        onCallerAbort();
-        return;
-      }
+      if (callerSignal.aborted) {}
       callerSignal.addEventListener('abort', onCallerAbort, { once: true });
     }
killedBy: runWithTimeout rejects immediately when the caller signal is already aborted
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] BooleanLiteral
src/router_timeout.ts:93:69
         onCallerAbort();
         return;
       }
-      callerSignal.addEventListener('abort', onCallerAbort, { once: true });
+      callerSignal.addEventListener('abort', onCallerAbort, { once: false });
     }
 

[Killed] ArrowFunction
src/router_timeout.ts:98:25
 
     // Kick off the attempt; its resolution/rejection wins the race if it beats the deadline.
     attempt(controller.signal).then(
-      (value) => finish(() => resolve(value)),
+      (value) => finish(() => undefined),
       (error: unknown) => finish(() => reject(error)),
     );
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/router_timeout.ts:98:7
 
     // Kick off the attempt; its resolution/rejection wins the race if it beats the deadline.
     attempt(controller.signal).then(
-      (value) => finish(() => resolve(value)),
+      () => undefined,
       (error: unknown) => finish(() => reject(error)),
     );
killedBy: runWithTimeout resolves with the attempt value and clears the pending timer
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/router_timeout.ts:99:7
     // Kick off the attempt; its resolution/rejection wins the race if it beats the deadline.
     attempt(controller.signal).then(
       (value) => finish(() => resolve(value)),
-      (error: unknown) => finish(() => reject(error)),
+      () => undefined,
     );
   });
killedBy: runWithTimeout propagates a rejecting attempt error unchanged
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
src/router_timeout.ts:99:34
     // Kick off the attempt; its resolution/rejection wins the race if it beats the deadline.
     attempt(controller.signal).then(
       (value) => finish(() => resolve(value)),
-      (error: unknown) => finish(() => reject(error)),
+      (error: unknown) => finish(() => undefined),
     );
   });
killedBy: runWithTimeout propagates a rejecting attempt error unchanged
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
