[Killed] BlockStatement
src/rate-limit.ts:29:30
 export class InMemoryRateLimitStore implements RateLimitStore {
   private readonly buckets = new Map<string, number[]>();
 
-  get(key: string): number[] {
-    return this.buckets.get(key) ?? [];
-  }
+  get(key: string): number[] {}
 
   set(key: string, timestamps: number[]): void {
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] LogicalOperator
src/rate-limit.ts:30:12
   private readonly buckets = new Map<string, number[]>();
 
   get(key: string): number[] {
-    return this.buckets.get(key) ?? [];
+    return this.buckets.get(key) && [];
   }
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
src/rate-limit.ts:33:48
     return this.buckets.get(key) ?? [];
   }
 
-  set(key: string, timestamps: number[]): void {
-    this.buckets.set(key, timestamps);
-  }
+  set(key: string, timestamps: number[]): void {}
 }
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/rate-limit.ts:74:20
    */
   check(input: RateLimitCheckInput): RateLimitResult {
     const now = this.clock.now();
-    const cutoff = now - WINDOW_MS;
+    const cutoff = now + WINDOW_MS;
 
     // fail-closed: a non-positive cap means "no requests permitted".
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/rate-limit.ts:77:43
     const cutoff = now - WINDOW_MS;
 
     // fail-closed: a non-positive cap means "no requests permitted".
-    if (input.perShopperPerMinute <= 0 || input.perTenantPerMinute <= 0) {
+    if (input.perShopperPerMinute <= 0 || input.perTenantPerMinute > 0) {
       return { allowed: false, retryAfterMs: WINDOW_MS };
     }
killedBy: fail-closed sizing returns the full-window retry (kills <= 0 -> < 0) a zero per-tenant cap denies with retryAfterMs exactly WINDOW_MS
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] EqualityOperator
src/rate-limit.ts:77:9
     const cutoff = now - WINDOW_MS;
 
     // fail-closed: a non-positive cap means "no requests permitted".
-    if (input.perShopperPerMinute <= 0 || input.perTenantPerMinute <= 0) {
+    if (input.perShopperPerMinute > 0 || input.perTenantPerMinute <= 0) {
       return { allowed: false, retryAfterMs: WINDOW_MS };
     }
killedBy: fail-closed sizing returns the full-window retry (kills <= 0 -> < 0) a zero per-shopper cap denies with retryAfterMs exactly WINDOW_MS
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] BooleanLiteral
src/rate-limit.ts:78:25
 
     // fail-closed: a non-positive cap means "no requests permitted".
     if (input.perShopperPerMinute <= 0 || input.perTenantPerMinute <= 0) {
-      return { allowed: false, retryAfterMs: WINDOW_MS };
+      return { allowed: true, retryAfterMs: WINDOW_MS };
     }
 
killedBy: fail-closed sizing returns the full-window retry (kills <= 0 -> < 0) a zero per-shopper cap denies with retryAfterMs exactly WINDOW_MS
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/rate-limit.ts:78:14
 
     // fail-closed: a non-positive cap means "no requests permitted".
     if (input.perShopperPerMinute <= 0 || input.perTenantPerMinute <= 0) {
-      return { allowed: false, retryAfterMs: WINDOW_MS };
+      return {};
     }
 
killedBy: fail-closed sizing returns the full-window retry (kills <= 0 -> < 0) a zero per-shopper cap denies with retryAfterMs exactly WINDOW_MS
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:87:25
     const shopperHits = prune(this.store.get(shopperKey), cutoff);
     const tenantHits = prune(this.store.get(tenantKey), cutoff);
 
-    const shopperFull = shopperHits.length >= input.perShopperPerMinute;
+    const shopperFull = false;
     const tenantFull = tenantHits.length >= input.perTenantPerMinute;
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:87:25
     const shopperHits = prune(this.store.get(shopperKey), cutoff);
     const tenantHits = prune(this.store.get(tenantKey), cutoff);
 
-    const shopperFull = shopperHits.length >= input.perShopperPerMinute;
+    const shopperFull = true;
     const tenantFull = tenantHits.length >= input.perTenantPerMinute;
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/rate-limit.ts:88:24
     const tenantHits = prune(this.store.get(tenantKey), cutoff);
 
     const shopperFull = shopperHits.length >= input.perShopperPerMinute;
-    const tenantFull = tenantHits.length >= input.perTenantPerMinute;
+    const tenantFull = tenantHits.length > input.perTenantPerMinute;
 
     if (shopperFull || tenantFull) {
killedBy: per-tenant aggregate cap (threat D2) denies a second shopper once the tenant cap is hit even with per-shopper headroom
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:88:24
     const tenantHits = prune(this.store.get(tenantKey), cutoff);
 
     const shopperFull = shopperHits.length >= input.perShopperPerMinute;
-    const tenantFull = tenantHits.length >= input.perTenantPerMinute;
+    const tenantFull = false;
 
     if (shopperFull || tenantFull) {
killedBy: per-tenant aggregate cap (threat D2) denies a second shopper once the tenant cap is hit even with per-shopper headroom
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/rate-limit.ts:90:9
     const shopperFull = shopperHits.length >= input.perShopperPerMinute;
     const tenantFull = tenantHits.length >= input.perTenantPerMinute;
 
-    if (shopperFull || tenantFull) {
+    if (shopperFull && tenantFull) {
       // Persist the pruned windows so stale timestamps do not accumulate.
       this.store.set(shopperKey, shopperHits);
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:90:9
     const shopperFull = shopperHits.length >= input.perShopperPerMinute;
     const tenantFull = tenantHits.length >= input.perTenantPerMinute;
 
-    if (shopperFull || tenantFull) {
+    if (false) {
       // Persist the pruned windows so stale timestamps do not accumulate.
       this.store.set(shopperKey, shopperHits);
killedBy: per-shopper boundary allows exactly N then denies the N+1th in the same window
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/rate-limit.ts:99:25
         shopperFull ? shopperHits : [],
         tenantFull ? tenantHits : [],
       );
-      return { allowed: false, retryAfterMs };
+      return { allowed: true, retryAfterMs };
     }
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/rate-limit.ts:107:23
     tenantHits.push(now);
     this.store.set(shopperKey, shopperHits);
     this.store.set(tenantKey, tenantHits);
-    return { allowed: true, retryAfterMs: 0 };
+    return { allowed: false, retryAfterMs: 0 };
   }
 }
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/rate-limit.ts:112:73
 }
 
 /** Drop timestamps at or before the window cutoff, returning a fresh in-window array. */
-function prune(timestamps: readonly number[], cutoff: number): number[] {
-  return timestamps.filter((t) => t > cutoff);
-}
+function prune(timestamps: readonly number[], cutoff: number): number[] {}
 
 /**
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/rate-limit.ts:113:35
 
 /** Drop timestamps at or before the window cutoff, returning a fresh in-window array. */
 function prune(timestamps: readonly number[], cutoff: number): number[] {
-  return timestamps.filter((t) => t > cutoff);
+  return timestamps.filter((t) => false);
 }
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/rate-limit.ts:113:28
 
 /** Drop timestamps at or before the window cutoff, returning a fresh in-window array. */
 function prune(timestamps: readonly number[], cutoff: number): number[] {
-  return timestamps.filter((t) => t > cutoff);
+  return timestamps.filter(() => undefined);
 }
 
killedBy: per-shopper boundary allows exactly N then denies the N+1th in the same window
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/rate-limit.ts:125:11
   now: number,
   fullShopperHits: readonly number[],
   fullTenantHits: readonly number[],
-): number {
-  let retry = 0;
-  for (const hits of [fullShopperHits, fullTenantHits]) {
-    if (hits.length === 0) continue;
-    const oldest = Math.min(...hits);
-    const wait = oldest + WINDOW_MS - now;
-    if (wait > retry) retry = wait;
-  }
-  return Math.max(retry, 1);
-}
+): number {}
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected undefined to be 60000 // Object.is equality

[Killed] BlockStatement
src/rate-limit.ts:127:57
   fullTenantHits: readonly number[],
 ): number {
   let retry = 0;
-  for (const hits of [fullShopperHits, fullTenantHits]) {
-    if (hits.length === 0) continue;
-    const oldest = Math.min(...hits);
-    const wait = oldest + WINDOW_MS - now;
-    if (wait > retry) retry = wait;
-  }
+  for (const hits of [fullShopperHits, fullTenantHits]) {}
   return Math.max(retry, 1);
 }
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] ArrayDeclaration
src/rate-limit.ts:127:22
   fullTenantHits: readonly number[],
 ): number {
   let retry = 0;
-  for (const hits of [fullShopperHits, fullTenantHits]) {
+  for (const hits of []) {
     if (hits.length === 0) continue;
     const oldest = Math.min(...hits);
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:128:9
 ): number {
   let retry = 0;
   for (const hits of [fullShopperHits, fullTenantHits]) {
-    if (hits.length === 0) continue;
+    if (true) continue;
     const oldest = Math.min(...hits);
     const wait = oldest + WINDOW_MS - now;
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] EqualityOperator
src/rate-limit.ts:128:9
 ): number {
   let retry = 0;
   for (const hits of [fullShopperHits, fullTenantHits]) {
-    if (hits.length === 0) continue;
+    if (hits.length !== 0) continue;
     const oldest = Math.min(...hits);
     const wait = oldest + WINDOW_MS - now;
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected Infinity to be 60000 // Object.is equality

[Killed] MethodExpression
src/rate-limit.ts:129:20
   let retry = 0;
   for (const hits of [fullShopperHits, fullTenantHits]) {
     if (hits.length === 0) continue;
-    const oldest = Math.min(...hits);
+    const oldest = Math.max(...hits);
     const wait = oldest + WINDOW_MS - now;
     if (wait > retry) retry = wait;
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window uses the OLDEST in-window hit, not the newest (kills Math.min/Math.max swap)
statusReason: expected 60000 to be 50000 // Object.is equality

[Killed] ArithmeticOperator
src/rate-limit.ts:130:18
   for (const hits of [fullShopperHits, fullTenantHits]) {
     if (hits.length === 0) continue;
     const oldest = Math.min(...hits);
-    const wait = oldest + WINDOW_MS - now;
+    const wait = oldest - WINDOW_MS - now;
     if (wait > retry) retry = wait;
   }
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] ArithmeticOperator
src/rate-limit.ts:130:18
   for (const hits of [fullShopperHits, fullTenantHits]) {
     if (hits.length === 0) continue;
     const oldest = Math.min(...hits);
-    const wait = oldest + WINDOW_MS - now;
+    const wait = oldest + WINDOW_MS + now;
     if (wait > retry) retry = wait;
   }
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window the retry shrinks by exactly the elapsed time (kills the +/- arithmetic mutant)
statusReason: expected 85000 to be 35000 // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:131:9
     if (hits.length === 0) continue;
     const oldest = Math.min(...hits);
     const wait = oldest + WINDOW_MS - now;
-    if (wait > retry) retry = wait;
+    if (true) retry = wait;
   }
   return Math.max(retry, 1);
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window takes the MAX wait across the two binding buckets (kills wait > retry boundary)
statusReason: expected 40000 to be 60000 // Object.is equality

[Killed] ConditionalExpression
src/rate-limit.ts:131:9
     if (hits.length === 0) continue;
     const oldest = Math.min(...hits);
     const wait = oldest + WINDOW_MS - now;
-    if (wait > retry) retry = wait;
+    if (false) retry = wait;
   }
   return Math.max(retry, 1);
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality

[Killed] MethodExpression
src/rate-limit.ts:133:10
     const wait = oldest + WINDOW_MS - now;
     if (wait > retry) retry = wait;
   }
-  return Math.max(retry, 1);
+  return Math.min(retry, 1);
 }
 
killedBy: retryAfterMs is the exact time until the oldest hit leaves the window after filling the shopper bucket at t=0, the N+1th denial waits the full window
statusReason: expected 1 to be 60000 // Object.is equality
