[Killed] BlockStatement
src/internal/image_ref_to_input.ts:21:56
  *
  * The discriminated union is exhaustive; the unreachable branch fails closed.
  */
-export function imageRefToInput(ref: ImageRef): string {
-  if (ref.kind === 'url') {
-    return ref.url;
-  }
-  if (ref.kind === 'base64') {
-    return `data:${ref.mimeType};base64,${ref.data}`;
-  }
-  // fail-closed: an unknown discriminant (should be impossible post-validation) is rejected.
-  throw new Error('imageRefToInput: unsupported image reference kind');
-}
+export function imageRefToInput(ref: ImageRef): string {}
 
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected { human_image_url: undefined, …(3) } to deeply equal { …(4) }

[Killed] ConditionalExpression
src/internal/image_ref_to_input.ts:22:7
  * The discriminated union is exhaustive; the unreachable branch fails closed.
  */
 export function imageRefToInput(ref: ImageRef): string {
-  if (ref.kind === 'url') {
+  if (true) {
     return ref.url;
   }
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: expected { …(4) } to deeply equal { …(4) }

[Killed] EqualityOperator
src/internal/image_ref_to_input.ts:22:7
  * The discriminated union is exhaustive; the unreachable branch fails closed.
  */
 export function imageRefToInput(ref: ImageRef): string {
-  if (ref.kind === 'url') {
+  if (ref.kind !== 'url') {
     return ref.url;
   }
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: imageRefToInput: unsupported image reference kind

[Killed] ConditionalExpression
src/internal/image_ref_to_input.ts:25:7
   if (ref.kind === 'url') {
     return ref.url;
   }
-  if (ref.kind === 'base64') {
+  if (true) {
     return `data:${ref.mimeType};base64,${ref.data}`;
   }
killedBy: imageRefToInput fails closed on an unrecognised discriminant
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/internal/image_ref_to_input.ts:25:30
   if (ref.kind === 'url') {
     return ref.url;
   }
-  if (ref.kind === 'base64') {
-    return `data:${ref.mimeType};base64,${ref.data}`;
-  }
+  if (ref.kind === 'base64') {}
   // fail-closed: an unknown discriminant (should be impossible post-validation) is rejected.
   throw new Error('imageRefToInput: unsupported image reference kind');
killedBy: FalProvider maps person/garment/seed/num_samples and targets the try-on endpoint
statusReason: imageRefToInput: unsupported image reference kind

[Killed] StringLiteral
src/internal/image_ref_to_input.ts:29:19
     return `data:${ref.mimeType};base64,${ref.data}`;
   }
   // fail-closed: an unknown discriminant (should be impossible post-validation) is rejected.
-  throw new Error('imageRefToInput: unsupported image reference kind');
+  throw new Error("");
 }
 
killedBy: imageRefToInput fails closed on an unrecognised discriminant
statusReason: expected [Function] to throw error matching /unsupported image reference kind/ but got ''
