[Killed] BlockStatement
src/internal/validate_provider_result.ts:21:96
  * @returns The same value, now proven to satisfy {@link TryOnResult}.
  * @throws Error if the candidate does not satisfy the result contract.
  */
-export function validateProviderResult(candidate: unknown, providerLabel: string): TryOnResult {
-  const parsed = safeParseTryOnResult(candidate);
-  if (!parsed.success) {
-    // fail-closed: surface a typed failure so the router falls through rather than returning
-    // a result that violates the wire contract (e.g. a non-https or http result URL).
-    throw new Error(`${providerLabel}: malformed provider result — ${parsed.error.message}`);
-  }
-  return parsed.data;
-}
+export function validateProviderResult(candidate: unknown, providerLabel: string): TryOnResult {}
 
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: Cannot read properties of undefined (reading 'provider')

[Killed] ConditionalExpression
src/internal/validate_provider_result.ts:23:7
  */
 export function validateProviderResult(candidate: unknown, providerLabel: string): TryOnResult {
   const parsed = safeParseTryOnResult(candidate);
-  if (!parsed.success) {
+  if (false) {
     // fail-closed: surface a typed failure so the router falls through rather than returning
     // a result that violates the wire contract (e.g. a non-https or http result URL).
killedBy: EngineRouter rejects a provider returning a malformed result and falls through (defence in depth)
statusReason: Cannot read properties of undefined (reading 'provider')

[Killed] ConditionalExpression
src/internal/validate_provider_result.ts:23:7
  */
 export function validateProviderResult(candidate: unknown, providerLabel: string): TryOnResult {
   const parsed = safeParseTryOnResult(candidate);
-  if (!parsed.success) {
+  if (true) {
     // fail-closed: surface a typed failure so the router falls through rather than returning
     // a result that violates the wire contract (e.g. a non-https or http result URL).
killedBy: EngineRouter picks the cheapest permitted provider and stamps result metadata
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/internal/validate_provider_result.ts:26:21
   if (!parsed.success) {
     // fail-closed: surface a typed failure so the router falls through rather than returning
     // a result that violates the wire contract (e.g. a non-https or http result URL).
-    throw new Error(`${providerLabel}: malformed provider result — ${parsed.error.message}`);
+    throw new Error(``);
   }
   return parsed.data;
killedBy: FalProvider fails closed when the upstream url is not https
statusReason: expected [Function] to throw error matching /malformed provider result/ but got ''
