[Killed] BlockStatement
src/providers/deterministic.ts:28:85
 export class DeterministicProvider implements TryOnProvider {
   public readonly id = 'deterministic' as const;
 
-  public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
-    // fail-closed: if the caller already aborted, do not fabricate a result they cancelled.
-    if (ctx.signal.aborted) {
-      throw new Error('deterministic: request already aborted');
-    }
-    const digest = stableRequestHash(req);
-    ctx.logger.debug('deterministic.tryOn', { digest, tenantId: req.tenantId });
-    return {
-      resultImageUrl: buildPlaceholderImageDataUrl(digest),
-      provider: this.id,
-      // latency/cost are set authoritatively by the router; locals here are the provider's
-      // own view (offline => zero marginal cost, ~instant). The router overwrites latencyMs.
-      latencyMs: 0,
-      cached: false,
-      costUsd: 0,
-    };
-  }
+  public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {}
 }
 
killedBy: DeterministicProvider produces a byte-identical result for the identical request (property)
statusReason: Property failed after 1 tests
{ seed: 1235954296, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tenantId":" ","shopperId":" ","productId":" ","personImage":{"kind":"url","url":"https://a.aa"},"category":"apparel"}]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/providers/deterministic.ts:30:9
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
     // fail-closed: if the caller already aborted, do not fabricate a result they cancelled.
-    if (ctx.signal.aborted) {
+    if (true) {
       throw new Error('deterministic: request already aborted');
     }
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/providers/deterministic.ts:30:9
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
     // fail-closed: if the caller already aborted, do not fabricate a result they cancelled.
-    if (ctx.signal.aborted) {
+    if (false) {
       throw new Error('deterministic: request already aborted');
     }
killedBy: DeterministicProvider fails closed when the context signal is already aborted
statusReason: promise resolved "{ …(5) }" instead of rejecting

[Survived] StringLiteral
src/providers/deterministic.ts:34:22
       throw new Error('deterministic: request already aborted');
     }
     const digest = stableRequestHash(req);
-    ctx.logger.debug('deterministic.tryOn', { digest, tenantId: req.tenantId });
+    ctx.logger.debug("", { digest, tenantId: req.tenantId });
     return {
       resultImageUrl: buildPlaceholderImageDataUrl(digest),
