[Killed] BlockStatement
src/providers/deterministic_placeholder_svg.ts:12:84
  */
 
 /** Derive two hex-driven accent colours from the digest so the swatch varies per request. */
-function coloursFromDigest(digest: string): { primary: string; secondary: string } {
-  // Slice fixed windows of the 16-char hex digest into 6-char CSS colours; pad defensively.
-  const primary = `#${(digest.slice(0, 6) + '000000').slice(0, 6)}`;
-  const secondary = `#${(digest.slice(6, 12) + '000000').slice(0, 6)}`;
-  return { primary, secondary };
-}
+function coloursFromDigest(digest: string): { primary: string; secondary: string } {}
 
 /**
killedBy: DeterministicProvider produces a byte-identical result for the identical request (property)
statusReason: Property failed after 1 tests
{ seed: -1594493877, path: "0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tenantId":" ","shopperId":" ","productId":" ","personImage":{"kind":"url","url":"https://a.aa"},"category":"apparel"}]
Shrunk 12 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] MethodExpression
src/providers/deterministic_placeholder_svg.ts:14:24
 /** Derive two hex-driven accent colours from the digest so the swatch varies per request. */
 function coloursFromDigest(digest: string): { primary: string; secondary: string } {
   // Slice fixed windows of the 16-char hex digest into 6-char CSS colours; pad defensively.
-  const primary = `#${(digest.slice(0, 6) + '000000').slice(0, 6)}`;
+  const primary = `#${(digest + '000000').slice(0, 6)}`;
   const secondary = `#${(digest.slice(6, 12) + '000000').slice(0, 6)}`;
   return { primary, secondary };

[Survived] MethodExpression
src/providers/deterministic_placeholder_svg.ts:14:23
 /** Derive two hex-driven accent colours from the digest so the swatch varies per request. */
 function coloursFromDigest(digest: string): { primary: string; secondary: string } {
   // Slice fixed windows of the 16-char hex digest into 6-char CSS colours; pad defensively.
-  const primary = `#${(digest.slice(0, 6) + '000000').slice(0, 6)}`;
+  const primary = `#${digest.slice(0, 6) + '000000'}`;
   const secondary = `#${(digest.slice(6, 12) + '000000').slice(0, 6)}`;
   return { primary, secondary };

[Survived] MethodExpression
src/providers/deterministic_placeholder_svg.ts:15:25
 function coloursFromDigest(digest: string): { primary: string; secondary: string } {
   // Slice fixed windows of the 16-char hex digest into 6-char CSS colours; pad defensively.
   const primary = `#${(digest.slice(0, 6) + '000000').slice(0, 6)}`;
-  const secondary = `#${(digest.slice(6, 12) + '000000').slice(0, 6)}`;
+  const secondary = `#${digest.slice(6, 12) + '000000'}`;
   return { primary, secondary };
 }

[Survived] MethodExpression
src/providers/deterministic_placeholder_svg.ts:15:26
 function coloursFromDigest(digest: string): { primary: string; secondary: string } {
   // Slice fixed windows of the 16-char hex digest into 6-char CSS colours; pad defensively.
   const primary = `#${(digest.slice(0, 6) + '000000').slice(0, 6)}`;
-  const secondary = `#${(digest.slice(6, 12) + '000000').slice(0, 6)}`;
+  const secondary = `#${(digest + '000000').slice(0, 6)}`;
   return { primary, secondary };
 }

[Killed] BlockStatement
src/providers/deterministic_placeholder_svg.ts:24:61
  *
  * @returns A self-contained SVG document string. Same digest -> identical bytes, always.
  */
-export function buildPlaceholderSvg(digest: string): string {
-  const { primary, secondary } = coloursFromDigest(digest);
-  // A fixed 512x640 portrait canvas (try-on aspect) with two digest-driven bands plus the
-  // digest printed as a label so the placeholder is visually traceable to its request.
-  return [
-    '<svg xmlns="http://www.w3.org/2000/svg" width="512" height="640" viewBox="0 0 512 640">',
-    `<rect width="512" height="640" fill="${primary}"/>`,
-    `<rect y="320" width="512" height="320" fill="${secondary}"/>`,
-    '<text x="256" y="600" font-family="monospace" font-size="20" fill="#ffffff" ' +
-      `text-anchor="middle">tryit:${digest}</text>`,
-    '</svg>',
-  ].join('');
-}
+export function buildPlaceholderSvg(digest: string): string {}
 
 /** Base64-encode a UTF-8 string. Node's Buffer is always present in the runtime targets. */
killedBy: DeterministicProvider produces a byte-identical result for the identical request (property)
statusReason: Property failed after 1 tests
{ seed: 474534438, path: "0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tenantId":" ","shopperId":" ","productId":" ","personImage":{"kind":"url","url":"https://a.aa"},"category":"apparel"}]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Survived] StringLiteral
src/providers/deterministic_placeholder_svg.ts:30:5
   // digest printed as a label so the placeholder is visually traceable to its request.
   return [
     '<svg xmlns="http://www.w3.org/2000/svg" width="512" height="640" viewBox="0 0 512 640">',
-    `<rect width="512" height="640" fill="${primary}"/>`,
+    ``,
     `<rect y="320" width="512" height="320" fill="${secondary}"/>`,
     '<text x="256" y="600" font-family="monospace" font-size="20" fill="#ffffff" ' +

[Survived] StringLiteral
src/providers/deterministic_placeholder_svg.ts:31:5
   return [
     '<svg xmlns="http://www.w3.org/2000/svg" width="512" height="640" viewBox="0 0 512 640">',
     `<rect width="512" height="640" fill="${primary}"/>`,
-    `<rect y="320" width="512" height="320" fill="${secondary}"/>`,
+    ``,
     '<text x="256" y="600" font-family="monospace" font-size="20" fill="#ffffff" ' +
       `text-anchor="middle">tryit:${digest}</text>`,

[Survived] StringLiteral
src/providers/deterministic_placeholder_svg.ts:32:5
     '<svg xmlns="http://www.w3.org/2000/svg" width="512" height="640" viewBox="0 0 512 640">',
     `<rect width="512" height="640" fill="${primary}"/>`,
     `<rect y="320" width="512" height="320" fill="${secondary}"/>`,
-    '<text x="256" y="600" font-family="monospace" font-size="20" fill="#ffffff" ' +
+    "" +
       `text-anchor="middle">tryit:${digest}</text>`,
     '</svg>',

[Survived] StringLiteral
src/providers/deterministic_placeholder_svg.ts:34:5
     `<rect y="320" width="512" height="320" fill="${secondary}"/>`,
     '<text x="256" y="600" font-family="monospace" font-size="20" fill="#ffffff" ' +
       `text-anchor="middle">tryit:${digest}</text>`,
-    '</svg>',
+    "",
   ].join('');
 }

[Killed] BlockStatement
src/providers/deterministic_placeholder_svg.ts:39:44
 }
 
 /** Base64-encode a UTF-8 string. Node's Buffer is always present in the runtime targets. */
-function base64Utf8(input: string): string {
-  return Buffer.from(input, 'utf-8').toString('base64');
-}
+function base64Utf8(input: string): string {}
 
 /**
killedBy: DeterministicProvider produces distinct URLs for requests differing only in productId (property)
statusReason: Property failed after 1 tests
{ seed: 1901035312, path: "0:0:1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","!"]
Shrunk 8 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
src/providers/deterministic_placeholder_svg.ts:50:70
  *   always, and it satisfies the contract's result-image-URL invariant (a safe inline image data
  *   URL), so the offline/fallback result renders instead of pointing at a non-resolvable host.
  */
-export function buildPlaceholderImageDataUrl(digest: string): string {
-  return `data:image/svg+xml;base64,${base64Utf8(buildPlaceholderSvg(digest))}`;
-}
+export function buildPlaceholderImageDataUrl(digest: string): string {}
 
killedBy: DeterministicProvider produces distinct URLs for requests differing only in productId (property)
statusReason: Property failed after 1 tests
{ seed: 1434373877, path: "0:0:0:0:1:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","!"]
Shrunk 10 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] StringLiteral
src/providers/deterministic_placeholder_svg.ts:51:10
  *   URL), so the offline/fallback result renders instead of pointing at a non-resolvable host.
  */
 export function buildPlaceholderImageDataUrl(digest: string): string {
-  return `data:image/svg+xml;base64,${base64Utf8(buildPlaceholderSvg(digest))}`;
+  return ``;
 }
 
killedBy: DeterministicProvider produces distinct URLs for requests differing only in productId (property)
statusReason: Property failed after 1 tests
{ seed: 2066395021, path: "0:0:0:0:1:0:0:0:0:0", endOnFailure: true }
Counterexample: [" ","!"]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
