[Killed] BlockStatement
src/providers/google-vto.ts:51:57
   private readonly httpClient: GoogleVtoHttpClient;
   private readonly costPerCallUsd: number;
 
-  public constructor(options: GoogleVtoProviderOptions) {
-    this.httpClient = options.httpClient;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
-  }
+  public constructor(options: GoogleVtoProviderOptions) {}
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: Cannot read properties of undefined (reading 'predict')

[Killed] LogicalOperator
src/providers/google-vto.ts:53:27
 
   public constructor(options: GoogleVtoProviderOptions) {
     this.httpClient = options.httpClient;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
+    this.costPerCallUsd = options.costPerCallUsd && 0;
   }
 
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected +0 to be 0.04 // Object.is equality

[Killed] OptionalChaining
src/providers/google-vto.ts:57:24
   }
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
-    const garmentRef = req.params?.garmentImage;
+    const garmentRef = req.params.garmentImage;
     const instance: Record<string, unknown> = {
       personImage: { image: { gcsUri: imageRefToInput(req.personImage) } },
killedBy: GoogleVtoProvider fails closed when there are no predictions
statusReason: expected [Function] to throw error matching /no result image url/ but got 'Cannot read properties of undefined (…'

[Killed] ObjectLiteral
src/providers/google-vto.ts:59:20
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
     const garmentRef = req.params?.garmentImage;
     const instance: Record<string, unknown> = {
-      personImage: { image: { gcsUri: imageRefToInput(req.personImage) } },
+      personImage: {},
       productImages: [
         {
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected [ { personImage: {}, …(1) } ] to deeply equal [ { personImage: { …(1) }, …(1) } ]

[Killed] ArrayDeclaration
src/providers/google-vto.ts:60:22
     const garmentRef = req.params?.garmentImage;
     const instance: Record<string, unknown> = {
       personImage: { image: { gcsUri: imageRefToInput(req.personImage) } },
-      productImages: [
-        {
-          image: garmentRef
-            ? { gcsUri: imageRefToInput(garmentRef) }
-            : { productId: req.productId },
-        },
-      ],
+      productImages: [],
     };
     const parameters: Record<string, unknown> = {
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected [ { personImage: { …(1) }, …(1) } ] to deeply equal [ { personImage: { …(1) }, …(1) } ]

[Killed] ObjectLiteral
src/providers/google-vto.ts:61:9
     const instance: Record<string, unknown> = {
       personImage: { image: { gcsUri: imageRefToInput(req.personImage) } },
       productImages: [
-        {
-          image: garmentRef
-            ? { gcsUri: imageRefToInput(garmentRef) }
-            : { productId: req.productId },
-        },
+        {},
       ],
     };
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected [ { personImage: { …(1) }, …(1) } ] to deeply equal [ { personImage: { …(1) }, …(1) } ]

[Killed] ObjectLiteral
src/providers/google-vto.ts:63:15
       productImages: [
         {
           image: garmentRef
-            ? { gcsUri: imageRefToInput(garmentRef) }
+            ? {}
             : { productId: req.productId },
         },
killedBy: GoogleVtoProvider uses an explicit garment image and defaults sampleCount, omitting seed
statusReason: expected [ { image: {} } ] to deeply equal [ Array(1) ]

[Killed] OptionalChaining
src/providers/google-vto.ts:69:20
       ],
     };
     const parameters: Record<string, unknown> = {
-      sampleCount: req.params?.numSamples ?? 1,
+      sampleCount: req.params.numSamples ?? 1,
     };
     if (req.params?.seed !== undefined) {
killedBy: GoogleVtoProvider fails closed when there are no predictions
statusReason: expected [Function] to throw error matching /no result image url/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/providers/google-vto.ts:69:20
       ],
     };
     const parameters: Record<string, unknown> = {
-      sampleCount: req.params?.numSamples ?? 1,
+      sampleCount: req.params?.numSamples && 1,
     };
     if (req.params?.seed !== undefined) {
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected { sampleCount: 1, seed: 5 } to deeply equal { sampleCount: 2, seed: 5 }

[Killed] BlockStatement
src/providers/google-vto.ts:71:41
     const parameters: Record<string, unknown> = {
       sampleCount: req.params?.numSamples ?? 1,
     };
-    if (req.params?.seed !== undefined) {
-      parameters['seed'] = req.params.seed;
-    }
+    if (req.params?.seed !== undefined) {}
     ctx.logger.debug('googleVto.tryOn', { tenantId: req.tenantId });
     const response = await this.httpClient.predict(
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected { sampleCount: 2 } to deeply equal { sampleCount: 2, seed: 5 }

[Killed] ConditionalExpression
src/providers/google-vto.ts:71:9
     const parameters: Record<string, unknown> = {
       sampleCount: req.params?.numSamples ?? 1,
     };
-    if (req.params?.seed !== undefined) {
+    if (false) {
       parameters['seed'] = req.params.seed;
     }
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected { sampleCount: 2 } to deeply equal { sampleCount: 2, seed: 5 }

[Killed] StringLiteral
src/providers/google-vto.ts:72:18
       sampleCount: req.params?.numSamples ?? 1,
     };
     if (req.params?.seed !== undefined) {
-      parameters['seed'] = req.params.seed;
+      parameters[""] = req.params.seed;
     }
     ctx.logger.debug('googleVto.tryOn', { tenantId: req.tenantId });
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: expected { sampleCount: 2, '': 5 } to deeply equal { sampleCount: 2, seed: 5 }

[Survived] StringLiteral
src/providers/google-vto.ts:74:22
     if (req.params?.seed !== undefined) {
       parameters['seed'] = req.params.seed;
     }
-    ctx.logger.debug('googleVto.tryOn', { tenantId: req.tenantId });
+    ctx.logger.debug("", { tenantId: req.tenantId });
     const response = await this.httpClient.predict(
       { instances: [instance], parameters },

[Killed] OptionalChaining
src/providers/google-vto.ts:79:17
       { instances: [instance], parameters },
       ctx.signal,
     );
-    const url = response.predictions?.[0]?.resultImageUrl;
+    const url = response.predictions?.[0].resultImageUrl;
     if (typeof url !== 'string' || url.length === 0) {
       // fail-closed: no prediction / no surfaced url is a failure, not an empty success.
killedBy: GoogleVtoProvider fails closed when there are no predictions
statusReason: expected [Function] to throw error matching /no result image url/ but got 'Cannot read properties of undefined (…'

[Survived] OptionalChaining
src/providers/google-vto.ts:79:17
       { instances: [instance], parameters },
       ctx.signal,
     );
-    const url = response.predictions?.[0]?.resultImageUrl;
+    const url = response.predictions[0]?.resultImageUrl;
     if (typeof url !== 'string' || url.length === 0) {
       // fail-closed: no prediction / no surfaced url is a failure, not an empty success.

[Killed] ConditionalExpression
src/providers/google-vto.ts:80:9
       ctx.signal,
     );
     const url = response.predictions?.[0]?.resultImageUrl;
-    if (typeof url !== 'string' || url.length === 0) {
+    if (true) {
       // fail-closed: no prediction / no surfaced url is a failure, not an empty success.
       throw new Error('google-vto: response contained no result image url');
killedBy: GoogleVtoProvider maps the instance and parameters and forwards the signal
statusReason: google-vto: response contained no result image url

[Killed] BlockStatement
src/providers/google-vto.ts:80:54
       ctx.signal,
     );
     const url = response.predictions?.[0]?.resultImageUrl;
-    if (typeof url !== 'string' || url.length === 0) {
-      // fail-closed: no prediction / no surfaced url is a failure, not an empty success.
-      throw new Error('google-vto: response contained no result image url');
-    }
+    if (typeof url !== 'string' || url.length === 0) {}
     return validateProviderResult(
       {
killedBy: GoogleVtoProvider fails closed when there are no predictions
statusReason: expected [Function] to throw error matching /no result image url/ but got 'google-vto: malformed provider result…'
