[Killed] BlockStatement
src/providers/replicate.ts:42:52
 }
 
 /** Pull the first usable https image url out of a Replicate `output` (string or string[]). */
-function extractOutputUrl(output: unknown): string {
-  if (typeof output === 'string' && output.length > 0) {
-    return output;
-  }
-  if (Array.isArray(output)) {
-    const first = output[0];
-    if (typeof first === 'string' && first.length > 0) {
-      return first;
-    }
-  }
-  // fail-closed: an output we cannot read as an image url is an error, not an empty success.
-  throw new Error('replicate: prediction output contained no image url');
-}
+function extractOutputUrl(output: unknown): string {}
 
 export class ReplicateProvider implements TryOnProvider {
killedBy: ReplicateProvider maps inputs and version, forwards the signal, returns the string output url
statusReason: replicate: malformed provider result — [
  {
    "code": "invalid_type",
    "expected": "string",
    "received": "undefined",
    "path": [
      "resultImageUrl"
    ],

[Killed] ConditionalExpression
src/providers/replicate.ts:43:7
 
 /** Pull the first usable https image url out of a Replicate `output` (string or string[]). */
 function extractOutputUrl(output: unknown): string {
-  if (typeof output === 'string' && output.length > 0) {
+  if (true) {
     return output;
   }
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: malformed provider result — [
  {
    "code": "invalid_type",
    "expected": "string",
    "received": "array",
    "path": [
      "resultImageUrl"
    ],

[Killed] ConditionalExpression
src/providers/replicate.ts:43:7
 
 /** Pull the first usable https image url out of a Replicate `output` (string or string[]). */
 function extractOutputUrl(output: unknown): string {
-  if (typeof output === 'string' && output.length > 0) {
+  if (true && output.length > 0) {
     return output;
   }
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: malformed provider result — [
  {
    "code": "invalid_type",
    "expected": "string",
    "received": "array",
    "path": [
      "resultImageUrl"
    ],

[Killed] BlockStatement
src/providers/replicate.ts:46:30
   if (typeof output === 'string' && output.length > 0) {
     return output;
   }
-  if (Array.isArray(output)) {
-    const first = output[0];
-    if (typeof first === 'string' && first.length > 0) {
-      return first;
-    }
-  }
+  if (Array.isArray(output)) {}
   // fail-closed: an output we cannot read as an image url is an error, not an empty success.
   throw new Error('replicate: prediction output contained no image url');
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: prediction output contained no image url

[Killed] ConditionalExpression
src/providers/replicate.ts:46:7
   if (typeof output === 'string' && output.length > 0) {
     return output;
   }
-  if (Array.isArray(output)) {
+  if (false) {
     const first = output[0];
     if (typeof first === 'string' && first.length > 0) {
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: prediction output contained no image url

[Killed] EqualityOperator
src/providers/replicate.ts:48:9
   }
   if (Array.isArray(output)) {
     const first = output[0];
-    if (typeof first === 'string' && first.length > 0) {
+    if (typeof first !== 'string' && first.length > 0) {
       return first;
     }
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: prediction output contained no image url

[Killed] BlockStatement
src/providers/replicate.ts:48:56
   }
   if (Array.isArray(output)) {
     const first = output[0];
-    if (typeof first === 'string' && first.length > 0) {
-      return first;
-    }
+    if (typeof first === 'string' && first.length > 0) {}
   }
   // fail-closed: an output we cannot read as an image url is an error, not an empty success.
killedBy: ReplicateProvider reads the first element of an array output
statusReason: replicate: prediction output contained no image url

[Killed] BlockStatement
src/providers/replicate.ts:62:57
   private readonly httpClient: ReplicateHttpClient;
   private readonly costPerCallUsd: number;
 
-  public constructor(options: ReplicateProviderOptions) {
-    this.modelVersion = options.modelVersion;
-    this.httpClient = options.httpClient;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
-  }
+  public constructor(options: ReplicateProviderOptions) {}
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
killedBy: ReplicateProvider maps inputs and version, forwards the signal, returns the string output url
statusReason: Cannot read properties of undefined (reading 'createPrediction')

[Killed] ObjectLiteral
src/providers/replicate.ts:70:44
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
     const garmentRef = req.params?.garmentImage;
-    const input: Record<string, unknown> = {
-      human_img: imageRefToInput(req.personImage),
-      garm_img: garmentRef ? imageRefToInput(garmentRef) : `product:${req.productId}`,
-      category: req.category,
-    };
+    const input: Record<string, unknown> = {};
     if (req.params?.seed !== undefined) {
       input['seed'] = req.params.seed;
killedBy: ReplicateProvider maps inputs and version, forwards the signal, returns the string output url
statusReason: expected { seed: 11 } to deeply equal { …(4) }

[Killed] OptionalChaining
src/providers/replicate.ts:75:9
       garm_img: garmentRef ? imageRefToInput(garmentRef) : `product:${req.productId}`,
       category: req.category,
     };
-    if (req.params?.seed !== undefined) {
+    if (req.params.seed !== undefined) {
       input['seed'] = req.params.seed;
     }
killedBy: ReplicateProvider resolves garment from productId and omits seed when none given
statusReason: Cannot read properties of undefined (reading 'seed')

[Survived] StringLiteral
src/providers/replicate.ts:78:22
     if (req.params?.seed !== undefined) {
       input['seed'] = req.params.seed;
     }
-    ctx.logger.debug('replicate.tryOn', { version: this.modelVersion, tenantId: req.tenantId });
+    ctx.logger.debug("", { version: this.modelVersion, tenantId: req.tenantId });
     const prediction = await this.httpClient.createPrediction(
       { version: this.modelVersion, input },

[Killed] ObjectLiteral
src/providers/replicate.ts:80:7
     }
     ctx.logger.debug('replicate.tryOn', { version: this.modelVersion, tenantId: req.tenantId });
     const prediction = await this.httpClient.createPrediction(
-      { version: this.modelVersion, input },
+      {},
       ctx.signal,
     );
killedBy: ReplicateProvider maps inputs and version, forwards the signal, returns the string output url
statusReason: expected undefined to be 'v-abc' // Object.is equality

[Killed] ConditionalExpression
src/providers/replicate.ts:83:9
       { version: this.modelVersion, input },
       ctx.signal,
     );
-    if (prediction.status !== 'succeeded') {
+    if (true) {
       // fail-closed: any non-succeeded terminal state is a failure for the router to handle.
       throw new Error(`replicate: prediction status ${prediction.status}`);
killedBy: ReplicateProvider maps inputs and version, forwards the signal, returns the string output url
statusReason: replicate: prediction status succeeded

[Killed] ConditionalExpression
src/providers/replicate.ts:83:9
       { version: this.modelVersion, input },
       ctx.signal,
     );
-    if (prediction.status !== 'succeeded') {
+    if (false) {
       // fail-closed: any non-succeeded terminal state is a failure for the router to handle.
       throw new Error(`replicate: prediction status ${prediction.status}`);
killedBy: ReplicateProvider fails closed when the prediction did not succeed
statusReason: expected [Function] to throw error matching /status failed/ but got 'replicate: prediction output containe…'
