[Killed] BlockStatement
src/providers/self-hosted.ts:51:55
 }
 
 /** Map the request into the inference service body. */
-function mapBody(req: TryOnRequest): InferRequestBody {
-  const base: InferRequestBody = {
-    person_image: imageRefToInput(req.personImage),
-    product_id: req.productId,
-    category: req.category,
-    num_samples: req.params?.numSamples ?? 1,
-  };
-  return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
-}
+function mapBody(req: TryOnRequest): InferRequestBody {}
 
 export class SelfHostedProvider implements TryOnProvider {
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: "undefined" is not valid JSON

[Killed] ObjectLiteral
src/providers/self-hosted.ts:52:34
 
 /** Map the request into the inference service body. */
 function mapBody(req: TryOnRequest): InferRequestBody {
-  const base: InferRequestBody = {
-    person_image: imageRefToInput(req.personImage),
-    product_id: req.productId,
-    category: req.category,
-    num_samples: req.params?.numSamples ?? 1,
-  };
+  const base: InferRequestBody = {};
   return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
 }
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: expected { seed: 3 } to deeply equal { …(5) }

[Killed] OptionalChaining
src/providers/self-hosted.ts:56:18
     person_image: imageRefToInput(req.personImage),
     product_id: req.productId,
     category: req.category,
-    num_samples: req.params?.numSamples ?? 1,
+    num_samples: req.params.numSamples ?? 1,
   };
   return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
killedBy: SelfHostedProvider normalises a trailing slash on the base url
statusReason: Cannot read properties of undefined (reading 'numSamples')

[Killed] LogicalOperator
src/providers/self-hosted.ts:56:18
     person_image: imageRefToInput(req.personImage),
     product_id: req.productId,
     category: req.category,
-    num_samples: req.params?.numSamples ?? 1,
+    num_samples: req.params?.numSamples && 1,
   };
   return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: expected { …(5) } to deeply equal { …(5) }

[Killed] ConditionalExpression
src/providers/self-hosted.ts:58:10
     category: req.category,
     num_samples: req.params?.numSamples ?? 1,
   };
-  return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
+  return false ? base : { ...base, seed: req.params.seed };
 }
 
killedBy: SelfHostedProvider normalises a trailing slash on the base url
statusReason: Cannot read properties of undefined (reading 'seed')

[Killed] EqualityOperator
src/providers/self-hosted.ts:58:10
     category: req.category,
     num_samples: req.params?.numSamples ?? 1,
   };
-  return req.params?.seed === undefined ? base : { ...base, seed: req.params.seed };
+  return req.params?.seed !== undefined ? base : { ...base, seed: req.params.seed };
 }
 
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: expected { …(4) } to deeply equal { …(5) }

[Killed] BlockStatement
src/providers/self-hosted.ts:67:58
   private readonly fetchImpl: FetchLike;
   private readonly costPerCallUsd: number;
 
-  public constructor(options: SelfHostedProviderOptions) {
-    // Strip a trailing slash so the joined path is well-formed regardless of caller input.
-    this.baseUrl = options.baseUrl.replace(/\/+$/, '');
-    this.fetchImpl = options.fetchImpl;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
-  }
+  public constructor(options: SelfHostedProviderOptions) {}
 
   public async tryOn(req: TryOnRequest, ctx: ProviderContext): Promise<TryOnResult> {
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: this.fetchImpl is not a function

[Killed] StringLiteral
src/providers/self-hosted.ts:69:52
 
   public constructor(options: SelfHostedProviderOptions) {
     // Strip a trailing slash so the joined path is well-formed regardless of caller input.
-    this.baseUrl = options.baseUrl.replace(/\/+$/, '');
+    this.baseUrl = options.baseUrl.replace(/\/+$/, "Stryker was here!");
     this.fetchImpl = options.fetchImpl;
     this.costPerCallUsd = options.costPerCallUsd ?? 0;
killedBy: SelfHostedProvider normalises a trailing slash on the base url
statusReason: expected 'https://infer.example.comStryker was …' to be 'https://infer.example.com/infer' // Object.is equality

[Killed] LogicalOperator
src/providers/self-hosted.ts:71:27
     // Strip a trailing slash so the joined path is well-formed regardless of caller input.
     this.baseUrl = options.baseUrl.replace(/\/+$/, '');
     this.fetchImpl = options.fetchImpl;
-    this.costPerCallUsd = options.costPerCallUsd ?? 0;
+    this.costPerCallUsd = options.costPerCallUsd && 0;
   }
 
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: expected +0 to be 0.01 // Object.is equality

[Killed] StringLiteral
src/providers/self-hosted.ts:78:15
     const body = mapBody(req);
     ctx.logger.debug('selfHosted.tryOn', { baseUrl: this.baseUrl, tenantId: req.tenantId });
     const response = await this.fetchImpl(`${this.baseUrl}/infer`, {
-      method: 'POST',
+      method: "",
       headers: { 'content-type': 'application/json' },
       body: JSON.stringify(body),
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: expected '' to be 'POST' // Object.is equality

[Killed] BlockStatement
src/providers/self-hosted.ts:83:23
       body: JSON.stringify(body),
       signal: ctx.signal,
     });
-    if (!response.ok) {
-      // fail-closed: a non-2xx upstream status is a failure, not a degraded success.
-      throw new Error(`self-hosted: inference service returned status ${response.status}`);
-    }
+    if (!response.ok) {}
     const payload = (await response.json()) as { image_url?: unknown };
     const url = payload.image_url;
killedBy: SelfHostedProvider fails closed on a non-2xx status
statusReason: expected [Function] to throw error matching /status 503/ but got 'self-hosted: response missing image_u…'

[Killed] ConditionalExpression
src/providers/self-hosted.ts:83:9
       body: JSON.stringify(body),
       signal: ctx.signal,
     });
-    if (!response.ok) {
+    if (true) {
       // fail-closed: a non-2xx upstream status is a failure, not a degraded success.
       throw new Error(`self-hosted: inference service returned status ${response.status}`);
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: self-hosted: inference service returned status 200

[Killed] EqualityOperator
src/providers/self-hosted.ts:89:9
     }
     const payload = (await response.json()) as { image_url?: unknown };
     const url = payload.image_url;
-    if (typeof url !== 'string' || url.length === 0) {
+    if (typeof url === 'string' || url.length === 0) {
       throw new Error('self-hosted: response missing image_url');
     }
killedBy: SelfHostedProvider POSTs the mapped body to /infer and forwards the abort signal
statusReason: self-hosted: response missing image_url

[Killed] ConditionalExpression
src/providers/self-hosted.ts:89:9
     }
     const payload = (await response.json()) as { image_url?: unknown };
     const url = payload.image_url;
-    if (typeof url !== 'string' || url.length === 0) {
+    if (false) {
       throw new Error('self-hosted: response missing image_url');
     }
killedBy: SelfHostedProvider fails closed when the response is missing image_url
statusReason: expected [Function] to throw error matching /missing image_url/ but got 'self-hosted: malformed provider resul…'
