[Killed] ObjectLiteral
src/provider.ts:26:42
 }
 
 /** A no-op logger used as the safe default so a missing logger never throws. */
-export const NOOP_LOGGER: EngineLogger = {
-  debug: () => undefined,
-  warn: () => undefined,
-  error: () => undefined,
-};
+export const NOOP_LOGGER: EngineLogger = {};
 
 /**
killedBy: EngineRouter falls through a throwing provider to the next, then to deterministic
statusReason: this.logger.warn is not a function
